[Survived] BlockStatement
src/lib/ExtensionBridge.ts:61:48
 ];
 const ALLOWLIST_STORAGE_KEY = 'aegis_extension_allowlist_v1';
 
-function parseAllowlist(raw: string): string[] {
-  return raw
-    .split(',')
-    .map((id) => id.trim())
-    .filter(Boolean);
-}
+function parseAllowlist(raw: string): string[] {}
 
 function buildInitialAllowlist(): string[] {

[Killed] MethodExpression
src/lib/ExtensionBridge.ts:62:10
 const ALLOWLIST_STORAGE_KEY = 'aegis_extension_allowlist_v1';
 
 function parseAllowlist(raw: string): string[] {
-  return raw
-    .split(',')
-    .map((id) => id.trim())
-    .filter(Boolean);
+  return raw.split(',').map(id => id.trim());
 }
 
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] MethodExpression
src/lib/ExtensionBridge.ts:64:18
 function parseAllowlist(raw: string): string[] {
   return raw
     .split(',')
-    .map((id) => id.trim())
+    .map((id) => id)
     .filter(Boolean);
 }
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ Array(4) ] to include 'ext1'

[Killed] ArrowFunction
src/lib/ExtensionBridge.ts:64:10
 function parseAllowlist(raw: string): string[] {
   return raw
     .split(',')
-    .map((id) => id.trim())
+    .map(() => undefined)
     .filter(Boolean);
 }
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ …(2) ] to include 'ext1'

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:68:44
     .filter(Boolean);
 }
 
-function buildInitialAllowlist(): string[] {
-  const envRaw =
-    (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_ALLOWED_EXTENSION_IDS ||
-    (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_EXTENSION_ID ||
-    '';
-  const envIds = parseAllowlist(envRaw);
-  return envIds.length > 0 ? envIds : [...DEFAULT_ALLOWED_EXTENSION_IDS];
-}
+function buildInitialAllowlist(): string[] {}
 
 class ExtensionBridge {
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Survived] LogicalOperator
src/lib/ExtensionBridge.ts:70:5
 
 function buildInitialAllowlist(): string[] {
   const envRaw =
-    (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_ALLOWED_EXTENSION_IDS ||
-    (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_EXTENSION_ID ||
+    (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_ALLOWED_EXTENSION_IDS && (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_EXTENSION_ID ||
     '';
   const envIds = parseAllowlist(envRaw);

[Survived] LogicalOperator
src/lib/ExtensionBridge.ts:70:5
 
 function buildInitialAllowlist(): string[] {
   const envRaw =
-    (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_ALLOWED_EXTENSION_IDS ||
-    (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_EXTENSION_ID ||
-    '';
+    ((import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_ALLOWED_EXTENSION_IDS || (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_EXTENSION_ID) && '';
   const envIds = parseAllowlist(envRaw);
   return envIds.length > 0 ? envIds : [...DEFAULT_ALLOWED_EXTENSION_IDS];

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:74:10
     (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_EXTENSION_ID ||
     '';
   const envIds = parseAllowlist(envRaw);
-  return envIds.length > 0 ? envIds : [...DEFAULT_ALLOWED_EXTENSION_IDS];
+  return envIds.length <= 0 ? envIds : [...DEFAULT_ALLOWED_EXTENSION_IDS];
 }
 
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:74:10
     (import.meta.env as ImportMetaEnvWithExtensionIds).VITE_AEGIS_EXTENSION_ID ||
     '';
   const envIds = parseAllowlist(envRaw);
-  return envIds.length > 0 ? envIds : [...DEFAULT_ALLOWED_EXTENSION_IDS];
+  return envIds.length >= 0 ? envIds : [...DEFAULT_ALLOWED_EXTENSION_IDS];
 }
 
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called at least once

[Survived] BooleanLiteral
src/lib/ExtensionBridge.ts:78:34
 }
 
 class ExtensionBridge {
-  private isListening: boolean = false;
+  private isListening: boolean = true;
   private readonly challengeTtlMs = 20_000;
   private allowedExtensionIds: Set<string> = new Set(buildInitialAllowlist());

[Survived] BlockStatement
src/lib/ExtensionBridge.ts:83:17
   private allowedExtensionIds: Set<string> = new Set(buildInitialAllowlist());
   private activeSessions: Map<ExtensionPort, PortSession> = new Map();
 
-  constructor() {
-    this.loadAllowlistFromStorage();
-  }
+  constructor() {}
 
   private getRuntime() {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:87:24
     this.loadAllowlistFromStorage();
   }
 
-  private getRuntime() {
-    return (window as WindowWithChromeRuntime).chrome?.runtime;
-  }
+  private getRuntime() {}
 
   private toHex(buffer: ArrayBuffer): string {
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called at least once

[Survived] OptionalChaining
src/lib/ExtensionBridge.ts:88:12
   }
 
   private getRuntime() {
-    return (window as WindowWithChromeRuntime).chrome?.runtime;
+    return (window as WindowWithChromeRuntime).chrome.runtime;
   }
 

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:91:46
     return (window as WindowWithChromeRuntime).chrome?.runtime;
   }
 
-  private toHex(buffer: ArrayBuffer): string {
-    const bytes = new Uint8Array(buffer);
-    return Array.from(bytes)
-      .map((b) => b.toString(16).padStart(2, '0'))
-      .join('');
-  }
+  private toHex(buffer: ArrayBuffer): string {}
 
   private isExtensionAllowed(extensionId: string): boolean {
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/lib/ExtensionBridge.ts:94:12
   private toHex(buffer: ArrayBuffer): string {
     const bytes = new Uint8Array(buffer);
     return Array.from(bytes)
-      .map((b) => b.toString(16).padStart(2, '0'))
+      .map(() => undefined)
       .join('');
   }
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:95:13
     const bytes = new Uint8Array(buffer);
     return Array.from(bytes)
       .map((b) => b.toString(16).padStart(2, '0'))
-      .join('');
+      .join("Stryker was here!");
   }
 
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:98:60
       .join('');
   }
 
-  private isExtensionAllowed(extensionId: string): boolean {
-    return this.allowedExtensionIds.has(extensionId);
-  }
+  private isExtensionAllowed(extensionId: string): boolean {}
 
   private getAllowlistStorage(): Storage | null {
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:102:49
     return this.allowedExtensionIds.has(extensionId);
   }
 
-  private getAllowlistStorage(): Storage | null {
-    try {
-      return window.localStorage;
-    } catch {
-      return null;
-    }
-  }
+  private getAllowlistStorage(): Storage | null {}
 
   private loadAllowlistFromStorage(): void {
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ …(2) ] to include 'ext1'

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:103:9
   }
 
   private getAllowlistStorage(): Storage | null {
-    try {
-      return window.localStorage;
-    } catch {
+    try {} catch {
       return null;
     }
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ …(2) ] to include 'ext1'

[Survived] BlockStatement
src/lib/ExtensionBridge.ts:105:13
   private getAllowlistStorage(): Storage | null {
     try {
       return window.localStorage;
-    } catch {
-      return null;
-    }
+    } catch {}
   }
 

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:110:44
     }
   }
 
-  private loadAllowlistFromStorage(): void {
-    const storage = this.getAllowlistStorage();
-    if (!storage) return;
-
-    const raw = storage.getItem(ALLOWLIST_STORAGE_KEY);
-    if (!raw) return;
-
-    const runtimeIds = parseAllowlist(raw);
-    if (runtimeIds.length === 0) return;
-
-    this.allowedExtensionIds = new Set(runtimeIds);
-  }
+  private loadAllowlistFromStorage(): void {}
 
   private persistAllowlist(): void {
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ …(2) ] to include 'ext1'

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:112:9
 
   private loadAllowlistFromStorage(): void {
     const storage = this.getAllowlistStorage();
-    if (!storage) return;
+    if (false) return;
 
     const raw = storage.getItem(ALLOWLIST_STORAGE_KEY);
killedBy: ExtensionBridge 14. getAllowlistStorage handles localStorage throws
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:112:9
 
   private loadAllowlistFromStorage(): void {
     const storage = this.getAllowlistStorage();
-    if (!storage) return;
+    if (storage) return;
 
     const raw = storage.getItem(ALLOWLIST_STORAGE_KEY);
killedBy: ExtensionBridge 14. getAllowlistStorage handles localStorage throws
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:115:9
     if (!storage) return;
 
     const raw = storage.getItem(ALLOWLIST_STORAGE_KEY);
-    if (!raw) return;
+    if (true) return;
 
     const runtimeIds = parseAllowlist(raw);
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ …(2) ] to include 'ext1'

[Survived] BooleanLiteral
src/lib/ExtensionBridge.ts:115:9
     if (!storage) return;
 
     const raw = storage.getItem(ALLOWLIST_STORAGE_KEY);
-    if (!raw) return;
+    if (raw) return;
 
     const runtimeIds = parseAllowlist(raw);

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:118:9
     if (!raw) return;
 
     const runtimeIds = parseAllowlist(raw);
-    if (runtimeIds.length === 0) return;
+    if (runtimeIds.length !== 0) return;
 
     this.allowedExtensionIds = new Set(runtimeIds);
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ …(2) ] to include 'ext1'

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:118:9
     if (!raw) return;
 
     const runtimeIds = parseAllowlist(raw);
-    if (runtimeIds.length === 0) return;
+    if (true) return;
 
     this.allowedExtensionIds = new Set(runtimeIds);
killedBy: ExtensionBridge 25. getAllowlistStorage respects local changes and edge cases
statusReason: expected [ …(2) ] to include 'ext1'

[Survived] BlockStatement
src/lib/ExtensionBridge.ts:123:36
     this.allowedExtensionIds = new Set(runtimeIds);
   }
 
-  private persistAllowlist(): void {
-    const storage = this.getAllowlistStorage();
-    if (!storage) return;
-    storage.setItem(ALLOWLIST_STORAGE_KEY, Array.from(this.allowedExtensionIds).join(','));
-  }
+  private persistAllowlist(): void {}
 
   private async signSessionPayload(token: string, payload: string): Promise<string> {

[Survived] ConditionalExpression
src/lib/ExtensionBridge.ts:125:9
 
   private persistAllowlist(): void {
     const storage = this.getAllowlistStorage();
-    if (!storage) return;
+    if (true) return;
     storage.setItem(ALLOWLIST_STORAGE_KEY, Array.from(this.allowedExtensionIds).join(','));
   }

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:129:85
     storage.setItem(ALLOWLIST_STORAGE_KEY, Array.from(this.allowedExtensionIds).join(','));
   }
 
-  private async signSessionPayload(token: string, payload: string): Promise<string> {
-    const key = await window.crypto.subtle.importKey(
-      'raw',
-      new TextEncoder().encode(token),
-      { name: 'HMAC', hash: 'SHA-256' },
-      false,
-      ['sign']
-    );
-    const signature = await window.crypto.subtle.sign(
-      'HMAC',
-      key,
-      new TextEncoder().encode(payload)
-    );
-    return this.toHex(signature);
-  }
+  private async signSessionPayload(token: string, payload: string): Promise<string> {}
 
   private cleanupExpiredChallenges(session: PortSession, now: number = Date.now()) {
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:131:7
 
   private async signSessionPayload(token: string, payload: string): Promise<string> {
     const key = await window.crypto.subtle.importKey(
-      'raw',
+      "",
       new TextEncoder().encode(token),
       { name: 'HMAC', hash: 'SHA-256' },
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: Failed to execute 'importKey' on 'SubtleCrypto': 1st argument value '' is not a valid enum value of type KeyFormat.

[Survived] BooleanLiteral
src/lib/ExtensionBridge.ts:134:7
       'raw',
       new TextEncoder().encode(token),
       { name: 'HMAC', hash: 'SHA-256' },
-      false,
+      true,
       ['sign']
     );

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:135:8
       new TextEncoder().encode(token),
       { name: 'HMAC', hash: 'SHA-256' },
       false,
-      ['sign']
+      [""]
     );
     const signature = await window.crypto.subtle.sign(
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: Failed to execute 'importKey' on 'SubtleCrypto': 5th argument, index 0 value '' is not a valid enum value of type KeyUsage.

[Survived] BlockStatement
src/lib/ExtensionBridge.ts:145:84
     return this.toHex(signature);
   }
 
-  private cleanupExpiredChallenges(session: PortSession, now: number = Date.now()) {
-    for (const [nonce, expiresAt] of session.challengeNonceMap.entries()) {
-      if (expiresAt <= now) {
-        session.challengeNonceMap.delete(nonce);
-      }
-    }
-  }
+  private cleanupExpiredChallenges(session: PortSession, now: number = Date.now()) {}
 
   private async verifySignedRequest(

[Survived] BlockStatement
src/lib/ExtensionBridge.ts:146:75
   }
 
   private cleanupExpiredChallenges(session: PortSession, now: number = Date.now()) {
-    for (const [nonce, expiresAt] of session.challengeNonceMap.entries()) {
-      if (expiresAt <= now) {
-        session.challengeNonceMap.delete(nonce);
-      }
-    }
+    for (const [nonce, expiresAt] of session.challengeNonceMap.entries()) {}
   }
 

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:147:11
 
   private cleanupExpiredChallenges(session: PortSession, now: number = Date.now()) {
     for (const [nonce, expiresAt] of session.challengeNonceMap.entries()) {
-      if (expiresAt <= now) {
+      if (true) {
         session.challengeNonceMap.delete(nonce);
       }
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:147:11
 
   private cleanupExpiredChallenges(session: PortSession, now: number = Date.now()) {
     for (const [nonce, expiresAt] of session.challengeNonceMap.entries()) {
-      if (expiresAt <= now) {
+      if (expiresAt > now) {
         session.challengeNonceMap.delete(nonce);
       }
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:160:23
     nonce: string,
     ts: number,
     signature: string
-  ): Promise<boolean> {
-    if (!nonce || !signature || !Number.isFinite(ts)) return false;
-
-    const now = Date.now();
-    this.cleanupExpiredChallenges(session, now);
-
-    const nonceExpiresAt = session.challengeNonceMap.get(nonce);
-    if (!nonceExpiresAt || nonceExpiresAt <= now) return false;
-    if (Math.abs(now - ts) > this.challengeTtlMs) return false;
-
-    const payload = `${type}:${domain || ''}:${nonce}:${ts}`;
-    const expectedSig = await this.signSessionPayload(session.token, payload);
-    if (expectedSig.length !== signature.length) return false;
-
-    let mismatch = 0;
-    for (let i = 0; i < expectedSig.length; i++) {
-      mismatch |= expectedSig.charCodeAt(i) ^ signature.charCodeAt(i);
-    }
-
-    const valid = mismatch === 0;
-    if (valid) {
-      session.challengeNonceMap.delete(nonce);
-    }
-    return valid;
-  }
+  ): Promise<boolean> {}
 
   private normalizeDomain(input: string): string {
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:161:19
     ts: number,
     signature: string
   ): Promise<boolean> {
-    if (!nonce || !signature || !Number.isFinite(ts)) return false;
+    if (!nonce || signature || !Number.isFinite(ts)) return false;
 
     const now = Date.now();
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:161:9
     ts: number,
     signature: string
   ): Promise<boolean> {
-    if (!nonce || !signature || !Number.isFinite(ts)) return false;
+    if (true) return false;
 
     const now = Date.now();
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/lib/ExtensionBridge.ts:167:9
     this.cleanupExpiredChallenges(session, now);
 
     const nonceExpiresAt = session.challengeNonceMap.get(nonce);
-    if (!nonceExpiresAt || nonceExpiresAt <= now) return false;
+    if (!nonceExpiresAt && nonceExpiresAt <= now) return false;
     if (Math.abs(now - ts) > this.challengeTtlMs) return false;
 
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:167:58
     this.cleanupExpiredChallenges(session, now);
 
     const nonceExpiresAt = session.challengeNonceMap.get(nonce);
-    if (!nonceExpiresAt || nonceExpiresAt <= now) return false;
+    if (!nonceExpiresAt || nonceExpiresAt <= now) return true;
     if (Math.abs(now - ts) > this.challengeTtlMs) return false;
 
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/lib/ExtensionBridge.ts:168:18
 
     const nonceExpiresAt = session.challengeNonceMap.get(nonce);
     if (!nonceExpiresAt || nonceExpiresAt <= now) return false;
-    if (Math.abs(now - ts) > this.challengeTtlMs) return false;
+    if (Math.abs(now + ts) > this.challengeTtlMs) return false;
 
     const payload = `${type}:${domain || ''}:${nonce}:${ts}`;
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:168:58
 
     const nonceExpiresAt = session.challengeNonceMap.get(nonce);
     if (!nonceExpiresAt || nonceExpiresAt <= now) return false;
-    if (Math.abs(now - ts) > this.challengeTtlMs) return false;
+    if (Math.abs(now - ts) > this.challengeTtlMs) return true;
 
     const payload = `${type}:${domain || ''}:${nonce}:${ts}`;
killedBy: ExtensionBridge 11. verifySignedRequest enforces strict time drift and nonce validity
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:170:32
     if (!nonceExpiresAt || nonceExpiresAt <= now) return false;
     if (Math.abs(now - ts) > this.challengeTtlMs) return false;
 
-    const payload = `${type}:${domain || ''}:${nonce}:${ts}`;
+    const payload = `${type}:${false}:${nonce}:${ts}`;
     const expectedSig = await this.signSessionPayload(session.token, payload);
     if (expectedSig.length !== signature.length) return false;
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/lib/ExtensionBridge.ts:170:32
     if (!nonceExpiresAt || nonceExpiresAt <= now) return false;
     if (Math.abs(now - ts) > this.challengeTtlMs) return false;
 
-    const payload = `${type}:${domain || ''}:${nonce}:${ts}`;
+    const payload = `${type}:${domain && ''}:${nonce}:${ts}`;
     const expectedSig = await this.signSessionPayload(session.token, payload);
     if (expectedSig.length !== signature.length) return false;
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:172:9
 
     const payload = `${type}:${domain || ''}:${nonce}:${ts}`;
     const expectedSig = await this.signSessionPayload(session.token, payload);
-    if (expectedSig.length !== signature.length) return false;
+    if (true) return false;
 
     let mismatch = 0;
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:172:9
 
     const payload = `${type}:${domain || ''}:${nonce}:${ts}`;
     const expectedSig = await this.signSessionPayload(session.token, payload);
-    if (expectedSig.length !== signature.length) return false;
+    if (expectedSig.length === signature.length) return false;
 
     let mismatch = 0;
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:175:21
     if (expectedSig.length !== signature.length) return false;
 
     let mismatch = 0;
-    for (let i = 0; i < expectedSig.length; i++) {
+    for (let i = 0; i >= expectedSig.length; i++) {
       mismatch |= expectedSig.charCodeAt(i) ^ signature.charCodeAt(i);
     }
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 5. Invalid Token Signature: HMAC imza sahteciliği yakalanmalıdır
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:175:21
     if (expectedSig.length !== signature.length) return false;
 
     let mismatch = 0;
-    for (let i = 0; i < expectedSig.length; i++) {
+    for (let i = 0; false; i++) {
       mismatch |= expectedSig.charCodeAt(i) ^ signature.charCodeAt(i);
     }
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 5. Invalid Token Signature: HMAC imza sahteciliği yakalanmalıdır
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] AssignmentOperator
src/lib/ExtensionBridge.ts:176:7
 
     let mismatch = 0;
     for (let i = 0; i < expectedSig.length; i++) {
-      mismatch |= expectedSig.charCodeAt(i) ^ signature.charCodeAt(i);
+      mismatch &= expectedSig.charCodeAt(i) ^ signature.charCodeAt(i);
     }
 
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 5. Invalid Token Signature: HMAC imza sahteciliği yakalanmalıdır
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:179:19
       mismatch |= expectedSig.charCodeAt(i) ^ signature.charCodeAt(i);
     }
 
-    const valid = mismatch === 0;
+    const valid = true;
     if (valid) {
       session.challengeNonceMap.delete(nonce);
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 5. Invalid Token Signature: HMAC imza sahteciliği yakalanmalıdır
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:179:19
       mismatch |= expectedSig.charCodeAt(i) ^ signature.charCodeAt(i);
     }
 
-    const valid = mismatch === 0;
+    const valid = mismatch !== 0;
     if (valid) {
       session.challengeNonceMap.delete(nonce);
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:180:9
     }
 
     const valid = mismatch === 0;
-    if (valid) {
+    if (false) {
       session.challengeNonceMap.delete(nonce);
     }
killedBy: ExtensionBridge 22. get_decrypted_creds properly deletes challenge nonce on valid request
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:180:16
     }
 
     const valid = mismatch === 0;
-    if (valid) {
-      session.challengeNonceMap.delete(nonce);
-    }
+    if (valid) {}
     return valid;
   }
killedBy: ExtensionBridge 22. get_decrypted_creds properly deletes challenge nonce on valid request
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:186:50
     return valid;
   }
 
-  private normalizeDomain(input: string): string {
-    try {
-      const parsed = input.includes('://') ? new URL(input) : new URL(`https://${input}`);
-      return parsed.hostname
-        .toLowerCase()
-        .replace(/^www\./, '')
-        .trim();
-    } catch {
-      return (input || '')
-        .toLowerCase()
-        .replace(/^www\./, '')
-        .trim();
-    }
-  }
+  private normalizeDomain(input: string): string {}
 
   private toRegistrableDomain(hostname: string): string {
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:187:9
   }
 
   private normalizeDomain(input: string): string {
-    try {
-      const parsed = input.includes('://') ? new URL(input) : new URL(`https://${input}`);
-      return parsed.hostname
-        .toLowerCase()
-        .replace(/^www\./, '')
-        .trim();
-    } catch {
+    try {} catch {
       return (input || '')
         .toLowerCase()
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[Survived] StringLiteral
src/lib/ExtensionBridge.ts:188:71
 
   private normalizeDomain(input: string): string {
     try {
-      const parsed = input.includes('://') ? new URL(input) : new URL(`https://${input}`);
+      const parsed = input.includes('://') ? new URL(input) : new URL(``);
       return parsed.hostname
         .toLowerCase()
