[Killed] MethodExpression
src/lib/ExtensionBridge.ts:189:14
   private normalizeDomain(input: string): string {
     try {
       const parsed = input.includes('://') ? new URL(input) : new URL(`https://${input}`);
-      return parsed.hostname
-        .toLowerCase()
+      return parsed.hostname.toUpperCase()
         .replace(/^www\./, '')
         .trim();
killedBy: ExtensionBridge 9. normalizeDomain handles various URL formats and case sensitivity
statusReason: expected 'GOOGLE.COM' to be 'google.com' // Object.is equality

[Survived] MethodExpression
src/lib/ExtensionBridge.ts:189:14
   private normalizeDomain(input: string): string {
     try {
       const parsed = input.includes('://') ? new URL(input) : new URL(`https://${input}`);
-      return parsed.hostname
-        .toLowerCase()
-        .replace(/^www\./, '')
-        .trim();
+      return parsed.hostname.toLowerCase().replace(/^www\./, '');
     } catch {
       return (input || '')

[Survived] Regex
src/lib/ExtensionBridge.ts:191:18
       const parsed = input.includes('://') ? new URL(input) : new URL(`https://${input}`);
       return parsed.hostname
         .toLowerCase()
-        .replace(/^www\./, '')
+        .replace(/www\./, '')
         .trim();
     } catch {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:193:13
         .toLowerCase()
         .replace(/^www\./, '')
         .trim();
-    } catch {
-      return (input || '')
-        .toLowerCase()
-        .replace(/^www\./, '')
-        .trim();
-    }
+    } catch {}
   }
 
killedBy: ExtensionBridge 9. normalizeDomain handles various URL formats and case sensitivity
statusReason: expected undefined to be 'invalid-url::::' // Object.is equality

[Killed] MethodExpression
src/lib/ExtensionBridge.ts:194:14
         .replace(/^www\./, '')
         .trim();
     } catch {
-      return (input || '')
-        .toLowerCase()
+      return (input || '').toUpperCase()
         .replace(/^www\./, '')
         .trim();
killedBy: ExtensionBridge 9. normalizeDomain handles various URL formats and case sensitivity
statusReason: expected 'INVALID-URL::::' to be 'invalid-url::::' // Object.is equality

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:194:15
         .replace(/^www\./, '')
         .trim();
     } catch {
-      return (input || '')
+      return (true)
         .toLowerCase()
         .replace(/^www\./, '')
killedBy: ExtensionBridge 9. normalizeDomain handles various URL formats and case sensitivity
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function

[Survived] StringLiteral
src/lib/ExtensionBridge.ts:196:28
     } catch {
       return (input || '')
         .toLowerCase()
-        .replace(/^www\./, '')
+        .replace(/^www\./, "Stryker was here!")
         .trim();
     }

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:201:57
     }
   }
 
-  private toRegistrableDomain(hostname: string): string {
-    const parts = (hostname || '').split('.').filter(Boolean);
-    if (parts.length <= 2) return hostname;
-    return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
-  }
+  private toRegistrableDomain(hostname: string): string {}
 
   private isExactDomainMatch(entryWebsite: string, requestedDomain: string): boolean {
killedBy: ExtensionBridge 10. toRegistrableDomain extracts the correct base domain
statusReason: expected undefined to be 'example.com' // Object.is equality

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:202:20
   }
 
   private toRegistrableDomain(hostname: string): string {
-    const parts = (hostname || '').split('.').filter(Boolean);
+    const parts = (false).split('.').filter(Boolean);
     if (parts.length <= 2) return hostname;
     return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
killedBy: ExtensionBridge 10. toRegistrableDomain extracts the correct base domain
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).split is not a function

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:202:20
   }
 
   private toRegistrableDomain(hostname: string): string {
-    const parts = (hostname || '').split('.').filter(Boolean);
+    const parts = (true).split('.').filter(Boolean);
     if (parts.length <= 2) return hostname;
     return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
killedBy: ExtensionBridge 10. toRegistrableDomain extracts the correct base domain
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).split is not a function

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:203:9
 
   private toRegistrableDomain(hostname: string): string {
     const parts = (hostname || '').split('.').filter(Boolean);
-    if (parts.length <= 2) return hostname;
+    if (true) return hostname;
     return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
   }
killedBy: ExtensionBridge 10. toRegistrableDomain extracts the correct base domain
statusReason: expected 'sub.example.com' to be 'example.com' // Object.is equality

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:203:9
 
   private toRegistrableDomain(hostname: string): string {
     const parts = (hostname || '').split('.').filter(Boolean);
-    if (parts.length <= 2) return hostname;
+    if (parts.length > 2) return hostname;
     return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
   }
killedBy: ExtensionBridge 10. toRegistrableDomain extracts the correct base domain
statusReason: expected 'sub.example.com' to be 'example.com' // Object.is equality

[Killed] ArithmeticOperator
src/lib/ExtensionBridge.ts:204:21
   private toRegistrableDomain(hostname: string): string {
     const parts = (hostname || '').split('.').filter(Boolean);
     if (parts.length <= 2) return hostname;
-    return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
+    return `${parts[parts.length + 2]}.${parts[parts.length - 1]}`;
   }
 
killedBy: ExtensionBridge 10. toRegistrableDomain extracts the correct base domain
statusReason: expected 'undefined.com' to be 'example.com' // Object.is equality

[Killed] ArithmeticOperator
src/lib/ExtensionBridge.ts:204:48
   private toRegistrableDomain(hostname: string): string {
     const parts = (hostname || '').split('.').filter(Boolean);
     if (parts.length <= 2) return hostname;
-    return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
+    return `${parts[parts.length - 2]}.${parts[parts.length + 1]}`;
   }
 
killedBy: ExtensionBridge 10. toRegistrableDomain extracts the correct base domain
statusReason: expected 'example.undefined' to be 'example.com' // Object.is equality

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:207:86
     return `${parts[parts.length - 2]}.${parts[parts.length - 1]}`;
   }
 
-  private isExactDomainMatch(entryWebsite: string, requestedDomain: string): boolean {
-    const entryHost = this.normalizeDomain(entryWebsite);
-    const reqHost = this.normalizeDomain(requestedDomain);
-    if (!entryHost || !reqHost) return false;
-    if (entryHost === reqHost) return true;
-    return this.toRegistrableDomain(entryHost) === this.toRegistrableDomain(reqHost);
-  }
+  private isExactDomainMatch(entryWebsite: string, requestedDomain: string): boolean {}
 
   private attachPort(extensionId: string, port: ExtensionPort): void {
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:210:9
   private isExactDomainMatch(entryWebsite: string, requestedDomain: string): boolean {
     const entryHost = this.normalizeDomain(entryWebsite);
     const reqHost = this.normalizeDomain(requestedDomain);
-    if (!entryHost || !reqHost) return false;
+    if (entryHost || !reqHost) return false;
     if (entryHost === reqHost) return true;
     return this.toRegistrableDomain(entryHost) === this.toRegistrableDomain(reqHost);
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:210:9
   private isExactDomainMatch(entryWebsite: string, requestedDomain: string): boolean {
     const entryHost = this.normalizeDomain(entryWebsite);
     const reqHost = this.normalizeDomain(requestedDomain);
-    if (!entryHost || !reqHost) return false;
+    if (true) return false;
     if (entryHost === reqHost) return true;
     return this.toRegistrableDomain(entryHost) === this.toRegistrableDomain(reqHost);
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:211:39
     const entryHost = this.normalizeDomain(entryWebsite);
     const reqHost = this.normalizeDomain(requestedDomain);
     if (!entryHost || !reqHost) return false;
-    if (entryHost === reqHost) return true;
+    if (entryHost === reqHost) return false;
     return this.toRegistrableDomain(entryHost) === this.toRegistrableDomain(reqHost);
   }
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:211:9
     const entryHost = this.normalizeDomain(entryWebsite);
     const reqHost = this.normalizeDomain(requestedDomain);
     if (!entryHost || !reqHost) return false;
-    if (entryHost === reqHost) return true;
+    if (entryHost !== reqHost) return true;
     return this.toRegistrableDomain(entryHost) === this.toRegistrableDomain(reqHost);
   }
killedBy: ExtensionBridge 17. isExactDomainMatch covers domain edge cases
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:212:12
     const reqHost = this.normalizeDomain(requestedDomain);
     if (!entryHost || !reqHost) return false;
     if (entryHost === reqHost) return true;
-    return this.toRegistrableDomain(entryHost) === this.toRegistrableDomain(reqHost);
+    return true;
   }
 
killedBy: ExtensionBridge 17. isExactDomainMatch covers domain edge cases
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:212:12
     const reqHost = this.normalizeDomain(requestedDomain);
     if (!entryHost || !reqHost) return false;
     if (entryHost === reqHost) return true;
-    return this.toRegistrableDomain(entryHost) === this.toRegistrableDomain(reqHost);
+    return false;
   }
 
killedBy: ExtensionBridge 17. isExactDomainMatch covers domain edge cases
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:223:30
     };
 
     this.activeSessions.set(port, session);
-    port.postMessage({ type: 'SYNC_TOKEN', token: session.token });
+    port.postMessage({ type: "", token: session.token });
 
     port.onMessage.addListener(async (msg: ExtensionPortRequest) => {
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:227:11
 
     port.onMessage.addListener(async (msg: ExtensionPortRequest) => {
       const currentSession = this.activeSessions.get(port);
-      if (!currentSession) return;
+      if (true) return;
 
       if (msg.token !== currentSession.token) {
killedBy: ExtensionBridge 3. CHALLENGE istegine yanit verir
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:227:11
 
     port.onMessage.addListener(async (msg: ExtensionPortRequest) => {
       const currentSession = this.activeSessions.get(port);
-      if (!currentSession) return;
+      if (currentSession) return;
 
       if (msg.token !== currentSession.token) {
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 5. Invalid Token Signature: HMAC imza sahteciliği yakalanmalıdır
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:229:11
       const currentSession = this.activeSessions.get(port);
       if (!currentSession) return;
 
-      if (msg.token !== currentSession.token) {
+      if (msg.token === currentSession.token) {
         port.postMessage({ type: 'ERROR', error: 'UNAUTHORIZED_TOKEN' });
         return;
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 5. Invalid Token Signature: HMAC imza sahteciliği yakalanmalıdır
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:229:47
       const currentSession = this.activeSessions.get(port);
       if (!currentSession) return;
 
-      if (msg.token !== currentSession.token) {
-        port.postMessage({ type: 'ERROR', error: 'UNAUTHORIZED_TOKEN' });
-        return;
-      }
+      if (msg.token !== currentSession.token) {}
 
       if (msg.type === 'REQUEST_CHALLENGE') {
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 6. Token Hijacking Prevention: Başka bir token ile istek gönderilmesi
statusReason: expected "vi.fn()" to not be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:230:50
       if (!currentSession) return;
 
       if (msg.token !== currentSession.token) {
-        port.postMessage({ type: 'ERROR', error: 'UNAUTHORIZED_TOKEN' });
+        port.postMessage({ type: 'ERROR', error: "" });
         return;
       }
killedBy: ExtensionBridge 4. Yanlis token ile gelen istekleri reddeder
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:234:45
         return;
       }
 
-      if (msg.type === 'REQUEST_CHALLENGE') {
-        const nonce = this.generateToken();
-        const expiresAt = Date.now() + this.challengeTtlMs;
-        currentSession.challengeNonceMap.set(nonce, expiresAt);
-        port.postMessage({ type: 'CHALLENGE_RESPONSE', nonce, expiresAt });
-        return;
-      }
+      if (msg.type === 'REQUEST_CHALLENGE') {}
 
       if (msg.type === 'get_decrypted_creds') {
killedBy: ExtensionBridge 3. CHALLENGE istegine yanit verir
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:234:11
         return;
       }
 
-      if (msg.type === 'REQUEST_CHALLENGE') {
+      if (false) {
         const nonce = this.generateToken();
         const expiresAt = Date.now() + this.challengeTtlMs;
killedBy: ExtensionBridge 3. CHALLENGE istegine yanit verir
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/lib/ExtensionBridge.ts:236:27
 
       if (msg.type === 'REQUEST_CHALLENGE') {
         const nonce = this.generateToken();
-        const expiresAt = Date.now() + this.challengeTtlMs;
+        const expiresAt = Date.now() - this.challengeTtlMs;
         currentSession.challengeNonceMap.set(nonce, expiresAt);
         port.postMessage({ type: 'CHALLENGE_RESPONSE', nonce, expiresAt });
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/ExtensionBridge.ts:238:26
         const nonce = this.generateToken();
         const expiresAt = Date.now() + this.challengeTtlMs;
         currentSession.challengeNonceMap.set(nonce, expiresAt);
-        port.postMessage({ type: 'CHALLENGE_RESPONSE', nonce, expiresAt });
+        port.postMessage({});
         return;
       }
killedBy: ExtensionBridge 3. CHALLENGE istegine yanit verir
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:242:11
         return;
       }
 
-      if (msg.type === 'get_decrypted_creds') {
+      if (msg.type !== 'get_decrypted_creds') {
         const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
         const ts = Number(msg.ts);
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:242:11
         return;
       }
 
-      if (msg.type === 'get_decrypted_creds') {
+      if (false) {
         const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
         const ts = Number(msg.ts);
killedBy: PairingAbuse (Security Stress Tests) - Phase 2 5. Invalid Token Signature: HMAC imza sahteciliği yakalanmalıdır
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:243:23
       }
 
       if (msg.type === 'get_decrypted_creds') {
-        const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
+        const nonce = typeof msg.nonce !== 'string' ? msg.nonce : '';
         const ts = Number(msg.ts);
         const signature = typeof msg.signature === 'string' ? msg.signature : '';
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:243:23
       }
 
       if (msg.type === 'get_decrypted_creds') {
-        const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
+        const nonce = false ? msg.nonce : '';
         const ts = Number(msg.ts);
         const signature = typeof msg.signature === 'string' ? msg.signature : '';
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:245:27
       if (msg.type === 'get_decrypted_creds') {
         const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
         const ts = Number(msg.ts);
-        const signature = typeof msg.signature === 'string' ? msg.signature : '';
+        const signature = false ? msg.signature : '';
         const domain = typeof msg.domain === 'string' ? msg.domain : '';
 
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:245:27
       if (msg.type === 'get_decrypted_creds') {
         const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
         const ts = Number(msg.ts);
-        const signature = typeof msg.signature === 'string' ? msg.signature : '';
+        const signature = typeof msg.signature !== 'string' ? msg.signature : '';
         const domain = typeof msg.domain === 'string' ? msg.domain : '';
 
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:246:24
         const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
         const ts = Number(msg.ts);
         const signature = typeof msg.signature === 'string' ? msg.signature : '';
-        const domain = typeof msg.domain === 'string' ? msg.domain : '';
+        const domain = typeof msg.domain !== 'string' ? msg.domain : '';
 
         const isSigned = await this.verifySignedRequest(
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:246:24
         const nonce = typeof msg.nonce === 'string' ? msg.nonce : '';
         const ts = Number(msg.ts);
         const signature = typeof msg.signature === 'string' ? msg.signature : '';
-        const domain = typeof msg.domain === 'string' ? msg.domain : '';
+        const domain = false ? msg.domain : '';
 
         const isSigned = await this.verifySignedRequest(
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:256:13
           ts,
           signature
         );
-        if (!isSigned) {
+        if (isSigned) {
           port.postMessage({ type: 'ERROR', error: 'INVALID_CHALLENGE_SIGNATURE' });
           return;
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:256:24
           ts,
           signature
         );
-        if (!isSigned) {
-          port.postMessage({ type: 'ERROR', error: 'INVALID_CHALLENGE_SIGNATURE' });
-          return;
-        }
+        if (!isSigned) {}
 
         if (!vaultService.isUnlocked()) {
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with invalid signature returns INVALID_CHALLENGE_SIGNATURE
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/ExtensionBridge.ts:257:28
           signature
         );
         if (!isSigned) {
-          port.postMessage({ type: 'ERROR', error: 'INVALID_CHALLENGE_SIGNATURE' });
+          port.postMessage({});
           return;
         }
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:261:13
           return;
         }
 
-        if (!vaultService.isUnlocked()) {
+        if (false) {
           port.postMessage({ type: 'ERROR', error: 'VAULT_LOCKED' });
           return;
killedBy: ExtensionBridge 16. get_decrypted_creds returns VAULT_LOCKED if vault is locked
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:261:13
           return;
         }
 
-        if (!vaultService.isUnlocked()) {
+        if (vaultService.isUnlocked()) {
           port.postMessage({ type: 'ERROR', error: 'VAULT_LOCKED' });
           return;
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:262:36
         }
 
         if (!vaultService.isUnlocked()) {
-          port.postMessage({ type: 'ERROR', error: 'VAULT_LOCKED' });
+          port.postMessage({ type: "", error: 'VAULT_LOCKED' });
           return;
         }
killedBy: ExtensionBridge 16. get_decrypted_creds returns VAULT_LOCKED if vault is locked
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:266:13
           return;
         }
 
-        try {
-          const creds = await vaultService.getPasswords();
-          const filteredCreds = domain
-            ? creds.filter((c) => this.isExactDomainMatch(c.website || '', domain))
-            : [];
-
-          const selected = filteredCreds.slice(0, 1).map((c) => ({
-            title: c.title,
-            username: c.username,
-            pass: c.pass || '',
-            website: c.website || '',
-          }));
-
-          port.postMessage({
-            type: 'DECRYPTED_CREDS_RESPONSE',
-            data: selected,
-          });
-        } catch {
+        try {} catch {
           port.postMessage({ type: 'ERROR', error: 'INTERNAL_ERROR' });
         }
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:269:59
         try {
           const creds = await vaultService.getPasswords();
           const filteredCreds = domain
-            ? creds.filter((c) => this.isExactDomainMatch(c.website || '', domain))
+            ? creds.filter((c) => this.isExactDomainMatch(false, domain))
             : [];
 
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/lib/ExtensionBridge.ts:269:59
         try {
           const creds = await vaultService.getPasswords();
           const filteredCreds = domain
-            ? creds.filter((c) => this.isExactDomainMatch(c.website || '', domain))
+            ? creds.filter((c) => this.isExactDomainMatch(c.website && '', domain))
             : [];
 
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: expected +0 to be 1 // Object.is equality

[NoCoverage] ArrayDeclaration
src/lib/ExtensionBridge.ts:270:15
           const creds = await vaultService.getPasswords();
           const filteredCreds = domain
             ? creds.filter((c) => this.isExactDomainMatch(c.website || '', domain))
-            : [];
+            : ["Stryker was here"];
 
           const selected = filteredCreds.slice(0, 1).map((c) => ({

[Killed] ArrowFunction
src/lib/ExtensionBridge.ts:272:58
             ? creds.filter((c) => this.isExactDomainMatch(c.website || '', domain))
             : [];
 
-          const selected = filteredCreds.slice(0, 1).map((c) => ({
-            title: c.title,
-            username: c.username,
-            pass: c.pass || '',
-            website: c.website || '',
-          }));
+          const selected = filteredCreds.slice(0, 1).map(() => undefined);
 
           port.postMessage({
killedBy: ExtensionBridge 29. get_decrypted_creds returns partial fallback on missing website
statusReason: Cannot read properties of undefined (reading 'website')

[Survived] MethodExpression
src/lib/ExtensionBridge.ts:272:28
             ? creds.filter((c) => this.isExactDomainMatch(c.website || '', domain))
             : [];
 
-          const selected = filteredCreds.slice(0, 1).map((c) => ({
+          const selected = filteredCreds.map((c) => ({
             title: c.title,
             username: c.username,

[Survived] ConditionalExpression
src/lib/ExtensionBridge.ts:275:19
           const selected = filteredCreds.slice(0, 1).map((c) => ({
             title: c.title,
             username: c.username,
-            pass: c.pass || '',
+            pass: false,
             website: c.website || '',
           }));

[Survived] ConditionalExpression
src/lib/ExtensionBridge.ts:275:19
           const selected = filteredCreds.slice(0, 1).map((c) => ({
             title: c.title,
             username: c.username,
-            pass: c.pass || '',
+            pass: true,
             website: c.website || '',
           }));

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:276:22
             title: c.title,
             username: c.username,
             pass: c.pass || '',
-            website: c.website || '',
+            website: false,
           }));
 
killedBy: ExtensionBridge 29. get_decrypted_creds returns partial fallback on missing website
statusReason: expected false to be 'example.com' // Object.is equality

[Killed] LogicalOperator
src/lib/ExtensionBridge.ts:276:22
             title: c.title,
             username: c.username,
             pass: c.pass || '',
-            website: c.website || '',
+            website: c.website && '',
           }));
 
killedBy: ExtensionBridge 29. get_decrypted_creds returns partial fallback on missing website
statusReason: expected '' to be 'example.com' // Object.is equality
