[Killed] StringLiteral
src/lib/ExtensionBridge.ts:280:19
           }));
 
           port.postMessage({
-            type: 'DECRYPTED_CREDS_RESPONSE',
+            type: "",
             data: selected,
           });
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:283:17
             type: 'DECRYPTED_CREDS_RESPONSE',
             data: selected,
           });
-        } catch {
-          port.postMessage({ type: 'ERROR', error: 'INTERNAL_ERROR' });
-        }
+        } catch {}
       }
     });
killedBy: ExtensionBridge 18. get_decrypted_creds returns INTERNAL_ERROR on catch
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:284:36
             data: selected,
           });
         } catch {
-          port.postMessage({ type: 'ERROR', error: 'INTERNAL_ERROR' });
+          port.postMessage({ type: "", error: 'INTERNAL_ERROR' });
         }
       }
killedBy: ExtensionBridge 18. get_decrypted_creds returns INTERNAL_ERROR on catch
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] BlockStatement
src/lib/ExtensionBridge.ts:289:41
       }
     });
 
-    port.onDisconnect.addListener(() => {
-      const active = this.activeSessions.get(port);
-      if (active) {
-        active.challengeNonceMap.clear();
-      }
-      this.activeSessions.delete(port);
-    });
+    port.onDisconnect.addListener(() => {});
   }
 

[Survived] ConditionalExpression
src/lib/ExtensionBridge.ts:291:11
 
     port.onDisconnect.addListener(() => {
       const active = this.activeSessions.get(port);
-      if (active) {
+      if (false) {
         active.challengeNonceMap.clear();
       }

[Survived] BlockStatement
src/lib/ExtensionBridge.ts:291:19
 
     port.onDisconnect.addListener(() => {
       const active = this.activeSessions.get(port);
-      if (active) {
-        active.challengeNonceMap.clear();
-      }
+      if (active) {}
       this.activeSessions.delete(port);
     });

[Killed] LogicalOperator
src/lib/ExtensionBridge.ts:300:7
 
   private messageListener = async (event: MessageEvent) => {
     if (
-      event.origin !== window.location.origin &&
-      !event.origin.startsWith('chrome-extension://')
+      event.origin !== window.location.origin || !event.origin.startsWith('chrome-extension://')
     ) {
       return;
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:300:7
 
   private messageListener = async (event: MessageEvent) => {
     if (
-      event.origin !== window.location.origin &&
-      !event.origin.startsWith('chrome-extension://')
+      false
     ) {
       return;
killedBy: ExtensionBridge: Branch Coverage ignores message with wrong origin
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "gddgomiecgnihlljfkogfjgakedoielk",

[Killed] MethodExpression
src/lib/ExtensionBridge.ts:301:8
   private messageListener = async (event: MessageEvent) => {
     if (
       event.origin !== window.location.origin &&
-      !event.origin.startsWith('chrome-extension://')
+      !event.origin.endsWith('chrome-extension://')
     ) {
       return;
killedBy: ExtensionBridge 19. messageListener accepts valid chrome-extension origins
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:301:7
   private messageListener = async (event: MessageEvent) => {
     if (
       event.origin !== window.location.origin &&
-      !event.origin.startsWith('chrome-extension://')
+      event.origin.startsWith('chrome-extension://')
     ) {
       return;
killedBy: ExtensionBridge 19. messageListener accepts valid chrome-extension origins
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:302:7
     if (
       event.origin !== window.location.origin &&
       !event.origin.startsWith('chrome-extension://')
-    ) {
-      return;
-    }
+    ) {}
 
     const data = event.data;
killedBy: ExtensionBridge: Branch Coverage ignores message with wrong origin
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "gddgomiecgnihlljfkogfjgakedoielk",

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:307:9
     }
 
     const data = event.data;
-    if (typeof data !== 'object' || !data) return;
+    if (typeof data === 'object' || !data) return;
 
     if (data.type !== 'AEGIS_EXTENSION_HELLO') return;
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:307:37
     }
 
     const data = event.data;
-    if (typeof data !== 'object' || !data) return;
+    if (typeof data !== 'object' || data) return;
 
     if (data.type !== 'AEGIS_EXTENSION_HELLO') return;
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:309:9
     const data = event.data;
     if (typeof data !== 'object' || !data) return;
 
-    if (data.type !== 'AEGIS_EXTENSION_HELLO') return;
+    if (false) return;
 
     const incomingExtensionId = data.extensionId;
killedBy: ExtensionBridge: Branch Coverage ignores message without AEGIS_EXTENSION_HELLO type
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "gddgomiecgnihlljfkogfjgakedoielk",

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:309:9
     const data = event.data;
     if (typeof data !== 'object' || !data) return;
 
-    if (data.type !== 'AEGIS_EXTENSION_HELLO') return;
+    if (true) return;
 
     const incomingExtensionId = data.extensionId;
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:312:9
     if (data.type !== 'AEGIS_EXTENSION_HELLO') return;
 
     const incomingExtensionId = data.extensionId;
-    if (!incomingExtensionId || typeof incomingExtensionId !== 'string') {
+    if (true) {
       return;
     }
killedBy: PairingAbuse (Security Stress Tests) 1. Replay Attack Prevention: Aynı nonce iki kez kullanılamaz
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:312:9
     if (data.type !== 'AEGIS_EXTENSION_HELLO') return;
 
     const incomingExtensionId = data.extensionId;
-    if (!incomingExtensionId || typeof incomingExtensionId !== 'string') {
+    if (incomingExtensionId || typeof incomingExtensionId !== 'string') {
       return;
     }
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:316:9
       return;
     }
 
-    if (!this.isExtensionAllowed(incomingExtensionId)) {
+    if (false) {
       return;
     }
killedBy: ExtensionBridge 2. Yetkisiz extension id reddedilir
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "malicious_id",

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:316:9
       return;
     }
 
-    if (!this.isExtensionAllowed(incomingExtensionId)) {
+    if (true) {
       return;
     }
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:321:9
     }
 
     const runtime = this.getRuntime();
-    if (!runtime) return;
+    if (runtime) return;
 
     try {
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:321:9
     }
 
     const runtime = this.getRuntime();
-    if (!runtime) return;
+    if (true) return;
 
     try {
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:323:9
     const runtime = this.getRuntime();
     if (!runtime) return;
 
-    try {
-      const port = runtime.connect(incomingExtensionId, { name: 'aegis-pwa-vault-port' });
-      this.attachPort(incomingExtensionId, port);
-    } catch (error) {
+    try {} catch (error) {
       console.error(
         '[PWA Bridge] Eklenti ile runtime (externally_connectable) baglantisi kurulamad�.',
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:326:21
     try {
       const port = runtime.connect(incomingExtensionId, { name: 'aegis-pwa-vault-port' });
       this.attachPort(incomingExtensionId, port);
-    } catch (error) {
-      console.error(
-        '[PWA Bridge] Eklenti ile runtime (externally_connectable) baglantisi kurulamad�.',
-        error
-      );
-    }
+    } catch (error) {}
   };
 
killedBy: ExtensionBridge 26. messageListener logs error if port connection throws
statusReason: expected "error" to be called with arguments: [ StringContaining{…}, Any<Error> ]

Number of calls: 0

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:334:17
     }
   };
 
-  public init() {
-    if (this.isListening) return;
-    this.isListening = true;
-    window.addEventListener('message', this.messageListener);
-  }
+  public init() {}
 
   public getAllowedExtensionIds(): string[] {
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:335:9
   };
 
   public init() {
-    if (this.isListening) return;
+    if (true) return;
     this.isListening = true;
     window.addEventListener('message', this.messageListener);
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:335:9
   };
 
   public init() {
-    if (this.isListening) return;
+    if (false) return;
     this.isListening = true;
     window.addEventListener('message', this.messageListener);
killedBy: ExtensionBridge 24. init avoids re-registering if already listening
statusReason: expected "Mock" to not be called at all, but actually been called 1 times

Received: 

  1st Mock call:

    Array [
      "message",

[Survived] BooleanLiteral
src/lib/ExtensionBridge.ts:336:24
 
   public init() {
     if (this.isListening) return;
-    this.isListening = true;
+    this.isListening = false;
     window.addEventListener('message', this.messageListener);
   }

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:337:29
   public init() {
     if (this.isListening) return;
     this.isListening = true;
-    window.addEventListener('message', this.messageListener);
+    window.addEventListener("", this.messageListener);
   }
 
killedBy: ExtensionBridge: Branch Coverage get_decrypted_creds with vault locked returns VAULT_LOCKED
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:340:45
     window.addEventListener('message', this.messageListener);
   }
 
-  public getAllowedExtensionIds(): string[] {
-    return Array.from(this.allowedExtensionIds);
-  }
+  public getAllowedExtensionIds(): string[] {}
 
   public updateAllowedExtensionIds(ids: string[]): void {
killedBy: ExtensionBridge: Branch Coverage removeAllowedExtensionId resets to defaults when set becomes empty
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:344:57
     return Array.from(this.allowedExtensionIds);
   }
 
-  public updateAllowedExtensionIds(ids: string[]): void {
-    const normalized = ids.map((id) => id.trim()).filter(Boolean);
-
-    if (normalized.length === 0) {
-      this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
-    } else {
-      this.allowedExtensionIds = new Set(normalized);
-    }
-
-    this.persistAllowlist();
-    this.lockAndDisconnect();
-  }
+  public updateAllowedExtensionIds(ids: string[]): void {}
 
   public addAllowedExtensionId(id: string): void {
killedBy: ExtensionBridge 7. Runtime allowlist update permits new extension id
statusReason: expected "vi.fn()" to be called with arguments: [ 'runtime_ext_1', …(1) ]

Number of calls: 0

[Killed] ArrowFunction
src/lib/ExtensionBridge.ts:345:32
   }
 
   public updateAllowedExtensionIds(ids: string[]): void {
-    const normalized = ids.map((id) => id.trim()).filter(Boolean);
+    const normalized = ids.map(() => undefined).filter(Boolean);
 
     if (normalized.length === 0) {
killedBy: ExtensionBridge 7. Runtime allowlist update permits new extension id
statusReason: expected "vi.fn()" to be called with arguments: [ 'runtime_ext_1', …(1) ]

Number of calls: 0

[Killed] MethodExpression
src/lib/ExtensionBridge.ts:345:24
   }
 
   public updateAllowedExtensionIds(ids: string[]): void {
-    const normalized = ids.map((id) => id.trim()).filter(Boolean);
+    const normalized = ids.map(id => id.trim());
 
     if (normalized.length === 0) {
killedBy: ExtensionBridge 27. updateAllowedExtensionIds normalizes and handles mixed spacing
statusReason: expected [ '', 'spaced_id', 'normal_id' ] to not include ''

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:347:9
   public updateAllowedExtensionIds(ids: string[]): void {
     const normalized = ids.map((id) => id.trim()).filter(Boolean);
 
-    if (normalized.length === 0) {
+    if (true) {
       this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
     } else {
killedBy: ExtensionBridge 7. Runtime allowlist update permits new extension id
statusReason: expected "vi.fn()" to be called with arguments: [ 'runtime_ext_1', …(1) ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:347:9
   public updateAllowedExtensionIds(ids: string[]): void {
     const normalized = ids.map((id) => id.trim()).filter(Boolean);
 
-    if (normalized.length === 0) {
+    if (normalized.length !== 0) {
       this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
     } else {
killedBy: ExtensionBridge: Branch Coverage removeAllowedExtensionId resets to defaults when set becomes empty
statusReason: expected [ …(2) ] to include 'test-ext-id'

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:349:12
 
     if (normalized.length === 0) {
       this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
-    } else {
-      this.allowedExtensionIds = new Set(normalized);
-    }
+    } else {}
 
     this.persistAllowlist();
killedBy: ExtensionBridge: Branch Coverage removeAllowedExtensionId resets to defaults when set becomes empty
statusReason: expected [ …(2) ] to include 'test-ext-id'

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:357:50
     this.lockAndDisconnect();
   }
 
-  public addAllowedExtensionId(id: string): void {
-    const normalized = id.trim();
-    if (!normalized) return;
-    this.allowedExtensionIds.add(normalized);
-    this.persistAllowlist();
-  }
+  public addAllowedExtensionId(id: string): void {}
 
   public removeAllowedExtensionId(id: string): void {
killedBy: ExtensionBridge 20. addAllowedExtensionId handles inputs correctly
statusReason: expected [ …(2) ] to include 'new_ext_id'

[Killed] MethodExpression
src/lib/ExtensionBridge.ts:358:24
   }
 
   public addAllowedExtensionId(id: string): void {
-    const normalized = id.trim();
+    const normalized = id;
     if (!normalized) return;
     this.allowedExtensionIds.add(normalized);
killedBy: ExtensionBridge 20. addAllowedExtensionId handles inputs correctly
statusReason: expected [ …(3) ] to include 'new_ext_id'

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:359:9
 
   public addAllowedExtensionId(id: string): void {
     const normalized = id.trim();
-    if (!normalized) return;
+    if (normalized) return;
     this.allowedExtensionIds.add(normalized);
     this.persistAllowlist();
killedBy: ExtensionBridge 20. addAllowedExtensionId handles inputs correctly
statusReason: expected [ …(2) ] to include 'new_ext_id'

[Killed] ConditionalExpression
src/lib/ExtensionBridge.ts:359:9
 
   public addAllowedExtensionId(id: string): void {
     const normalized = id.trim();
-    if (!normalized) return;
+    if (false) return;
     this.allowedExtensionIds.add(normalized);
     this.persistAllowlist();
killedBy: ExtensionBridge: Branch Coverage addAllowedExtensionId ignores empty string
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:364:53
     this.persistAllowlist();
   }
 
-  public removeAllowedExtensionId(id: string): void {
-    this.allowedExtensionIds.delete(id.trim());
-    if (this.allowedExtensionIds.size === 0) {
-      this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
-    }
-    this.persistAllowlist();
-    this.lockAndDisconnect();
-  }
+  public removeAllowedExtensionId(id: string): void {}
 
   public lockAndDisconnect() {
killedBy: ExtensionBridge 21. removeAllowedExtensionId clears all ids correctly and falls back to defaults
statusReason: expected [ 'custom_ext_1' ] to include 'gddgomiecgnihlljfkogfjgakedoielk'

[Killed] MethodExpression
src/lib/ExtensionBridge.ts:365:37
   }
 
   public removeAllowedExtensionId(id: string): void {
-    this.allowedExtensionIds.delete(id.trim());
+    this.allowedExtensionIds.delete(id);
     if (this.allowedExtensionIds.size === 0) {
       this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
killedBy: ExtensionBridge 28. removeAllowedExtensionId sanitizes input before mutation
statusReason: expected [ 'ext' ] to not include 'ext'

[Killed] EqualityOperator
src/lib/ExtensionBridge.ts:366:9
 
   public removeAllowedExtensionId(id: string): void {
     this.allowedExtensionIds.delete(id.trim());
-    if (this.allowedExtensionIds.size === 0) {
+    if (this.allowedExtensionIds.size !== 0) {
       this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
     }
killedBy: ExtensionBridge 21. removeAllowedExtensionId clears all ids correctly and falls back to defaults
statusReason: expected [] to include 'gddgomiecgnihlljfkogfjgakedoielk'

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:366:46
 
   public removeAllowedExtensionId(id: string): void {
     this.allowedExtensionIds.delete(id.trim());
-    if (this.allowedExtensionIds.size === 0) {
-      this.allowedExtensionIds = new Set(DEFAULT_ALLOWED_EXTENSION_IDS);
-    }
+    if (this.allowedExtensionIds.size === 0) {}
     this.persistAllowlist();
     this.lockAndDisconnect();
killedBy: ExtensionBridge 21. removeAllowedExtensionId clears all ids correctly and falls back to defaults
statusReason: expected [] to include 'gddgomiecgnihlljfkogfjgakedoielk'

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:373:30
     this.lockAndDisconnect();
   }
 
-  public lockAndDisconnect() {
-    for (const [port, session] of this.activeSessions.entries()) {
-      try {
-        port.postMessage({ type: 'VAULT_LOCKED' });
-        port.disconnect();
-      } catch {
-        /* port may already be closed */
-      }
-      session.challengeNonceMap.clear();
-      this.activeSessions.delete(port);
-    }
-  }
+  public lockAndDisconnect() {}
 
   public dispose() {
killedBy: ExtensionBridge 5. lockAndDisconnect portu kapatir ve temizlik yapar
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'VAULT_LOCKED' } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:374:66
   }
 
   public lockAndDisconnect() {
-    for (const [port, session] of this.activeSessions.entries()) {
-      try {
-        port.postMessage({ type: 'VAULT_LOCKED' });
-        port.disconnect();
-      } catch {
-        /* port may already be closed */
-      }
-      session.challengeNonceMap.clear();
-      this.activeSessions.delete(port);
-    }
+    for (const [port, session] of this.activeSessions.entries()) {}
   }
 
killedBy: ExtensionBridge 5. lockAndDisconnect portu kapatir ve temizlik yapar
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'VAULT_LOCKED' } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:375:11
 
   public lockAndDisconnect() {
     for (const [port, session] of this.activeSessions.entries()) {
-      try {
-        port.postMessage({ type: 'VAULT_LOCKED' });
-        port.disconnect();
-      } catch {
+      try {} catch {
         /* port may already be closed */
       }
killedBy: ExtensionBridge 5. lockAndDisconnect portu kapatir ve temizlik yapar
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'VAULT_LOCKED' } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
src/lib/ExtensionBridge.ts:376:34
   public lockAndDisconnect() {
     for (const [port, session] of this.activeSessions.entries()) {
       try {
-        port.postMessage({ type: 'VAULT_LOCKED' });
+        port.postMessage({ type: "" });
         port.disconnect();
       } catch {
killedBy: ExtensionBridge 5. lockAndDisconnect portu kapatir ve temizlik yapar
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'VAULT_LOCKED' } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ObjectLiteral
src/lib/ExtensionBridge.ts:376:26
   public lockAndDisconnect() {
     for (const [port, session] of this.activeSessions.entries()) {
       try {
-        port.postMessage({ type: 'VAULT_LOCKED' });
+        port.postMessage({});
         port.disconnect();
       } catch {
killedBy: ExtensionBridge 5. lockAndDisconnect portu kapatir ve temizlik yapar
statusReason: expected "vi.fn()" to be called with arguments: [ { type: 'VAULT_LOCKED' } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:386:20
     }
   }
 
-  public dispose() {
-    this.isListening = false;
-    window.removeEventListener('message', this.messageListener);
-    this.lockAndDisconnect();
-  }
+  public dispose() {}
 
   private generateToken() {
killedBy: ExtensionBridge 23. dispose gracefully cleans up listeners and locks vault
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:387:24
   }
 
   public dispose() {
-    this.isListening = false;
+    this.isListening = true;
     window.removeEventListener('message', this.messageListener);
     this.lockAndDisconnect();
killedBy: ExtensionBridge 23. dispose gracefully cleans up listeners and locks vault
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/lib/ExtensionBridge.ts:388:32
 
   public dispose() {
     this.isListening = false;
-    window.removeEventListener('message', this.messageListener);
+    window.removeEventListener("", this.messageListener);
     this.lockAndDisconnect();
   }

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:392:27
     this.lockAndDisconnect();
   }
 
-  private generateToken() {
-    const array = new Uint8Array(16);
-    window.crypto.getRandomValues(array);
-    return Array.from(array, (byte) => byte.toString(16).padStart(2, '0')).join('');
-  }
+  private generateToken() {}
 
   /** @internal ONLY FOR TESTING */
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
src/lib/ExtensionBridge.ts:395:30
   private generateToken() {
     const array = new Uint8Array(16);
     window.crypto.getRandomValues(array);
-    return Array.from(array, (byte) => byte.toString(16).padStart(2, '0')).join('');
+    return Array.from(array, () => undefined).join('');
   }
 
killedBy: ExtensionBridge 6. get_decrypted_creds: imzali istegi dogrular ve verileri doner
statusReason: Zero-length key is not supported

[Survived] StringLiteral
src/lib/ExtensionBridge.ts:395:81
   private generateToken() {
     const array = new Uint8Array(16);
     window.crypto.getRandomValues(array);
-    return Array.from(array, (byte) => byte.toString(16).padStart(2, '0')).join('');
+    return Array.from(array, (byte) => byte.toString(16).padStart(2, '0')).join("Stryker was here!");
   }
 

[Killed] BlockStatement
src/lib/ExtensionBridge.ts:399:18
   }
 
   /** @internal ONLY FOR TESTING */
-  public reset() {
-    this.isListening = false;
-    this.activeSessions.clear();
-    this.allowedExtensionIds = new Set(buildInitialAllowlist());
-    this.loadAllowlistFromStorage();
-    window.removeEventListener('message', this.messageListener);
-  }
+  public reset() {}
 }
 
killedBy: ExtensionBridge 8. Supports multiple active ports and disconnects all on lock
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BooleanLiteral
src/lib/ExtensionBridge.ts:400:24
 
   /** @internal ONLY FOR TESTING */
   public reset() {
-    this.isListening = false;
+    this.isListening = true;
     this.activeSessions.clear();
     this.allowedExtensionIds = new Set(buildInitialAllowlist());
killedBy: ExtensionBridge 1. Hello mesaji ile baglanti kurar ve token paylasir (allowlist)
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0
