[Killed] StringLiteral
src/lib/PasskeyBindingService.ts:61:25
 const LEGACY_ID_KEY = 'aegis_passkey_id';
 const LEGACY_DATA_KEY = 'aegis_passkey_data';
 const LEGACY_SALT_KEY = 'aegis_prf_salt';
-const LEGACY_META_KEY = 'aegis_passkey_meta';
+const LEGACY_META_KEY = "";
 const PASSKEY_AUDIT_KEY = 'aegis_passkey_audit_v1';
 const PASSKEY_REVOCATIONS_KEY = 'aegis_passkey_revocations_v1';
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected '2026-04-11T15:06:49.220Z' to be '2025-01-01T00:00:00.000Z' // Object.is equality

[Survived] BooleanLiteral
src/lib/PasskeyBindingService.ts:71:40
 const SECURE_DB_KEY = 'passkey_state_v2';
 const DEFAULT_POLICY: PasskeyPolicy = {
   maxBindingAgeDays: 90,
-  requireRecoveryExportBeforeRotation: false,
+  requireRecoveryExportBeforeRotation: true,
   blockRevokedCredentials: true,
 };

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:72:28
 const DEFAULT_POLICY: PasskeyPolicy = {
   maxBindingAgeDays: 90,
   requireRecoveryExportBeforeRotation: false,
-  blockRevokedCredentials: true,
+  blockRevokedCredentials: false,
 };
 
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage isCredentialRevoked returns true for revoked credential
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:82:68
   policy: PasskeyPolicy;
 }
 
-const profileKey = (profileId?: string | null, dbName?: string) => {
-  return `${profileId || 'default'}::${dbName || 'aegis_opfs_vault'}`;
-};
+const profileKey = (profileId?: string | null, dbName?: string) => {};
 
 const safeParse = <T>(raw: string | null): T | null => {
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:83:40
 }
 
 const profileKey = (profileId?: string | null, dbName?: string) => {
-  return `${profileId || 'default'}::${dbName || 'aegis_opfs_vault'}`;
+  return `${profileId || 'default'}::${false}`;
 };
 
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:83:13
 }
 
 const profileKey = (profileId?: string | null, dbName?: string) => {
-  return `${profileId || 'default'}::${dbName || 'aegis_opfs_vault'}`;
+  return `${false}::${dbName || 'aegis_opfs_vault'}`;
 };
 
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected undefined to be '' // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:86:56
   return `${profileId || 'default'}::${dbName || 'aegis_opfs_vault'}`;
 };
 
-const safeParse = <T>(raw: string | null): T | null => {
-  if (!raw) return null;
-  try {
-    return JSON.parse(raw) as T;
-  } catch {
-    return null;
-  }
-};
+const safeParse = <T>(raw: string | null): T | null => {};
 
 const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected '2026-04-11T14:56:37.355Z' to be '2025-01-01T00:00:00.000Z' // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:87:7
 };
 
 const safeParse = <T>(raw: string | null): T | null => {
-  if (!raw) return null;
+  if (raw) return null;
   try {
     return JSON.parse(raw) as T;
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected '2026-04-11T14:56:37.570Z' to be '2025-01-01T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:87:7
 };
 
 const safeParse = <T>(raw: string | null): T | null => {
-  if (!raw) return null;
+  if (true) return null;
   try {
     return JSON.parse(raw) as T;
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected '2026-04-11T14:56:39.954Z' to be '2025-01-01T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:88:7
 
 const safeParse = <T>(raw: string | null): T | null => {
   if (!raw) return null;
-  try {
-    return JSON.parse(raw) as T;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be true // Object.is equality

[Survived] ArrowFunction
src/lib/PasskeyBindingService.ts:95:20
   }
 };
 
-const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
-  bindings: JSON.parse(JSON.stringify(state.bindings || {})),
-  auditLog: [...(state.auditLog || [])],
-  revocations: [...(state.revocations || [])],
-  policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },
-});
+const cloneState = () => undefined;
 
 const createDefaultState = (): PasskeySecureState => ({

[Survived] LogicalOperator
src/lib/PasskeyBindingService.ts:96:39
 };
 
 const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
-  bindings: JSON.parse(JSON.stringify(state.bindings || {})),
+  bindings: JSON.parse(JSON.stringify(state.bindings && {})),
   auditLog: [...(state.auditLog || [])],
   revocations: [...(state.revocations || [])],

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:96:39
 };
 
 const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
-  bindings: JSON.parse(JSON.stringify(state.bindings || {})),
+  bindings: JSON.parse(JSON.stringify(true)),
   auditLog: [...(state.auditLog || [])],
   revocations: [...(state.revocations || [])],

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:97:18
 
 const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
   bindings: JSON.parse(JSON.stringify(state.bindings || {})),
-  auditLog: [...(state.auditLog || [])],
+  auditLog: [...(false)],
   revocations: [...(state.revocations || [])],
   policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:97:18
 
 const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
   bindings: JSON.parse(JSON.stringify(state.bindings || {})),
-  auditLog: [...(state.auditLog || [])],
+  auditLog: [...(true)],
   revocations: [...(state.revocations || [])],
   policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:98:21
 const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
   bindings: JSON.parse(JSON.stringify(state.bindings || {})),
   auditLog: [...(state.auditLog || [])],
-  revocations: [...(state.revocations || [])],
+  revocations: [...(false)],
   policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },
 });

[Survived] LogicalOperator
src/lib/PasskeyBindingService.ts:98:21
 const cloneState = (state: PasskeySecureState): PasskeySecureState => ({
   bindings: JSON.parse(JSON.stringify(state.bindings || {})),
   auditLog: [...(state.auditLog || [])],
-  revocations: [...(state.revocations || [])],
+  revocations: [...(state.revocations && [])],
   policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },
 });

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:99:36
   bindings: JSON.parse(JSON.stringify(state.bindings || {})),
   auditLog: [...(state.auditLog || [])],
   revocations: [...(state.revocations || [])],
-  policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },
+  policy: { ...DEFAULT_POLICY, ...(false) },
 });
 

[Survived] LogicalOperator
src/lib/PasskeyBindingService.ts:99:36
   bindings: JSON.parse(JSON.stringify(state.bindings || {})),
   auditLog: [...(state.auditLog || [])],
   revocations: [...(state.revocations || [])],
-  policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },
+  policy: { ...DEFAULT_POLICY, ...(state.policy && {}) },
 });
 

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:102:28
   policy: { ...DEFAULT_POLICY, ...(state.policy || {}) },
 });
 
-const createDefaultState = (): PasskeySecureState => ({
-  bindings: {},
-  auditLog: [],
-  revocations: [],
-  policy: { ...DEFAULT_POLICY },
-});
+const createDefaultState = () => undefined;
 
 let secureStateCache: PasskeySecureState = createDefaultState();
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: Cannot read properties of undefined (reading 'bindings')

[Survived] ArrayDeclaration
src/lib/PasskeyBindingService.ts:105:16
 const createDefaultState = (): PasskeySecureState => ({
   bindings: {},
   auditLog: [],
-  revocations: [],
+  revocations: ["Stryker was here"],
   policy: { ...DEFAULT_POLICY },
 });

[Survived] ObjectLiteral
src/lib/PasskeyBindingService.ts:106:11
   bindings: {},
   auditLog: [],
   revocations: [],
-  policy: { ...DEFAULT_POLICY },
+  policy: {},
 });
 

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:110:30
 });
 
 let secureStateCache: PasskeySecureState = createDefaultState();
-let secureStateInitialized = false;
+let secureStateInitialized = true;
 let secureStateInitPromise: Promise<void> | null = null;
 let secureStatePersistPromise: Promise<void> = Promise.resolve();
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:114:22
 let secureStateInitPromise: Promise<void> | null = null;
 let secureStatePersistPromise: Promise<void> = Promise.resolve();
 
-const hasIndexedDb = () => typeof indexedDB !== 'undefined';
+const hasIndexedDb = () => undefined;
 
 const openSecureDb = async (): Promise<IDBDatabase | null> => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:114:28
 let secureStateInitPromise: Promise<void> | null = null;
 let secureStatePersistPromise: Promise<void> = Promise.resolve();
 
-const hasIndexedDb = () => typeof indexedDB !== 'undefined';
+const hasIndexedDb = () => false;
 
 const openSecureDb = async (): Promise<IDBDatabase | null> => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:116:63
 
 const hasIndexedDb = () => typeof indexedDB !== 'undefined';
 
-const openSecureDb = async (): Promise<IDBDatabase | null> => {
-  if (!hasIndexedDb()) return null;
-  return await new Promise((resolve, reject) => {
-    const request = indexedDB.open(SECURE_DB_NAME, 1);
-    request.onupgradeneeded = () => {
-      const db = request.result;
-      if (!db.objectStoreNames.contains(SECURE_DB_STORE)) {
-        db.createObjectStore(SECURE_DB_STORE);
-      }
-    };
-    request.onsuccess = () => resolve(request.result);
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_OPEN_FAILED'));
-  });
-};
+const openSecureDb = async (): Promise<IDBDatabase | null> => {};
 
 const readStateFromIndexedDb = async (): Promise<PasskeySecureState | null> => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:117:7
 const hasIndexedDb = () => typeof indexedDB !== 'undefined';
 
 const openSecureDb = async (): Promise<IDBDatabase | null> => {
-  if (!hasIndexedDb()) return null;
+  if (true) return null;
   return await new Promise((resolve, reject) => {
     const request = indexedDB.open(SECURE_DB_NAME, 1);
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:117:7
 const hasIndexedDb = () => typeof indexedDB !== 'undefined';
 
 const openSecureDb = async (): Promise<IDBDatabase | null> => {
-  if (!hasIndexedDb()) return null;
+  if (hasIndexedDb()) return null;
   return await new Promise((resolve, reject) => {
     const request = indexedDB.open(SECURE_DB_NAME, 1);
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:118:49
 
 const openSecureDb = async (): Promise<IDBDatabase | null> => {
   if (!hasIndexedDb()) return null;
-  return await new Promise((resolve, reject) => {
-    const request = indexedDB.open(SECURE_DB_NAME, 1);
-    request.onupgradeneeded = () => {
-      const db = request.result;
-      if (!db.objectStoreNames.contains(SECURE_DB_STORE)) {
-        db.createObjectStore(SECURE_DB_STORE);
-      }
-    };
-    request.onsuccess = () => resolve(request.result);
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_OPEN_FAILED'));
-  });
+  return await new Promise((resolve, reject) => {});
 };
 
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:120:37
   if (!hasIndexedDb()) return null;
   return await new Promise((resolve, reject) => {
     const request = indexedDB.open(SECURE_DB_NAME, 1);
-    request.onupgradeneeded = () => {
-      const db = request.result;
-      if (!db.objectStoreNames.contains(SECURE_DB_STORE)) {
-        db.createObjectStore(SECURE_DB_STORE);
-      }
-    };
+    request.onupgradeneeded = () => {};
     request.onsuccess = () => resolve(request.result);
     request.onerror = () => reject(request.error || new Error('SECURE_DB_OPEN_FAILED'));

[Survived] BooleanLiteral
src/lib/PasskeyBindingService.ts:122:11
     const request = indexedDB.open(SECURE_DB_NAME, 1);
     request.onupgradeneeded = () => {
       const db = request.result;
-      if (!db.objectStoreNames.contains(SECURE_DB_STORE)) {
+      if (db.objectStoreNames.contains(SECURE_DB_STORE)) {
         db.createObjectStore(SECURE_DB_STORE);
       }

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:122:59
     const request = indexedDB.open(SECURE_DB_NAME, 1);
     request.onupgradeneeded = () => {
       const db = request.result;
-      if (!db.objectStoreNames.contains(SECURE_DB_STORE)) {
-        db.createObjectStore(SECURE_DB_STORE);
-      }
+      if (!db.objectStoreNames.contains(SECURE_DB_STORE)) {}
     };
     request.onsuccess = () => resolve(request.result);

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:126:25
         db.createObjectStore(SECURE_DB_STORE);
       }
     };
-    request.onsuccess = () => resolve(request.result);
+    request.onsuccess = () => undefined;
     request.onerror = () => reject(request.error || new Error('SECURE_DB_OPEN_FAILED'));
   });
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:127:23
       }
     };
     request.onsuccess = () => resolve(request.result);
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_OPEN_FAILED'));
+    request.onerror = () => undefined;
   });
 };
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles openSecureDb error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:127:36
       }
     };
     request.onsuccess = () => resolve(request.result);
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_OPEN_FAILED'));
+    request.onerror = () => reject(true);
   });
 };

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:131:80
   });
 };
 
-const readStateFromIndexedDb = async (): Promise<PasskeySecureState | null> => {
-  const db = await openSecureDb();
-  if (!db) return null;
-  return await new Promise((resolve, reject) => {
-    const tx = db.transaction(SECURE_DB_STORE, 'readonly');
-    const store = tx.objectStore(SECURE_DB_STORE);
-    const request = store.get(SECURE_DB_KEY);
-    request.onsuccess = () => {
-      resolve(request.result ? normalizePersistedState(request.result) : null);
-    };
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
-    tx.oncomplete = () => db.close();
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_READ_FAILED'));
-  });
-};
+const readStateFromIndexedDb = async (): Promise<PasskeySecureState | null> => {};
 
 const writeStateToIndexedDb = async (state: PasskeySecureState): Promise<void> => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:133:7
 
 const readStateFromIndexedDb = async (): Promise<PasskeySecureState | null> => {
   const db = await openSecureDb();
-  if (!db) return null;
+  if (true) return null;
   return await new Promise((resolve, reject) => {
     const tx = db.transaction(SECURE_DB_STORE, 'readonly');
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:133:7
 
 const readStateFromIndexedDb = async (): Promise<PasskeySecureState | null> => {
   const db = await openSecureDb();
-  if (!db) return null;
+  if (db) return null;
   return await new Promise((resolve, reject) => {
     const tx = db.transaction(SECURE_DB_STORE, 'readonly');
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:134:49
 const readStateFromIndexedDb = async (): Promise<PasskeySecureState | null> => {
   const db = await openSecureDb();
   if (!db) return null;
-  return await new Promise((resolve, reject) => {
-    const tx = db.transaction(SECURE_DB_STORE, 'readonly');
-    const store = tx.objectStore(SECURE_DB_STORE);
-    const request = store.get(SECURE_DB_KEY);
-    request.onsuccess = () => {
-      resolve(request.result ? normalizePersistedState(request.result) : null);
-    };
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
-    tx.oncomplete = () => db.close();
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_READ_FAILED'));
-  });
+  return await new Promise((resolve, reject) => {});
 };
 
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:138:31
     const tx = db.transaction(SECURE_DB_STORE, 'readonly');
     const store = tx.objectStore(SECURE_DB_STORE);
     const request = store.get(SECURE_DB_KEY);
-    request.onsuccess = () => {
-      resolve(request.result ? normalizePersistedState(request.result) : null);
-    };
+    request.onsuccess = () => {};
     request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
     tx.oncomplete = () => db.close();
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:141:23
     request.onsuccess = () => {
       resolve(request.result ? normalizePersistedState(request.result) : null);
     };
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
+    request.onerror = () => undefined;
     tx.oncomplete = () => db.close();
     tx.onerror = () => reject(tx.error || new Error('SECURE_DB_READ_FAILED'));
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] LogicalOperator
src/lib/PasskeyBindingService.ts:141:36
     request.onsuccess = () => {
       resolve(request.result ? normalizePersistedState(request.result) : null);
     };
-    request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
+    request.onerror = () => reject(request.error && new Error('SECURE_DB_READ_FAILED'));
     tx.oncomplete = () => db.close();
     tx.onerror = () => reject(tx.error || new Error('SECURE_DB_READ_FAILED'));

[Survived] ArrowFunction
src/lib/PasskeyBindingService.ts:142:21
       resolve(request.result ? normalizePersistedState(request.result) : null);
     };
     request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
-    tx.oncomplete = () => db.close();
+    tx.oncomplete = () => undefined;
     tx.onerror = () => reject(tx.error || new Error('SECURE_DB_READ_FAILED'));
   });

[Survived] ArrowFunction
src/lib/PasskeyBindingService.ts:143:18
     };
     request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
     tx.oncomplete = () => db.close();
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_READ_FAILED'));
+    tx.onerror = () => undefined;
   });
 };

[NoCoverage] ConditionalExpression
src/lib/PasskeyBindingService.ts:143:31
     };
     request.onerror = () => reject(request.error || new Error('SECURE_DB_READ_FAILED'));
     tx.oncomplete = () => db.close();
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_READ_FAILED'));
+    tx.onerror = () => reject(true);
   });
 };

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:147:83
   });
 };
 
-const writeStateToIndexedDb = async (state: PasskeySecureState): Promise<void> => {
-  const db = await openSecureDb();
-  if (!db) return;
-  await new Promise<void>((resolve, reject) => {
-    const tx = db.transaction(SECURE_DB_STORE, 'readwrite');
-    const store = tx.objectStore(SECURE_DB_STORE);
-    store.put(cloneState(state), SECURE_DB_KEY);
-    tx.oncomplete = () => {
-      db.close();
-      resolve();
-    };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_WRITE_FAILED'));
-  });
-};
+const writeStateToIndexedDb = async (state: PasskeySecureState): Promise<void> => {};
 
 const clearStateInIndexedDb = async (): Promise<void> => {

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:149:7
 
 const writeStateToIndexedDb = async (state: PasskeySecureState): Promise<void> => {
   const db = await openSecureDb();
-  if (!db) return;
+  if (true) return;
   await new Promise<void>((resolve, reject) => {
     const tx = db.transaction(SECURE_DB_STORE, 'readwrite');

[Survived] BooleanLiteral
src/lib/PasskeyBindingService.ts:149:7
 
 const writeStateToIndexedDb = async (state: PasskeySecureState): Promise<void> => {
   const db = await openSecureDb();
-  if (!db) return;
+  if (db) return;
   await new Promise<void>((resolve, reject) => {
     const tx = db.transaction(SECURE_DB_STORE, 'readwrite');

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:150:48
 const writeStateToIndexedDb = async (state: PasskeySecureState): Promise<void> => {
   const db = await openSecureDb();
   if (!db) return;
-  await new Promise<void>((resolve, reject) => {
-    const tx = db.transaction(SECURE_DB_STORE, 'readwrite');
-    const store = tx.objectStore(SECURE_DB_STORE);
-    store.put(cloneState(state), SECURE_DB_KEY);
-    tx.oncomplete = () => {
-      db.close();
-      resolve();
-    };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_WRITE_FAILED'));
-  });
+  await new Promise<void>((resolve, reject) => {});
 };
 

[NoCoverage] BlockStatement
src/lib/PasskeyBindingService.ts:154:27
     const tx = db.transaction(SECURE_DB_STORE, 'readwrite');
     const store = tx.objectStore(SECURE_DB_STORE);
     store.put(cloneState(state), SECURE_DB_KEY);
-    tx.oncomplete = () => {
-      db.close();
-      resolve();
-    };
+    tx.oncomplete = () => {};
     tx.onerror = () => reject(tx.error || new Error('SECURE_DB_WRITE_FAILED'));
   });

[NoCoverage] ConditionalExpression
src/lib/PasskeyBindingService.ts:158:31
       db.close();
       resolve();
     };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_WRITE_FAILED'));
+    tx.onerror = () => reject(false);
   });
 };

[NoCoverage] LogicalOperator
src/lib/PasskeyBindingService.ts:158:31
       db.close();
       resolve();
     };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_WRITE_FAILED'));
+    tx.onerror = () => reject(tx.error && new Error('SECURE_DB_WRITE_FAILED'));
   });
 };

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:162:58
   });
 };
 
-const clearStateInIndexedDb = async (): Promise<void> => {
-  const db = await openSecureDb();
-  if (!db) return;
-  await new Promise<void>((resolve, reject) => {
-    const tx = db.transaction(SECURE_DB_STORE, 'readwrite');
-    tx.objectStore(SECURE_DB_STORE).delete(SECURE_DB_KEY);
-    tx.oncomplete = () => {
-      db.close();
-      resolve();
-    };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_CLEAR_FAILED'));
-  });
-};
+const clearStateInIndexedDb = async (): Promise<void> => {};
 
 const normalizePersistedState = (state: unknown): PasskeySecureState => {

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:165:48
 const clearStateInIndexedDb = async (): Promise<void> => {
   const db = await openSecureDb();
   if (!db) return;
-  await new Promise<void>((resolve, reject) => {
-    const tx = db.transaction(SECURE_DB_STORE, 'readwrite');
-    tx.objectStore(SECURE_DB_STORE).delete(SECURE_DB_KEY);
-    tx.oncomplete = () => {
-      db.close();
-      resolve();
-    };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_CLEAR_FAILED'));
-  });
+  await new Promise<void>((resolve, reject) => {});
 };
 

[NoCoverage] BlockStatement
src/lib/PasskeyBindingService.ts:168:27
   await new Promise<void>((resolve, reject) => {
     const tx = db.transaction(SECURE_DB_STORE, 'readwrite');
     tx.objectStore(SECURE_DB_STORE).delete(SECURE_DB_KEY);
-    tx.oncomplete = () => {
-      db.close();
-      resolve();
-    };
+    tx.oncomplete = () => {};
     tx.onerror = () => reject(tx.error || new Error('SECURE_DB_CLEAR_FAILED'));
   });

[Survived] ArrowFunction
src/lib/PasskeyBindingService.ts:172:18
       db.close();
       resolve();
     };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_CLEAR_FAILED'));
+    tx.onerror = () => undefined;
   });
 };

[NoCoverage] LogicalOperator
src/lib/PasskeyBindingService.ts:172:31
       db.close();
       resolve();
     };
-    tx.onerror = () => reject(tx.error || new Error('SECURE_DB_CLEAR_FAILED'));
+    tx.onerror = () => reject(tx.error && new Error('SECURE_DB_CLEAR_FAILED'));
   });
 };

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:178:14
 
 const normalizePersistedState = (state: unknown): PasskeySecureState => {
   const candidate =
-    state && typeof state === 'object' ? (state as Partial<PasskeySecureState>) : {};
+    state && typeof state !== 'object' ? (state as Partial<PasskeySecureState>) : {};
   return {
     bindings:
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:178:5
 
 const normalizePersistedState = (state: unknown): PasskeySecureState => {
   const candidate =
-    state && typeof state === 'object' ? (state as Partial<PasskeySecureState>) : {};
+    false ? (state as Partial<PasskeySecureState>) : {};
   return {
     bindings:
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:181:29
     state && typeof state === 'object' ? (state as Partial<PasskeySecureState>) : {};
   return {
     bindings:
-      candidate.bindings && typeof candidate.bindings === 'object'
+      candidate.bindings && typeof candidate.bindings !== 'object'
         ? Object.fromEntries(
             Object.entries(candidate.bindings).map(([k, v]) => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality
