[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:181:7
     state && typeof state === 'object' ? (state as Partial<PasskeySecureState>) : {};
   return {
     bindings:
-      candidate.bindings && typeof candidate.bindings === 'object'
+      false
         ? Object.fromEntries(
             Object.entries(candidate.bindings).map(([k, v]) => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/PasskeyBindingService.ts:183:13
     bindings:
       candidate.bindings && typeof candidate.bindings === 'object'
         ? Object.fromEntries(
-            Object.entries(candidate.bindings).map(([k, v]) => {
-              const val = (v || {}) as any;
-              return [
-                k,
-                {
-                  credentialId: val.credentialId || '',
-                  encryptedPayload: val.encryptedPayload || '',
-                  prfSalt: val.prfSalt || '',
-                  eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
-                  meta: {
-                    ...val.meta,
-                    version: val.meta?.version || 1,
-                  },
-                },
-              ];
-            }).filter(([_, record]) => record.credentialId !== '' || record.meta.version === 1) // Allow empty for test of default defaults, normally invalid
+            Object.entries(candidate.bindings).map(([k, v]) => {
+  const val = (v || {}) as any;
+  return [k, {
+    credentialId: val.credentialId || '',
+    encryptedPayload: val.encryptedPayload || '',
+    prfSalt: val.prfSalt || '',
+    eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
+    meta: {
+      ...val.meta,
+      version: val.meta?.version || 1
+    }
+  }];
+}) // Allow empty for test of default defaults, normally invalid
           )
         : {},

[Killed] ArrayDeclaration
src/lib/PasskeyBindingService.ts:185:22
         ? Object.fromEntries(
             Object.entries(candidate.bindings).map(([k, v]) => {
               const val = (v || {}) as any;
-              return [
-                k,
-                {
-                  credentialId: val.credentialId || '',
-                  encryptedPayload: val.encryptedPayload || '',
-                  prfSalt: val.prfSalt || '',
-                  eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
-                  meta: {
-                    ...val.meta,
-                    version: val.meta?.version || 1,
-                  },
-                },
-              ];
+              return [];
             }).filter(([_, record]) => record.credentialId !== '' || record.meta.version === 1) // Allow empty for test of default defaults, normally invalid
           )
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:187:17
               const val = (v || {}) as any;
               return [
                 k,
-                {
-                  credentialId: val.credentialId || '',
-                  encryptedPayload: val.encryptedPayload || '',
-                  prfSalt: val.prfSalt || '',
-                  eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
-                  meta: {
-                    ...val.meta,
-                    version: val.meta?.version || 1,
-                  },
-                },
+                {},
               ];
             }).filter(([_, record]) => record.credentialId !== '' || record.meta.version === 1) // Allow empty for test of default defaults, normally invalid
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:188:33
               return [
                 k,
                 {
-                  credentialId: val.credentialId || '',
+                  credentialId: val.credentialId && '',
                   encryptedPayload: val.encryptedPayload || '',
                   prfSalt: val.prfSalt || '',
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:188:33
               return [
                 k,
                 {
-                  credentialId: val.credentialId || '',
+                  credentialId: false,
                   encryptedPayload: val.encryptedPayload || '',
                   prfSalt: val.prfSalt || '',
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:189:37
                 k,
                 {
                   credentialId: val.credentialId || '',
-                  encryptedPayload: val.encryptedPayload || '',
+                  encryptedPayload: true,
                   prfSalt: val.prfSalt || '',
                   eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected true to be '' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:189:37
                 k,
                 {
                   credentialId: val.credentialId || '',
-                  encryptedPayload: val.encryptedPayload || '',
+                  encryptedPayload: false,
                   prfSalt: val.prfSalt || '',
                   eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be '' // Object.is equality

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:190:28
                 {
                   credentialId: val.credentialId || '',
                   encryptedPayload: val.encryptedPayload || '',
-                  prfSalt: val.prfSalt || '',
+                  prfSalt: val.prfSalt && '',
                   eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
                   meta: {
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:190:28
                 {
                   credentialId: val.credentialId || '',
                   encryptedPayload: val.encryptedPayload || '',
-                  prfSalt: val.prfSalt || '',
+                  prfSalt: false,
                   eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
                   meta: {
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be '' // Object.is equality

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:192:25
                   encryptedPayload: val.encryptedPayload || '',
                   prfSalt: val.prfSalt || '',
                   eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
-                  meta: {
-                    ...val.meta,
-                    version: val.meta?.version || 1,
-                  },
+                  meta: {},
                 },
               ];
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:194:30
                   eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
                   meta: {
                     ...val.meta,
-                    version: val.meta?.version || 1,
+                    version: false,
                   },
                 },
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/lib/PasskeyBindingService.ts:194:30
                   eventLog: Array.isArray(val.eventLog) ? val.eventLog : [],
                   meta: {
                     ...val.meta,
-                    version: val.meta?.version || 1,
+                    version: val.meta.version || 1,
                   },
                 },
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: Cannot read properties of undefined (reading 'version')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:198:70
                   },
                 },
               ];
-            }).filter(([_, record]) => record.credentialId !== '' || record.meta.version === 1) // Allow empty for test of default defaults, normally invalid
+            }).filter(([_, record]) => record.credentialId !== '' || false) // Allow empty for test of default defaults, normally invalid
           )
         : {},
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:198:23
                   },
                 },
               ];
-            }).filter(([_, record]) => record.credentialId !== '' || record.meta.version === 1) // Allow empty for test of default defaults, normally invalid
+            }).filter(() => undefined) // Allow empty for test of default defaults, normally invalid
           )
         : {},
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:205:9
     revocations: Array.isArray(candidate.revocations) ? candidate.revocations : [],
     policy: {
       maxBindingAgeDays:
-        typeof candidate.policy?.maxBindingAgeDays === 'number'
+        true
           ? candidate.policy.maxBindingAgeDays
           : DEFAULT_POLICY.maxBindingAgeDays,
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:205:9
     revocations: Array.isArray(candidate.revocations) ? candidate.revocations : [],
     policy: {
       maxBindingAgeDays:
-        typeof candidate.policy?.maxBindingAgeDays === 'number'
+        typeof candidate.policy?.maxBindingAgeDays !== 'number'
           ? candidate.policy.maxBindingAgeDays
           : DEFAULT_POLICY.maxBindingAgeDays,
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:209:9
           ? candidate.policy.maxBindingAgeDays
           : DEFAULT_POLICY.maxBindingAgeDays,
       requireRecoveryExportBeforeRotation:
-        typeof candidate.policy?.requireRecoveryExportBeforeRotation === 'boolean'
+        true
           ? candidate.policy.requireRecoveryExportBeforeRotation
           : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:209:9
           ? candidate.policy.maxBindingAgeDays
           : DEFAULT_POLICY.maxBindingAgeDays,
       requireRecoveryExportBeforeRotation:
-        typeof candidate.policy?.requireRecoveryExportBeforeRotation === 'boolean'
+        typeof candidate.policy?.requireRecoveryExportBeforeRotation !== 'boolean'
           ? candidate.policy.requireRecoveryExportBeforeRotation
           : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:213:9
           ? candidate.policy.requireRecoveryExportBeforeRotation
           : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
       blockRevokedCredentials:
-        typeof candidate.policy?.blockRevokedCredentials === 'boolean'
+        true
           ? candidate.policy.blockRevokedCredentials
           : DEFAULT_POLICY.blockRevokedCredentials,
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:213:9
           ? candidate.policy.requireRecoveryExportBeforeRotation
           : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
       blockRevokedCredentials:
-        typeof candidate.policy?.blockRevokedCredentials === 'boolean'
+        typeof candidate.policy?.blockRevokedCredentials !== 'boolean'
           ? candidate.policy.blockRevokedCredentials
           : DEFAULT_POLICY.blockRevokedCredentials,
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:220:38
   };
 };
 
-const clearLegacyStorageKeys = () => {
-  localStorage.removeItem(BINDINGS_KEY);
-  localStorage.removeItem(LEGACY_ID_KEY);
-  localStorage.removeItem(LEGACY_DATA_KEY);
-  localStorage.removeItem(LEGACY_SALT_KEY);
-  localStorage.removeItem(LEGACY_META_KEY);
-  localStorage.removeItem(PASSKEY_AUDIT_KEY);
-  localStorage.removeItem(PASSKEY_REVOCATIONS_KEY);
-  localStorage.removeItem(PASSKEY_POLICY_KEY);
-};
+const clearLegacyStorageKeys = () => {};
 
 const loadLegacyState = (): PasskeySecureState => {

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:231:51
   localStorage.removeItem(PASSKEY_POLICY_KEY);
 };
 
-const loadLegacyState = (): PasskeySecureState => {
-  const bindings = safeParse<Record<string, PasskeyBindingRecord>>(
-    localStorage.getItem(BINDINGS_KEY)
-  );
-  const auditLog = safeParse<PasskeyEventRecord[]>(localStorage.getItem(PASSKEY_AUDIT_KEY));
-  const revocations = safeParse<PasskeyRevocationRecord[]>(
-    localStorage.getItem(PASSKEY_REVOCATIONS_KEY)
-  );
-  const policyRaw = safeParse<PasskeyPolicy>(localStorage.getItem(PASSKEY_POLICY_KEY));
-  return normalizePersistedState({
-    bindings: bindings && typeof bindings === 'object' ? bindings : {},
-    auditLog: Array.isArray(auditLog) ? auditLog : [],
-    revocations: Array.isArray(revocations) ? revocations : [],
-    policy: policyRaw || DEFAULT_POLICY,
-  });
-};
+const loadLegacyState = (): PasskeySecureState => {};
 
 const schedulePersist = () => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: Cannot read properties of undefined (reading 'bindings')

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:240:34
     localStorage.getItem(PASSKEY_REVOCATIONS_KEY)
   );
   const policyRaw = safeParse<PasskeyPolicy>(localStorage.getItem(PASSKEY_POLICY_KEY));
-  return normalizePersistedState({
-    bindings: bindings && typeof bindings === 'object' ? bindings : {},
-    auditLog: Array.isArray(auditLog) ? auditLog : [],
-    revocations: Array.isArray(revocations) ? revocations : [],
-    policy: policyRaw || DEFAULT_POLICY,
-  });
+  return normalizePersistedState({});
 };
 
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:241:15
   );
   const policyRaw = safeParse<PasskeyPolicy>(localStorage.getItem(PASSKEY_POLICY_KEY));
   return normalizePersistedState({
-    bindings: bindings && typeof bindings === 'object' ? bindings : {},
+    bindings: false ? bindings : {},
     auditLog: Array.isArray(auditLog) ? auditLog : [],
     revocations: Array.isArray(revocations) ? revocations : [],
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:241:27
   );
   const policyRaw = safeParse<PasskeyPolicy>(localStorage.getItem(PASSKEY_POLICY_KEY));
   return normalizePersistedState({
-    bindings: bindings && typeof bindings === 'object' ? bindings : {},
+    bindings: bindings && typeof bindings !== 'object' ? bindings : {},
     auditLog: Array.isArray(auditLog) ? auditLog : [],
     revocations: Array.isArray(revocations) ? revocations : [],
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/lib/PasskeyBindingService.ts:244:13
     bindings: bindings && typeof bindings === 'object' ? bindings : {},
     auditLog: Array.isArray(auditLog) ? auditLog : [],
     revocations: Array.isArray(revocations) ? revocations : [],
-    policy: policyRaw || DEFAULT_POLICY,
+    policy: policyRaw && DEFAULT_POLICY,
   });
 };

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:244:13
     bindings: bindings && typeof bindings === 'object' ? bindings : {},
     auditLog: Array.isArray(auditLog) ? auditLog : [],
     revocations: Array.isArray(revocations) ? revocations : [],
-    policy: policyRaw || DEFAULT_POLICY,
+    policy: false,
   });
 };

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:248:31
   });
 };
 
-const schedulePersist = () => {
-  secureStatePersistPromise = secureStatePersistPromise
-    .catch(() => undefined)
-    .then(async () => {
-      if (!hasIndexedDb()) return;
-      await writeStateToIndexedDb(secureStateCache);
-    });
-  return secureStatePersistPromise;
-};
+const schedulePersist = () => {};
 
 const ensureBootstrappedState = () => {

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:251:23
 const schedulePersist = () => {
   secureStatePersistPromise = secureStatePersistPromise
     .catch(() => undefined)
-    .then(async () => {
-      if (!hasIndexedDb()) return;
-      await writeStateToIndexedDb(secureStateCache);
-    });
+    .then(async () => {});
   return secureStatePersistPromise;
 };

[Survived] BooleanLiteral
src/lib/PasskeyBindingService.ts:252:11
   secureStatePersistPromise = secureStatePersistPromise
     .catch(() => undefined)
     .then(async () => {
-      if (!hasIndexedDb()) return;
+      if (hasIndexedDb()) return;
       await writeStateToIndexedDb(secureStateCache);
     });

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:252:11
   secureStatePersistPromise = secureStatePersistPromise
     .catch(() => undefined)
     .then(async () => {
-      if (!hasIndexedDb()) return;
+      if (true) return;
       await writeStateToIndexedDb(secureStateCache);
     });

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:258:39
   return secureStatePersistPromise;
 };
 
-const ensureBootstrappedState = () => {
-  if (secureStateInitialized) return;
-  secureStateCache = loadLegacyState();
-};
+const ensureBootstrappedState = () => {};
 
 const readBindingMap = (): Record<string, PasskeyBindingRecord> => {

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:259:7
 };
 
 const ensureBootstrappedState = () => {
-  if (secureStateInitialized) return;
+  if (false) return;
   secureStateCache = loadLegacyState();
 };
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: expected undefined to be 'newer_external' // Object.is equality

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:259:7
 };
 
 const ensureBootstrappedState = () => {
-  if (secureStateInitialized) return;
+  if (true) return;
   secureStateCache = loadLegacyState();
 };

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:263:68
   secureStateCache = loadLegacyState();
 };
 
-const readBindingMap = (): Record<string, PasskeyBindingRecord> => {
-  ensureBootstrappedState();
-  return secureStateCache.bindings;
-};
+const readBindingMap = (): Record<string, PasskeyBindingRecord> => {};
 
 const writeBindingMap = (map: Record<string, PasskeyBindingRecord>) => {
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: Cannot read properties of undefined (reading 'prof::db')

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:273:50
   void schedulePersist();
 };
 
-const readAuditLog = (): PasskeyEventRecord[] => {
-  ensureBootstrappedState();
-  return secureStateCache.auditLog;
-};
+const readAuditLog = (): PasskeyEventRecord[] => {};
 
 const writeAuditLog = (events: PasskeyEventRecord[]) => {
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: readAuditLog is not a function or its return value is not iterable

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:278:57
   return secureStateCache.auditLog;
 };
 
-const writeAuditLog = (events: PasskeyEventRecord[]) => {
-  secureStateCache.auditLog = events.slice(-PASSKEY_EVENT_LIMIT * 4);
-  void schedulePersist();
-};
+const writeAuditLog = (events: PasskeyEventRecord[]) => {};
 
 const readRevocations = (): PasskeyRevocationRecord[] => {
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage getEventLog returns global audit log when no profile specified
statusReason: expected 0 to be greater than 0

[Killed] UnaryOperator
src/lib/PasskeyBindingService.ts:279:44
 };
 
 const writeAuditLog = (events: PasskeyEventRecord[]) => {
-  secureStateCache.auditLog = events.slice(-PASSKEY_EVENT_LIMIT * 4);
+  secureStateCache.auditLog = events.slice(+PASSKEY_EVENT_LIMIT * 4);
   void schedulePersist();
 };
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage getEventLog returns global audit log when no profile specified
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
src/lib/PasskeyBindingService.ts:279:31
 };
 
 const writeAuditLog = (events: PasskeyEventRecord[]) => {
-  secureStateCache.auditLog = events.slice(-PASSKEY_EVENT_LIMIT * 4);
+  secureStateCache.auditLog = events;
   void schedulePersist();
 };

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:283:58
   void schedulePersist();
 };
 
-const readRevocations = (): PasskeyRevocationRecord[] => {
-  ensureBootstrappedState();
-  return secureStateCache.revocations;
-};
+const readRevocations = (): PasskeyRevocationRecord[] => {};
 
 const writeRevocations = (items: PasskeyRevocationRecord[]) => {
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:288:64
   return secureStateCache.revocations;
 };
 
-const writeRevocations = (items: PasskeyRevocationRecord[]) => {
-  secureStateCache.revocations = items.slice(-PASSKEY_EVENT_LIMIT * 4);
-  void schedulePersist();
-};
+const writeRevocations = (items: PasskeyRevocationRecord[]) => {};
 
 const readPolicy = (): PasskeyPolicy => {
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: expected 'old_local' to be 'newer_external' // Object.is equality

[Killed] UnaryOperator
src/lib/PasskeyBindingService.ts:289:46
 };
 
 const writeRevocations = (items: PasskeyRevocationRecord[]) => {
-  secureStateCache.revocations = items.slice(-PASSKEY_EVENT_LIMIT * 4);
+  secureStateCache.revocations = items.slice(+PASSKEY_EVENT_LIMIT * 4);
   void schedulePersist();
 };
killedBy: PasskeyBindingService merges external revocations and returns count
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/lib/PasskeyBindingService.ts:289:34
 };
 
 const writeRevocations = (items: PasskeyRevocationRecord[]) => {
-  secureStateCache.revocations = items.slice(-PASSKEY_EVENT_LIMIT * 4);
+  secureStateCache.revocations = items;
   void schedulePersist();
 };

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:293:41
   void schedulePersist();
 };
 
-const readPolicy = (): PasskeyPolicy => {
-  ensureBootstrappedState();
-  const parsed = secureStateCache.policy;
-  return {
-    maxBindingAgeDays:
-      typeof parsed?.maxBindingAgeDays === 'number'
-        ? parsed.maxBindingAgeDays
-        : DEFAULT_POLICY.maxBindingAgeDays,
-    requireRecoveryExportBeforeRotation:
-      typeof parsed?.requireRecoveryExportBeforeRotation === 'boolean'
-        ? parsed.requireRecoveryExportBeforeRotation
-        : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
-    blockRevokedCredentials:
-      typeof parsed?.blockRevokedCredentials === 'boolean'
-        ? parsed.blockRevokedCredentials
-        : DEFAULT_POLICY.blockRevokedCredentials,
-  };
-};
+const readPolicy = (): PasskeyPolicy => {};
 
 const writePolicy = (policy: PasskeyPolicy) => {
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns empty array for no violations
statusReason: Cannot read properties of undefined (reading 'blockRevokedCredentials')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:298:7
   const parsed = secureStateCache.policy;
   return {
     maxBindingAgeDays:
-      typeof parsed?.maxBindingAgeDays === 'number'
+      true
         ? parsed.maxBindingAgeDays
         : DEFAULT_POLICY.maxBindingAgeDays,
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:298:7
   const parsed = secureStateCache.policy;
   return {
     maxBindingAgeDays:
-      typeof parsed?.maxBindingAgeDays === 'number'
+      typeof parsed?.maxBindingAgeDays !== 'number'
         ? parsed.maxBindingAgeDays
         : DEFAULT_POLICY.maxBindingAgeDays,
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:302:7
         ? parsed.maxBindingAgeDays
         : DEFAULT_POLICY.maxBindingAgeDays,
     requireRecoveryExportBeforeRotation:
-      typeof parsed?.requireRecoveryExportBeforeRotation === 'boolean'
+      true
         ? parsed.requireRecoveryExportBeforeRotation
         : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] OptionalChaining
src/lib/PasskeyBindingService.ts:302:14
         ? parsed.maxBindingAgeDays
         : DEFAULT_POLICY.maxBindingAgeDays,
     requireRecoveryExportBeforeRotation:
-      typeof parsed?.requireRecoveryExportBeforeRotation === 'boolean'
+      typeof parsed.requireRecoveryExportBeforeRotation === 'boolean'
         ? parsed.requireRecoveryExportBeforeRotation
         : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:306:7
         ? parsed.requireRecoveryExportBeforeRotation
         : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
     blockRevokedCredentials:
-      typeof parsed?.blockRevokedCredentials === 'boolean'
+      typeof parsed?.blockRevokedCredentials !== 'boolean'
         ? parsed.blockRevokedCredentials
         : DEFAULT_POLICY.blockRevokedCredentials,
killedBy: PasskeyBindingService getPolicyViolations correctly identifies issues based on current policy
statusReason: expected [ 'PASSKEY_REVOKED' ] to deeply equal []
