[Killed] OptionalChaining
src/lib/PasskeyBindingService.ts:306:14
         ? parsed.requireRecoveryExportBeforeRotation
         : DEFAULT_POLICY.requireRecoveryExportBeforeRotation,
     blockRevokedCredentials:
-      typeof parsed?.blockRevokedCredentials === 'boolean'
+      typeof parsed.blockRevokedCredentials === 'boolean'
         ? parsed.blockRevokedCredentials
         : DEFAULT_POLICY.blockRevokedCredentials,
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:312:48
   };
 };
 
-const writePolicy = (policy: PasskeyPolicy) => {
-  secureStateCache.policy = policy;
-  void schedulePersist();
-};
+const writePolicy = (policy: PasskeyPolicy) => {};
 
 const getDeviceInfo = () => {
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:317:29
   void schedulePersist();
 };
 
-const getDeviceInfo = () => {
-  const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
-  const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
-  const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
-  const deviceLabel = `This device / ${platform}`;
-  const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
-  let hash = 0;
-  for (let i = 0; i < fingerprintSource.length; i += 1) {
-    hash = (hash << 5) - hash + fingerprintSource.charCodeAt(i);
-    hash |= 0;
-  }
-  const normalized = Math.abs(hash).toString(16).padStart(8, '0');
-  return {
-    deviceLabel,
-    deviceFingerprint: normalized,
-  };
-};
+const getDeviceInfo = () => {};
 
 const appendEvent = (
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: Cannot read properties of undefined (reading 'deviceLabel')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:318:20
 };
 
 const getDeviceInfo = () => {
-  const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
+  const platform = true ? navigator.platform || 'unknown' : 'unknown';
   const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
   const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
killedBy: PasskeyBindingService handles missing navigator properties in getDeviceInfo
statusReason: Cannot read properties of undefined (reading 'platform')

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:318:20
 };
 
 const getDeviceInfo = () => {
-  const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
+  const platform = typeof navigator === 'undefined' ? navigator.platform || 'unknown' : 'unknown';
   const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
   const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
killedBy: PasskeyBindingService handles missing navigator properties in getDeviceInfo
statusReason: Cannot read properties of undefined (reading 'platform')

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:319:18
 
 const getDeviceInfo = () => {
   const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
-  const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
+  const locale = typeof navigator === 'undefined' ? navigator.language || 'en' : 'en';
   const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
   const deviceLabel = `This device / ${platform}`;
killedBy: PasskeyBindingService handles missing navigator properties in getDeviceInfo
statusReason: Cannot read properties of undefined (reading 'language')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:319:18
 
 const getDeviceInfo = () => {
   const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
-  const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
+  const locale = true ? navigator.language || 'en' : 'en';
   const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
   const deviceLabel = `This device / ${platform}`;
killedBy: PasskeyBindingService handles missing navigator properties in getDeviceInfo
statusReason: Cannot read properties of undefined (reading 'language')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:320:21
 const getDeviceInfo = () => {
   const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
   const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
-  const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
+  const userAgent = true ? navigator.userAgent || '' : '';
   const deviceLabel = `This device / ${platform}`;
   const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
killedBy: PasskeyBindingService handles missing navigator properties in getDeviceInfo
statusReason: Cannot read properties of undefined (reading 'userAgent')

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:320:21
 const getDeviceInfo = () => {
   const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
   const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
-  const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
+  const userAgent = typeof navigator === 'undefined' ? navigator.userAgent || '' : '';
   const deviceLabel = `This device / ${platform}`;
   const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
killedBy: PasskeyBindingService handles missing navigator properties in getDeviceInfo
statusReason: Cannot read properties of undefined (reading 'userAgent')

[Killed] StringLiteral
src/lib/PasskeyBindingService.ts:321:23
   const platform = typeof navigator !== 'undefined' ? navigator.platform || 'unknown' : 'unknown';
   const locale = typeof navigator !== 'undefined' ? navigator.language || 'en' : 'en';
   const userAgent = typeof navigator !== 'undefined' ? navigator.userAgent || '' : '';
-  const deviceLabel = `This device / ${platform}`;
+  const deviceLabel = ``;
   const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
   let hash = 0;
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: expected '' to contain 'This device'

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:324:19
   const deviceLabel = `This device / ${platform}`;
   const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
   let hash = 0;
-  for (let i = 0; i < fingerprintSource.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     hash = (hash << 5) - hash + fingerprintSource.charCodeAt(i);
     hash |= 0;

[Timeout] AssignmentOperator
src/lib/PasskeyBindingService.ts:324:49
   const deviceLabel = `This device / ${platform}`;
   const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
   let hash = 0;
-  for (let i = 0; i < fingerprintSource.length; i += 1) {
+  for (let i = 0; i < fingerprintSource.length; i -= 1) {
     hash = (hash << 5) - hash + fingerprintSource.charCodeAt(i);
     hash |= 0;

[Survived] ArithmeticOperator
src/lib/PasskeyBindingService.ts:325:12
   const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
   let hash = 0;
   for (let i = 0; i < fingerprintSource.length; i += 1) {
-    hash = (hash << 5) - hash + fingerprintSource.charCodeAt(i);
+    hash = (hash << 5) + hash + fingerprintSource.charCodeAt(i);
     hash |= 0;
   }

[Survived] ArithmeticOperator
src/lib/PasskeyBindingService.ts:325:12
   const fingerprintSource = JSON.stringify({ platform, locale, userAgent });
   let hash = 0;
   for (let i = 0; i < fingerprintSource.length; i += 1) {
-    hash = (hash << 5) - hash + fingerprintSource.charCodeAt(i);
+    hash = (hash << 5) - hash - fingerprintSource.charCodeAt(i);
     hash |= 0;
   }

[Survived] AssignmentOperator
src/lib/PasskeyBindingService.ts:326:5
   let hash = 0;
   for (let i = 0; i < fingerprintSource.length; i += 1) {
     hash = (hash << 5) - hash + fingerprintSource.charCodeAt(i);
-    hash |= 0;
+    hash &= 0;
   }
   const normalized = Math.abs(hash).toString(16).padStart(8, '0');

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:329:10
     hash |= 0;
   }
   const normalized = Math.abs(hash).toString(16).padStart(8, '0');
-  return {
-    deviceLabel,
-    deviceFingerprint: normalized,
-  };
+  return {};
 };
 
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: expected undefined to be truthy

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:339:6
   map: Record<string, PasskeyBindingRecord>,
   key: string,
   event: PasskeyEventRecord
-) => {
-  if (map[key]) {
-    map[key].eventLog = [...(map[key].eventLog || []), event].slice(-PASSKEY_EVENT_LIMIT);
-  }
-  writeAuditLog([...readAuditLog(), event]);
-};
+) => {};
 
 const migrateLegacyIfExists = (
killedBy: PasskeyBindingService revokes only the selected profile binding and tracks the event
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:340:17
   key: string,
   event: PasskeyEventRecord
 ) => {
-  if (map[key]) {
-    map[key].eventLog = [...(map[key].eventLog || []), event].slice(-PASSKEY_EVENT_LIMIT);
-  }
+  if (map[key]) {}
   writeAuditLog([...readAuditLog(), event]);
 };
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage noteRecoveryExport sets recoveryLastExportedAt and appends event
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:340:7
   key: string,
   event: PasskeyEventRecord
 ) => {
-  if (map[key]) {
+  if (false) {
     map[key].eventLog = [...(map[key].eventLog || []), event].slice(-PASSKEY_EVENT_LIMIT);
   }
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage noteRecoveryExport sets recoveryLastExportedAt and appends event
statusReason: expected false to be true // Object.is equality

[Killed] UnaryOperator
src/lib/PasskeyBindingService.ts:341:69
   event: PasskeyEventRecord
 ) => {
   if (map[key]) {
-    map[key].eventLog = [...(map[key].eventLog || []), event].slice(-PASSKEY_EVENT_LIMIT);
+    map[key].eventLog = [...(map[key].eventLog || []), event].slice(+PASSKEY_EVENT_LIMIT);
   }
   writeAuditLog([...readAuditLog(), event]);
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage noteRecoveryExport sets recoveryLastExportedAt and appends event
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:341:30
   event: PasskeyEventRecord
 ) => {
   if (map[key]) {
-    map[key].eventLog = [...(map[key].eventLog || []), event].slice(-PASSKEY_EVENT_LIMIT);
+    map[key].eventLog = [...(true), event].slice(-PASSKEY_EVENT_LIMIT);
   }
   writeAuditLog([...readAuditLog(), event]);
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:350:24
   profileId?: string | null,
   dbName?: string
 ): PasskeyBindingRecord | null => {
-  const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
+  const credentialId = localStorage.getItem(LEGACY_ID_KEY) && '';
   const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
   const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
killedBy: PasskeyBindingService handles corrupted localStorage data in legacy migration
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:350:24
   profileId?: string | null,
   dbName?: string
 ): PasskeyBindingRecord | null => {
-  const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
+  const credentialId = true;
   const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
   const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: expected true to be 'legacy-id' // Object.is equality

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:351:28
   dbName?: string
 ): PasskeyBindingRecord | null => {
   const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
-  const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
+  const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) && '';
   const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
   if (!credentialId || !encryptedPayload || !prfSalt) return null;
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:351:28
   dbName?: string
 ): PasskeyBindingRecord | null => {
   const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
-  const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
+  const encryptedPayload = false;
   const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
   if (!credentialId || !encryptedPayload || !prfSalt) return null;
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:352:19
 ): PasskeyBindingRecord | null => {
   const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
   const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
-  const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
+  const prfSalt = false;
   if (!credentialId || !encryptedPayload || !prfSalt) return null;
 
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:352:19
 ): PasskeyBindingRecord | null => {
   const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
   const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
-  const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
+  const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) && '';
   if (!credentialId || !encryptedPayload || !prfSalt) return null;
 
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:353:24
   const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
   const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
   const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
-  if (!credentialId || !encryptedPayload || !prfSalt) return null;
+  if (!credentialId || encryptedPayload || !prfSalt) return null;
 
   const legacyMeta = safeParse<PasskeyBindingMeta>(localStorage.getItem(LEGACY_META_KEY));
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:353:7
   const credentialId = localStorage.getItem(LEGACY_ID_KEY) || '';
   const encryptedPayload = localStorage.getItem(LEGACY_DATA_KEY) || '';
   const prfSalt = localStorage.getItem(LEGACY_SALT_KEY) || '';
-  if (!credentialId || !encryptedPayload || !prfSalt) return null;
+  if (false) return null;
 
   const legacyMeta = safeParse<PasskeyBindingMeta>(localStorage.getItem(LEGACY_META_KEY));
killedBy: PasskeyBindingService Branch Coverage Export Recovery Package throws NO_PASSKEY_BINDING if no binding exists
statusReason: promise resolved "'encrypted-pkg-data'" instead of rejecting

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:357:40
 
   const legacyMeta = safeParse<PasskeyBindingMeta>(localStorage.getItem(LEGACY_META_KEY));
   const now = new Date().toISOString();
-  const record: PasskeyBindingRecord = {
-    credentialId,
-    encryptedPayload,
-    prfSalt,
-    meta: {
-      createdAt: legacyMeta?.createdAt || now,
-      lastUsedAt: legacyMeta?.lastUsedAt || now,
-      version: 1,
-      profileId: profileId || legacyMeta?.profileId || null,
-      dbName: dbName || legacyMeta?.dbName || 'aegis_opfs_vault',
-      ...getDeviceInfo(),
-    },
-    eventLog: [],
-  };
+  const record: PasskeyBindingRecord = {};
 
   const map = readBindingMap();
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: Cannot read properties of undefined (reading 'profileId')

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:361:11
     credentialId,
     encryptedPayload,
     prfSalt,
-    meta: {
-      createdAt: legacyMeta?.createdAt || now,
-      lastUsedAt: legacyMeta?.lastUsedAt || now,
-      version: 1,
-      profileId: profileId || legacyMeta?.profileId || null,
-      dbName: dbName || legacyMeta?.dbName || 'aegis_opfs_vault',
-      ...getDeviceInfo(),
-    },
+    meta: {},
     eventLog: [],
   };
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected undefined to be 'prof-legacy' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:362:18
     encryptedPayload,
     prfSalt,
     meta: {
-      createdAt: legacyMeta?.createdAt || now,
+      createdAt: true,
       lastUsedAt: legacyMeta?.lastUsedAt || now,
       version: 1,
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected true to be '2025-01-01T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:362:18
     encryptedPayload,
     prfSalt,
     meta: {
-      createdAt: legacyMeta?.createdAt || now,
+      createdAt: false,
       lastUsedAt: legacyMeta?.lastUsedAt || now,
       version: 1,
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected false to be '2025-01-01T00:00:00.000Z' // Object.is equality

[Killed] OptionalChaining
src/lib/PasskeyBindingService.ts:363:19
     prfSalt,
     meta: {
       createdAt: legacyMeta?.createdAt || now,
-      lastUsedAt: legacyMeta?.lastUsedAt || now,
+      lastUsedAt: legacyMeta.lastUsedAt || now,
       version: 1,
       profileId: profileId || legacyMeta?.profileId || null,
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: Cannot read properties of null (reading 'lastUsedAt')

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:363:19
     prfSalt,
     meta: {
       createdAt: legacyMeta?.createdAt || now,
-      lastUsedAt: legacyMeta?.lastUsedAt || now,
+      lastUsedAt: true,
       version: 1,
       profileId: profileId || legacyMeta?.profileId || null,

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:365:18
       createdAt: legacyMeta?.createdAt || now,
       lastUsedAt: legacyMeta?.lastUsedAt || now,
       version: 1,
-      profileId: profileId || legacyMeta?.profileId || null,
+      profileId: (profileId || legacyMeta?.profileId) && null,
       dbName: dbName || legacyMeta?.dbName || 'aegis_opfs_vault',
       ...getDeviceInfo(),
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected null to be 'prof-legacy' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:365:18
       createdAt: legacyMeta?.createdAt || now,
       lastUsedAt: legacyMeta?.lastUsedAt || now,
       version: 1,
-      profileId: profileId || legacyMeta?.profileId || null,
+      profileId: false || null,
       dbName: dbName || legacyMeta?.dbName || 'aegis_opfs_vault',
       ...getDeviceInfo(),
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations migrates legacy keys safely when using getBinding
statusReason: expected null to be 'prof-legacy' // Object.is equality

[Survived] LogicalOperator
src/lib/PasskeyBindingService.ts:366:15
       lastUsedAt: legacyMeta?.lastUsedAt || now,
       version: 1,
       profileId: profileId || legacyMeta?.profileId || null,
-      dbName: dbName || legacyMeta?.dbName || 'aegis_opfs_vault',
+      dbName: dbName && legacyMeta?.dbName || 'aegis_opfs_vault',
       ...getDeviceInfo(),
     },

[NoCoverage] OptionalChaining
src/lib/PasskeyBindingService.ts:366:25
       lastUsedAt: legacyMeta?.lastUsedAt || now,
       version: 1,
       profileId: profileId || legacyMeta?.profileId || null,
-      dbName: dbName || legacyMeta?.dbName || 'aegis_opfs_vault',
+      dbName: dbName || legacyMeta.dbName || 'aegis_opfs_vault',
       ...getDeviceInfo(),
     },

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:395:9
 
 export class PasskeyBindingService {
   static async initialize(): Promise<void> {
-    if (secureStateInitialized) return;
+    if (true) return;
     if (secureStateInitPromise) return secureStateInitPromise;
 
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: expected undefined to be 'newer_external' // Object.is equality

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:395:9
 
 export class PasskeyBindingService {
   static async initialize(): Promise<void> {
-    if (secureStateInitialized) return;
+    if (false) return;
     if (secureStateInitPromise) return secureStateInitPromise;
 

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:396:9
 export class PasskeyBindingService {
   static async initialize(): Promise<void> {
     if (secureStateInitialized) return;
-    if (secureStateInitPromise) return secureStateInitPromise;
+    if (true) return secureStateInitPromise;
 
     secureStateInitPromise = (async () => {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:396:9
 export class PasskeyBindingService {
   static async initialize(): Promise<void> {
     if (secureStateInitialized) return;
-    if (secureStateInitPromise) return secureStateInitPromise;
+    if (false) return secureStateInitPromise;
 
     secureStateInitPromise = (async () => {

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:398:43
     if (secureStateInitialized) return;
     if (secureStateInitPromise) return secureStateInitPromise;
 
-    secureStateInitPromise = (async () => {
-      if (!hasIndexedDb()) {
-        secureStateCache = loadLegacyState();
-        secureStateInitialized = true;
-        return;
-      }
-
-      try {
-        const stored = await readStateFromIndexedDb();
-        if (stored) {
-          secureStateCache = stored;
-        } else {
-          secureStateCache = loadLegacyState();
-          await writeStateToIndexedDb(secureStateCache);
-        }
-        clearLegacyStorageKeys();
-      } catch {
-        secureStateCache = loadLegacyState();
-      }
-      secureStateInitialized = true;
-    })().finally(() => {
+    secureStateInitPromise = (async () => {})().finally(() => {
       secureStateInitPromise = null;
     });
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:399:11
     if (secureStateInitPromise) return secureStateInitPromise;
 
     secureStateInitPromise = (async () => {
-      if (!hasIndexedDb()) {
+      if (true) {
         secureStateCache = loadLegacyState();
         secureStateInitialized = true;
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:399:11
     if (secureStateInitPromise) return secureStateInitPromise;
 
     secureStateInitPromise = (async () => {
-      if (!hasIndexedDb()) {
+      if (hasIndexedDb()) {
         secureStateCache = loadLegacyState();
         secureStateInitialized = true;
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:401:34
     secureStateInitPromise = (async () => {
       if (!hasIndexedDb()) {
         secureStateCache = loadLegacyState();
-        secureStateInitialized = true;
+        secureStateInitialized = false;
         return;
       }
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: expected undefined to be 'cred-A' // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:405:11
         return;
       }
 
-      try {
-        const stored = await readStateFromIndexedDb();
-        if (stored) {
-          secureStateCache = stored;
-        } else {
-          secureStateCache = loadLegacyState();
-          await writeStateToIndexedDb(secureStateCache);
-        }
-        clearLegacyStorageKeys();
-      } catch {
+      try {} catch {
         secureStateCache = loadLegacyState();
       }
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:407:13
 
       try {
         const stored = await readStateFromIndexedDb();
-        if (stored) {
+        if (false) {
           secureStateCache = stored;
         } else {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:407:21
 
       try {
         const stored = await readStateFromIndexedDb();
-        if (stored) {
-          secureStateCache = stored;
-        } else {
+        if (stored) {} else {
           secureStateCache = loadLegacyState();
           await writeStateToIndexedDb(secureStateCache);
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/lib/PasskeyBindingService.ts:409:16
         const stored = await readStateFromIndexedDb();
         if (stored) {
           secureStateCache = stored;
-        } else {
-          secureStateCache = loadLegacyState();
-          await writeStateToIndexedDb(secureStateCache);
-        }
+        } else {}
         clearLegacyStorageKeys();
       } catch {

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:414:15
           await writeStateToIndexedDb(secureStateCache);
         }
         clearLegacyStorageKeys();
-      } catch {
-        secureStateCache = loadLegacyState();
-      }
+      } catch {}
       secureStateInitialized = true;
     })().finally(() => {

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:417:32
       } catch {
         secureStateCache = loadLegacyState();
       }
-      secureStateInitialized = true;
+      secureStateInitialized = false;
     })().finally(() => {
       secureStateInitPromise = null;
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/PasskeyBindingService.ts:418:24
         secureStateCache = loadLegacyState();
       }
       secureStateInitialized = true;
-    })().finally(() => {
-      secureStateInitPromise = null;
-    });
+    })().finally(() => {});
 
     return secureStateInitPromise;

[NoCoverage] BlockStatement
src/lib/PasskeyBindingService.ts:425:39
     return secureStateInitPromise;
   }
 
-  static async flush(): Promise<void> {
-    await this.initialize();
-    await schedulePersist();
-  }
+  static async flush(): Promise<void> {}
 
   static getPolicy(): PasskeyPolicy {
