[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:430:37
     await schedulePersist();
   }
 
-  static getPolicy(): PasskeyPolicy {
-    return readPolicy();
-  }
+  static getPolicy(): PasskeyPolicy {}
 
   static updatePolicy(nextPolicy: Partial<PasskeyPolicy>): PasskeyPolicy {
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:434:74
     return readPolicy();
   }
 
-  static updatePolicy(nextPolicy: Partial<PasskeyPolicy>): PasskeyPolicy {
-    const merged = {
-      ...readPolicy(),
-      ...nextPolicy,
-    };
-    writePolicy(merged);
-    writeAuditLog([
-      ...readAuditLog(),
-      {
-        at: new Date().toISOString(),
-        type: 'policy_updated',
-        detail: JSON.stringify(merged),
-      },
-    ]);
-    return merged;
-  }
+  static updatePolicy(nextPolicy: Partial<PasskeyPolicy>): PasskeyPolicy {}
 
   static getBinding(profileId?: string | null, dbName?: string): PasskeyBindingRecord | null {
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:451:94
     return merged;
   }
 
-  static getBinding(profileId?: string | null, dbName?: string): PasskeyBindingRecord | null {
-    const key = profileKey(profileId, dbName);
-    const map = readBindingMap();
-    if (map[key]) return map[key];
-    return migrateLegacyIfExists(profileId, dbName);
-  }
+  static getBinding(profileId?: string | null, dbName?: string): PasskeyBindingRecord | null {}
 
   static saveBinding(profileId: string | null, dbName: string, record: PasskeyBindingRecord): void {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles indexedDb read errors gracefully
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:454:9
   static getBinding(profileId?: string | null, dbName?: string): PasskeyBindingRecord | null {
     const key = profileKey(profileId, dbName);
     const map = readBindingMap();
-    if (map[key]) return map[key];
+    if (true) return map[key];
     return migrateLegacyIfExists(profileId, dbName);
   }
killedBy: PasskeyBindingService handles corrupted localStorage data in legacy migration
statusReason: expected undefined to be 'legacy-id' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:454:9
   static getBinding(profileId?: string | null, dbName?: string): PasskeyBindingRecord | null {
     const key = profileKey(profileId, dbName);
     const map = readBindingMap();
-    if (map[key]) return map[key];
+    if (false) return map[key];
     return migrateLegacyIfExists(profileId, dbName);
   }
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: expected undefined to be 'cred-A' // Object.is equality

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:464:16
     const now = new Date().toISOString();
     const existing = map[key];
     const deviceInfo = getDeviceInfo();
-    map[key] = {
-      ...record,
-      meta: {
-        ...record.meta,
-        createdAt: record.meta.createdAt || now,
-        lastUsedAt: record.meta.lastUsedAt || now,
-        profileId,
-        dbName,
-        version: record.meta.version || '1.0.0',
-        deviceLabel: record.meta.deviceLabel || deviceInfo.deviceLabel,
-        deviceFingerprint: record.meta.deviceFingerprint || deviceInfo.deviceFingerprint,
-        rotatedAt: existing ? now : record.meta.rotatedAt,
-        rotatedFromCredentialId: existing
-          ? existing.credentialId
-          : record.meta.rotatedFromCredentialId,
-      },
-      eventLog: [...(existing?.eventLog || []), ...(record.eventLog || [])].slice(
-        -PASSKEY_EVENT_LIMIT
-      ),
-    };
+    map[key] = {};
     appendEvent(map, key, {
       at: now,
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: Cannot read properties of undefined (reading 'deviceFingerprint')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:468:20
       ...record,
       meta: {
         ...record.meta,
-        createdAt: record.meta.createdAt || now,
+        createdAt: true,
         lastUsedAt: record.meta.lastUsedAt || now,
         profileId,
killedBy: PasskeyBindingService getPolicyViolations correctly identifies issues based on current policy
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:468:20
       ...record,
       meta: {
         ...record.meta,
-        createdAt: record.meta.createdAt || now,
+        createdAt: false,
         lastUsedAt: record.meta.lastUsedAt || now,
         profileId,
killedBy: PasskeyBindingService getPolicyViolations correctly identifies issues based on current policy
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:469:21
       meta: {
         ...record.meta,
         createdAt: record.meta.createdAt || now,
-        lastUsedAt: record.meta.lastUsedAt || now,
+        lastUsedAt: record.meta.lastUsedAt && now,
         profileId,
         dbName,
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected 'c1' to be 'c2' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:469:21
       meta: {
         ...record.meta,
         createdAt: record.meta.createdAt || now,
-        lastUsedAt: record.meta.lastUsedAt || now,
+        lastUsedAt: true,
         profileId,
         dbName,
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected 'c1' to be 'c2' // Object.is equality

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:472:18
         lastUsedAt: record.meta.lastUsedAt || now,
         profileId,
         dbName,
-        version: record.meta.version || '1.0.0',
+        version: record.meta.version && '1.0.0',
         deviceLabel: record.meta.deviceLabel || deviceInfo.deviceLabel,
         deviceFingerprint: record.meta.deviceFingerprint || deviceInfo.deviceFingerprint,
killedBy: PasskeyBindingService handles partial binding records and normalizes state
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:472:18
         lastUsedAt: record.meta.lastUsedAt || now,
         profileId,
         dbName,
-        version: record.meta.version || '1.0.0',
+        version: true,
         deviceLabel: record.meta.deviceLabel || deviceInfo.deviceLabel,
         deviceFingerprint: record.meta.deviceFingerprint || deviceInfo.deviceFingerprint,

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:473:22
         profileId,
         dbName,
         version: record.meta.version || '1.0.0',
-        deviceLabel: record.meta.deviceLabel || deviceInfo.deviceLabel,
+        deviceLabel: record.meta.deviceLabel && deviceInfo.deviceLabel,
         deviceFingerprint: record.meta.deviceFingerprint || deviceInfo.deviceFingerprint,
         rotatedAt: existing ? now : record.meta.rotatedAt,
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:473:22
         profileId,
         dbName,
         version: record.meta.version || '1.0.0',
-        deviceLabel: record.meta.deviceLabel || deviceInfo.deviceLabel,
+        deviceLabel: true,
         deviceFingerprint: record.meta.deviceFingerprint || deviceInfo.deviceFingerprint,
         rotatedAt: existing ? now : record.meta.rotatedAt,
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: expected [] to include 'This device'

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:474:28
         dbName,
         version: record.meta.version || '1.0.0',
         deviceLabel: record.meta.deviceLabel || deviceInfo.deviceLabel,
-        deviceFingerprint: record.meta.deviceFingerprint || deviceInfo.deviceFingerprint,
+        deviceFingerprint: false,
         rotatedAt: existing ? now : record.meta.rotatedAt,
         rotatedFromCredentialId: existing
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: expected false to be truthy

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:474:28
         dbName,
         version: record.meta.version || '1.0.0',
         deviceLabel: record.meta.deviceLabel || deviceInfo.deviceLabel,
-        deviceFingerprint: record.meta.deviceFingerprint || deviceInfo.deviceFingerprint,
+        deviceFingerprint: record.meta.deviceFingerprint && deviceInfo.deviceFingerprint,
         rotatedAt: existing ? now : record.meta.rotatedAt,
         rotatedFromCredentialId: existing
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:480:22
           ? existing.credentialId
           : record.meta.rotatedFromCredentialId,
       },
-      eventLog: [...(existing?.eventLog || []), ...(record.eventLog || [])].slice(
+      eventLog: [...(false), ...(record.eventLog || [])].slice(
         -PASSKEY_EVENT_LIMIT
       ),
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] OptionalChaining
src/lib/PasskeyBindingService.ts:480:22
           ? existing.credentialId
           : record.meta.rotatedFromCredentialId,
       },
-      eventLog: [...(existing?.eventLog || []), ...(record.eventLog || [])].slice(
+      eventLog: [...(existing.eventLog || []), ...(record.eventLog || [])].slice(
         -PASSKEY_EVENT_LIMIT
       ),
killedBy: PasskeyBindingService stores and reads profile-scoped binding with detailed metadata
statusReason: Cannot read properties of undefined (reading 'eventLog')

[Survived] UnaryOperator
src/lib/PasskeyBindingService.ts:481:9
           : record.meta.rotatedFromCredentialId,
       },
       eventLog: [...(existing?.eventLog || []), ...(record.eventLog || [])].slice(
-        -PASSKEY_EVENT_LIMIT
+        +PASSKEY_EVENT_LIMIT
       ),
     };

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:498:75
     writeBindingMap(map);
   }
 
-  static updateLastUsed(profileId?: string | null, dbName?: string): void {
-    const key = profileKey(profileId, dbName);
-    const map = readBindingMap();
-    if (!map[key]) return;
-    const now = new Date().toISOString();
-    map[key].meta = {
-      ...map[key].meta,
-      lastUsedAt: now,
-    };
-    appendEvent(map, key, {
-      at: now,
-      type: 'used',
-      profileId: map[key].meta.profileId,
-      dbName: map[key].meta.dbName,
-      credentialId: map[key].credentialId,
-      deviceFingerprint: map[key].meta.deviceFingerprint,
-      detail: 'Passkey used to unlock vault.',
-    });
-    writeBindingMap(map);
-  }
+  static updateLastUsed(profileId?: string | null, dbName?: string): void {}
 
   static revokeBinding(
killedBy: PasskeyBindingService updateLastUsed updates the time and logs event
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:501:9
   static updateLastUsed(profileId?: string | null, dbName?: string): void {
     const key = profileKey(profileId, dbName);
     const map = readBindingMap();
-    if (!map[key]) return;
+    if (false) return;
     const now = new Date().toISOString();
     map[key].meta = {
killedBy: PasskeyBindingService updateLastUsed updates the time and logs event
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:501:9
   static updateLastUsed(profileId?: string | null, dbName?: string): void {
     const key = profileKey(profileId, dbName);
     const map = readBindingMap();
-    if (!map[key]) return;
+    if (true) return;
     const now = new Date().toISOString();
     map[key].meta = {
killedBy: PasskeyBindingService updateLastUsed updates the time and logs event
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:526:27
   ): boolean {
     const key = profileKey(profileId, dbName);
     const map = readBindingMap();
-    if (!map[key]) return false;
+    if (!map[key]) return true;
     const record = map[key];
     const now = new Date().toISOString();
killedBy: PasskeyBindingService revokes only the selected profile binding and tracks the event
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:526:9
   ): boolean {
     const key = profileKey(profileId, dbName);
     const map = readBindingMap();
-    if (!map[key]) return false;
+    if (true) return false;
     const record = map[key];
     const now = new Date().toISOString();
killedBy: PasskeyBindingService revokes only the selected profile binding and tracks the event
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:530:22
     const record = map[key];
     const now = new Date().toISOString();
     const revocations = readRevocations();
-    revocations.push({
-      credentialId: record.credentialId,
-      revokedAt: now,
-      reason,
-      profileId: record.meta.profileId,
-      dbName: record.meta.dbName,
-      deviceFingerprint: record.meta.deviceFingerprint,
-    });
+    revocations.push({});
     writeRevocations(revocations);
     appendEvent(map, key, {
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations skips older external revocations
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:539:27
       deviceFingerprint: record.meta.deviceFingerprint,
     });
     writeRevocations(revocations);
-    appendEvent(map, key, {
-      at: now,
-      type: 'revoked',
-      profileId: record.meta.profileId,
-      dbName: record.meta.dbName,
-      credentialId: record.credentialId,
-      deviceFingerprint: record.meta.deviceFingerprint,
-      detail: reason,
-    });
+    appendEvent(map, key, {});
     delete map[key];
     writeBindingMap(map);
killedBy: PasskeyBindingService revokes only the selected profile binding and tracks the event
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:550:12
     });
     delete map[key];
     writeBindingMap(map);
-    return true;
+    return false;
   }
 
killedBy: PasskeyBindingService revokes only the selected profile binding and tracks the event
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:553:79
     return true;
   }
 
-  static noteRecoveryExport(profileId?: string | null, dbName?: string): void {
-    const key = profileKey(profileId, dbName);
-    const map = readBindingMap();
-    if (!map[key]) return;
-    const now = new Date().toISOString();
-    map[key].meta = {
-      ...map[key].meta,
-      recoveryLastExportedAt: now,
-    };
-    appendEvent(map, key, {
-      at: now,
-      type: 'recovery_exported',
-      profileId: map[key].meta.profileId,
-      dbName: map[key].meta.dbName,
-      credentialId: map[key].credentialId,
-      deviceFingerprint: map[key].meta.deviceFingerprint,
-      detail: 'Encrypted recovery package exported.',
-    });
-    writeBindingMap(map);
-  }
+  static noteRecoveryExport(profileId?: string | null, dbName?: string): void {}
 
   static hasAnyBinding(): boolean {
killedBy: PasskeyBindingService exportRecoveryPackage throws for missing and operates correctly otherwise
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:574:35
     writeBindingMap(map);
   }
 
-  static hasAnyBinding(): boolean {
-    const map = readBindingMap();
-    return Object.keys(map).length > 0;
-  }
+  static hasAnyBinding(): boolean {}
 
   static clearAllBindings(): void {
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage hasAnyBinding returns true when bindings exist
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:576:12
 
   static hasAnyBinding(): boolean {
     const map = readBindingMap();
-    return Object.keys(map).length > 0;
+    return false;
   }
 
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage hasAnyBinding returns true when bindings exist
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:576:12
 
   static hasAnyBinding(): boolean {
     const map = readBindingMap();
-    return Object.keys(map).length > 0;
+    return Object.keys(map).length <= 0;
   }
 
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage hasAnyBinding returns true when bindings exist
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:579:35
     return Object.keys(map).length > 0;
   }
 
-  static clearAllBindings(): void {
-    secureStateCache = createDefaultState();
-    clearLegacyStorageKeys();
-    void clearStateInIndexedDb();
-  }
+  static clearAllBindings(): void {}
 
   static listBindings(): Array<PasskeyBindingRecord & { bindingKey: string }> {
killedBy: PasskeyBindingService Branch Coverage Legacy Migrations handles legacy safely if format is invalid
statusReason: expected 'legacy-cred-123' to be 'legacy' // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:585:79
     void clearStateInIndexedDb();
   }
 
-  static listBindings(): Array<PasskeyBindingRecord & { bindingKey: string }> {
-    const map = readBindingMap();
-    return Object.entries(map)
-      .map(([bindingKey, record]) => ({ bindingKey, ...record }))
-      .sort(
-        (left, right) =>
-          Date.parse(right.meta.lastUsedAt || right.meta.createdAt) -
-          Date.parse(left.meta.lastUsedAt || left.meta.createdAt)
-      );
-  }
+  static listBindings(): Array<PasskeyBindingRecord & { bindingKey: string }> {}
 
   static getEventLog(profileId?: string | null, dbName?: string): PasskeyEventRecord[] {
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] MethodExpression
src/lib/PasskeyBindingService.ts:587:12
 
   static listBindings(): Array<PasskeyBindingRecord & { bindingKey: string }> {
     const map = readBindingMap();
-    return Object.entries(map)
-      .map(([bindingKey, record]) => ({ bindingKey, ...record }))
-      .sort(
-        (left, right) =>
-          Date.parse(right.meta.lastUsedAt || right.meta.createdAt) -
-          Date.parse(left.meta.lastUsedAt || left.meta.createdAt)
-      );
+    return Object.entries(map).map(([bindingKey, record]) => ({
+  bindingKey,
+  ...record
+}));
   }
 
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:588:12
   static listBindings(): Array<PasskeyBindingRecord & { bindingKey: string }> {
     const map = readBindingMap();
     return Object.entries(map)
-      .map(([bindingKey, record]) => ({ bindingKey, ...record }))
+      .map(() => undefined)
       .sort(
         (left, right) =>
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: Cannot read properties of undefined (reading 'bindingKey')

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:588:39
   static listBindings(): Array<PasskeyBindingRecord & { bindingKey: string }> {
     const map = readBindingMap();
     return Object.entries(map)
-      .map(([bindingKey, record]) => ({ bindingKey, ...record }))
+      .map(([bindingKey, record]) => ({}))
       .sort(
         (left, right) =>
killedBy: PasskeyBindingService Branch Coverage IndexedDB Integration handles initialize with IndexedDB successfully
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:590:9
     return Object.entries(map)
       .map(([bindingKey, record]) => ({ bindingKey, ...record }))
       .sort(
-        (left, right) =>
-          Date.parse(right.meta.lastUsedAt || right.meta.createdAt) -
-          Date.parse(left.meta.lastUsedAt || left.meta.createdAt)
+        () => undefined
       );
   }
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:591:22
       .map(([bindingKey, record]) => ({ bindingKey, ...record }))
       .sort(
         (left, right) =>
-          Date.parse(right.meta.lastUsedAt || right.meta.createdAt) -
+          Date.parse(right.meta.lastUsedAt && right.meta.createdAt) -
           Date.parse(left.meta.lastUsedAt || left.meta.createdAt)
       );
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:591:22
       .map(([bindingKey, record]) => ({ bindingKey, ...record }))
       .sort(
         (left, right) =>
-          Date.parse(right.meta.lastUsedAt || right.meta.createdAt) -
+          Date.parse(true) -
           Date.parse(left.meta.lastUsedAt || left.meta.createdAt)
       );
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:592:22
       .sort(
         (left, right) =>
           Date.parse(right.meta.lastUsedAt || right.meta.createdAt) -
-          Date.parse(left.meta.lastUsedAt || left.meta.createdAt)
+          Date.parse(true)
       );
   }
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected +0 to be 2 // Object.is equality

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:592:22
       .sort(
         (left, right) =>
           Date.parse(right.meta.lastUsedAt || right.meta.createdAt) -
-          Date.parse(left.meta.lastUsedAt || left.meta.createdAt)
+          Date.parse(left.meta.lastUsedAt && left.meta.createdAt)
       );
   }
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage listBindings sorts by lastUsedAt descending
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:596:88
       );
   }
 
-  static getEventLog(profileId?: string | null, dbName?: string): PasskeyEventRecord[] {
-    if (typeof profileId !== 'undefined' || typeof dbName !== 'undefined') {
-      const binding = this.getBinding(profileId, dbName);
-      return [...(binding?.eventLog || [])].reverse();
-    }
-    return [...readAuditLog()].reverse();
-  }
+  static getEventLog(profileId?: string | null, dbName?: string): PasskeyEventRecord[] {}
 
   static listRevocations(): PasskeyRevocationRecord[] {
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage noteRecoveryExport sets recoveryLastExportedAt and appends event
statusReason: Cannot read properties of null (reading 'meta')

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:597:9
   }
 
   static getEventLog(profileId?: string | null, dbName?: string): PasskeyEventRecord[] {
-    if (typeof profileId !== 'undefined' || typeof dbName !== 'undefined') {
+    if (typeof profileId !== 'undefined' && typeof dbName !== 'undefined') {
       const binding = this.getBinding(profileId, dbName);
       return [...(binding?.eventLog || [])].reverse();
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage noteRecoveryExport sets recoveryLastExportedAt and appends event
statusReason: Cannot read properties of null (reading 'meta')

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:597:45
   }
 
   static getEventLog(profileId?: string | null, dbName?: string): PasskeyEventRecord[] {
-    if (typeof profileId !== 'undefined' || typeof dbName !== 'undefined') {
+    if (typeof profileId !== 'undefined' || typeof dbName === 'undefined') {
       const binding = this.getBinding(profileId, dbName);
       return [...(binding?.eventLog || [])].reverse();
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage getEventLog returns global audit log when no profile specified
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:599:19
   static getEventLog(profileId?: string | null, dbName?: string): PasskeyEventRecord[] {
     if (typeof profileId !== 'undefined' || typeof dbName !== 'undefined') {
       const binding = this.getBinding(profileId, dbName);
-      return [...(binding?.eventLog || [])].reverse();
+      return [...(binding?.eventLog && [])].reverse();
     }
     return [...readAuditLog()].reverse();
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage noteRecoveryExport sets recoveryLastExportedAt and appends event
statusReason: Cannot read properties of null (reading 'meta')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:599:19
   static getEventLog(profileId?: string | null, dbName?: string): PasskeyEventRecord[] {
     if (typeof profileId !== 'undefined' || typeof dbName !== 'undefined') {
       const binding = this.getBinding(profileId, dbName);
-      return [...(binding?.eventLog || [])].reverse();
+      return [...(false)].reverse();
     }
     return [...readAuditLog()].reverse();
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage noteRecoveryExport sets recoveryLastExportedAt and appends event
statusReason: Cannot read properties of null (reading 'meta')

[Killed] MethodExpression
src/lib/PasskeyBindingService.ts:601:12
       const binding = this.getBinding(profileId, dbName);
       return [...(binding?.eventLog || [])].reverse();
     }
-    return [...readAuditLog()].reverse();
+    return [...readAuditLog()];
   }
 
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage getEventLog returns global audit log when no profile specified
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:604:55
     return [...readAuditLog()].reverse();
   }
 
-  static listRevocations(): PasskeyRevocationRecord[] {
-    return [...readRevocations()].reverse();
-  }
+  static listRevocations(): PasskeyRevocationRecord[] {}
 
   static isCredentialRevoked(credentialId: string): boolean {
killedBy: PasskeyBindingService normalizes completely corrupted legacy JSON safely to defaults
statusReason: expected undefined to deeply equal []

[Survived] MethodExpression
src/lib/PasskeyBindingService.ts:605:12
   }
 
   static listRevocations(): PasskeyRevocationRecord[] {
-    return [...readRevocations()].reverse();
+    return [...readRevocations()];
   }
 

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:608:61
     return [...readRevocations()].reverse();
   }
 
-  static isCredentialRevoked(credentialId: string): boolean {
-    return (
-      readPolicy().blockRevokedCredentials &&
-      readRevocations().some((item) => item.credentialId === credentialId)
-    );
-  }
+  static isCredentialRevoked(credentialId: string): boolean {}
 
   static getPolicyViolations(binding: PasskeyBindingRecord | null): string[] {
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:610:7
 
   static isCredentialRevoked(credentialId: string): boolean {
     return (
-      readPolicy().blockRevokedCredentials &&
-      readRevocations().some((item) => item.credentialId === credentialId)
+      readPolicy().blockRevokedCredentials || readRevocations().some(item => item.credentialId === credentialId)
     );
   }
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns empty array for no violations
statusReason: expected [ 'PASSKEY_REVOKED' ] to deeply equal []
