[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:610:7
 
   static isCredentialRevoked(credentialId: string): boolean {
     return (
-      readPolicy().blockRevokedCredentials &&
-      readRevocations().some((item) => item.credentialId === credentialId)
+      false
     );
   }
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:611:40
   static isCredentialRevoked(credentialId: string): boolean {
     return (
       readPolicy().blockRevokedCredentials &&
-      readRevocations().some((item) => item.credentialId === credentialId)
+      readRevocations().some((item) => false)
     );
   }
killedBy: PasskeyBindingService Branch Coverage Additional Method Coverage isCredentialRevoked returns true for revoked credential
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/lib/PasskeyBindingService.ts:611:7
   static isCredentialRevoked(credentialId: string): boolean {
     return (
       readPolicy().blockRevokedCredentials &&
-      readRevocations().some((item) => item.credentialId === credentialId)
+      readRevocations().every(item => item.credentialId === credentialId)
     );
   }
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns empty array for no violations
statusReason: expected [ 'PASSKEY_REVOKED' ] to deeply equal []

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:615:78
     );
   }
 
-  static getPolicyViolations(binding: PasskeyBindingRecord | null): string[] {
-    if (!binding) return [];
-    const policy = readPolicy();
-    const violations: string[] = [];
-    if (policy.blockRevokedCredentials && this.isCredentialRevoked(binding.credentialId)) {
-      violations.push('PASSKEY_REVOKED');
-    }
-    const createdAtMs = Date.parse(binding.meta.createdAt || '');
-    if (Number.isFinite(createdAtMs)) {
-      const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
-      if (ageDays >= policy.maxBindingAgeDays) {
-        violations.push('PASSKEY_ROTATION_REQUIRED');
-      }
-    }
-    if (
-      policy.requireRecoveryExportBeforeRotation &&
-      binding.meta.rotatedFromCredentialId &&
-      !binding.meta.recoveryLastExportedAt
-    ) {
-      violations.push('PASSKEY_RECOVERY_EXPORT_REQUIRED');
-    }
-    return violations;
-  }
+  static getPolicyViolations(binding: PasskeyBindingRecord | null): string[] {}
 
   static async exportRecoveryPackage(
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns empty array for no violations
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:616:9
   }
 
   static getPolicyViolations(binding: PasskeyBindingRecord | null): string[] {
-    if (!binding) return [];
+    if (false) return [];
     const policy = readPolicy();
     const violations: string[] = [];
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:616:9
   }
 
   static getPolicyViolations(binding: PasskeyBindingRecord | null): string[] {
-    if (!binding) return [];
+    if (binding) return [];
     const policy = readPolicy();
     const violations: string[] = [];
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:619:91
     if (!binding) return [];
     const policy = readPolicy();
     const violations: string[] = [];
-    if (policy.blockRevokedCredentials && this.isCredentialRevoked(binding.credentialId)) {
-      violations.push('PASSKEY_REVOKED');
-    }
+    if (policy.blockRevokedCredentials && this.isCredentialRevoked(binding.credentialId)) {}
     const createdAtMs = Date.parse(binding.meta.createdAt || '');
     if (Number.isFinite(createdAtMs)) {
killedBy: PasskeyBindingService getPolicyViolations correctly identifies issues based on current policy
statusReason: expected [ 'PASSKEY_ROTATION_REQUIRED', …(1) ] to include 'PASSKEY_REVOKED'

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:619:9
     if (!binding) return [];
     const policy = readPolicy();
     const violations: string[] = [];
-    if (policy.blockRevokedCredentials && this.isCredentialRevoked(binding.credentialId)) {
+    if (policy.blockRevokedCredentials || this.isCredentialRevoked(binding.credentialId)) {
       violations.push('PASSKEY_REVOKED');
     }
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns empty array for no violations
statusReason: expected [ 'PASSKEY_REVOKED' ] to deeply equal []

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:622:36
     if (policy.blockRevokedCredentials && this.isCredentialRevoked(binding.credentialId)) {
       violations.push('PASSKEY_REVOKED');
     }
-    const createdAtMs = Date.parse(binding.meta.createdAt || '');
+    const createdAtMs = Date.parse(true);
     if (Number.isFinite(createdAtMs)) {
       const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:622:36
     if (policy.blockRevokedCredentials && this.isCredentialRevoked(binding.credentialId)) {
       violations.push('PASSKEY_REVOKED');
     }
-    const createdAtMs = Date.parse(binding.meta.createdAt || '');
+    const createdAtMs = Date.parse(binding.meta.createdAt && '');
     if (Number.isFinite(createdAtMs)) {
       const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:623:9
       violations.push('PASSKEY_REVOKED');
     }
     const createdAtMs = Date.parse(binding.meta.createdAt || '');
-    if (Number.isFinite(createdAtMs)) {
+    if (true) {
       const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
       if (ageDays >= policy.maxBindingAgeDays) {
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:623:39
       violations.push('PASSKEY_REVOKED');
     }
     const createdAtMs = Date.parse(binding.meta.createdAt || '');
-    if (Number.isFinite(createdAtMs)) {
-      const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
-      if (ageDays >= policy.maxBindingAgeDays) {
-        violations.push('PASSKEY_ROTATION_REQUIRED');
-      }
-    }
+    if (Number.isFinite(createdAtMs)) {}
     if (
       policy.requireRecoveryExportBeforeRotation &&
killedBy: PasskeyBindingService getPolicyViolations correctly identifies issues based on current policy
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] ArithmeticOperator
src/lib/PasskeyBindingService.ts:624:64
     }
     const createdAtMs = Date.parse(binding.meta.createdAt || '');
     if (Number.isFinite(createdAtMs)) {
-      const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
+      const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 / 60 * 60 * 24));
       if (ageDays >= policy.maxBindingAgeDays) {
         violations.push('PASSKEY_ROTATION_REQUIRED');
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_RECOVERY_EXPORT_REQUIRED if rotated and not exported
statusReason: expected [] to include 'PASSKEY_RECOVERY_EXPORT_REQUIRED'

[Killed] ArithmeticOperator
src/lib/PasskeyBindingService.ts:624:35
     }
     const createdAtMs = Date.parse(binding.meta.createdAt || '');
     if (Number.isFinite(createdAtMs)) {
-      const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
+      const ageDays = Math.floor((Date.now() + createdAtMs) / (1000 * 60 * 60 * 24));
       if (ageDays >= policy.maxBindingAgeDays) {
         violations.push('PASSKEY_ROTATION_REQUIRED');
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns empty array for no violations
statusReason: expected [ 'PASSKEY_ROTATION_REQUIRED' ] to deeply equal []

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:625:11
     const createdAtMs = Date.parse(binding.meta.createdAt || '');
     if (Number.isFinite(createdAtMs)) {
       const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
-      if (ageDays >= policy.maxBindingAgeDays) {
+      if (true) {
         violations.push('PASSKEY_ROTATION_REQUIRED');
       }
killedBy: PasskeyBindingService getPolicyViolations correctly identifies issues based on current policy
statusReason: expected [ 'PASSKEY_ROTATION_REQUIRED' ] to deeply equal []

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:625:48
     const createdAtMs = Date.parse(binding.meta.createdAt || '');
     if (Number.isFinite(createdAtMs)) {
       const ageDays = Math.floor((Date.now() - createdAtMs) / (1000 * 60 * 60 * 24));
-      if (ageDays >= policy.maxBindingAgeDays) {
-        violations.push('PASSKEY_ROTATION_REQUIRED');
-      }
+      if (ageDays >= policy.maxBindingAgeDays) {}
     }
     if (
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_ROTATION_REQUIRED if older than maxBindingAgeDays
statusReason: expected [] to include 'PASSKEY_ROTATION_REQUIRED'

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:630:7
       }
     }
     if (
-      policy.requireRecoveryExportBeforeRotation &&
-      binding.meta.rotatedFromCredentialId &&
+      policy.requireRecoveryExportBeforeRotation || binding.meta.rotatedFromCredentialId &&
       !binding.meta.recoveryLastExportedAt
     ) {
killedBy: PasskeyBindingService getPolicyViolations correctly identifies issues based on current policy
statusReason: expected [ 'PASSKEY_RECOVERY_EXPORT_REQUIRED' ] to deeply equal []

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:630:7
       }
     }
     if (
-      policy.requireRecoveryExportBeforeRotation &&
-      binding.meta.rotatedFromCredentialId &&
-      !binding.meta.recoveryLastExportedAt
+      policy.requireRecoveryExportBeforeRotation && binding.meta.rotatedFromCredentialId || !binding.meta.recoveryLastExportedAt
     ) {
       violations.push('PASSKEY_RECOVERY_EXPORT_REQUIRED');
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns empty array for no violations
statusReason: expected [ 'PASSKEY_RECOVERY_EXPORT_REQUIRED' ] to deeply equal []

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:632:7
     if (
       policy.requireRecoveryExportBeforeRotation &&
       binding.meta.rotatedFromCredentialId &&
-      !binding.meta.recoveryLastExportedAt
+      binding.meta.recoveryLastExportedAt
     ) {
       violations.push('PASSKEY_RECOVERY_EXPORT_REQUIRED');
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_RECOVERY_EXPORT_REQUIRED if rotated and not exported
statusReason: expected [] to include 'PASSKEY_RECOVERY_EXPORT_REQUIRED'

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:633:7
       policy.requireRecoveryExportBeforeRotation &&
       binding.meta.rotatedFromCredentialId &&
       !binding.meta.recoveryLastExportedAt
-    ) {
-      violations.push('PASSKEY_RECOVERY_EXPORT_REQUIRED');
-    }
+    ) {}
     return violations;
   }
killedBy: PasskeyBindingService Branch Coverage Policy Violations returns PASSKEY_RECOVERY_EXPORT_REQUIRED if rotated and not exported
statusReason: expected [] to include 'PASSKEY_RECOVERY_EXPORT_REQUIRED'

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:643:22
     profileId: string | null,
     dbName: string,
     password: string
-  ): Promise<string> {
-    const binding = this.getBinding(profileId, dbName);
-    if (!binding) throw new Error('NO_PASSKEY_BINDING');
-
-    const pkg: RecoveryPackage = {
-      kind: 'aegis-passkey-recovery-v2',
-      binding,
-      revocations: readRevocations(),
-      policy: readPolicy(),
-    };
-    const encrypted = await BackupService.encryptBackup([pkg], password);
-    this.noteRecoveryExport(profileId, dbName);
-    return encrypted;
-  }
+  ): Promise<string> {}
 
   static async importRecoveryPackage(
killedBy: PasskeyBindingService Branch Coverage Export Recovery Package throws NO_PASSKEY_BINDING if no binding exists
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:645:9
     password: string
   ): Promise<string> {
     const binding = this.getBinding(profileId, dbName);
-    if (!binding) throw new Error('NO_PASSKEY_BINDING');
+    if (true) throw new Error('NO_PASSKEY_BINDING');
 
     const pkg: RecoveryPackage = {
killedBy: PasskeyBindingService Branch Coverage Export Recovery Package exports a valid recovery package for an existing binding
statusReason: NO_PASSKEY_BINDING

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:645:9
     password: string
   ): Promise<string> {
     const binding = this.getBinding(profileId, dbName);
-    if (!binding) throw new Error('NO_PASSKEY_BINDING');
+    if (false) throw new Error('NO_PASSKEY_BINDING');
 
     const pkg: RecoveryPackage = {
killedBy: PasskeyBindingService Branch Coverage Export Recovery Package throws NO_PASSKEY_BINDING if no binding exists
statusReason: promise resolved "'encrypted-pkg-data'" instead of rejecting

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:665:36
     expectedDbName: string
   ): Promise<void> {
     const payload = await BackupService.decryptBackup(encryptedPackage, password);
-    if (!Array.isArray(payload) || payload.length === 0)
+    if (!Array.isArray(payload) || false)
       throw new Error('INVALID_RECOVERY_PACKAGE');
 
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:665:36
     expectedDbName: string
   ): Promise<void> {
     const payload = await BackupService.decryptBackup(encryptedPackage, password);
-    if (!Array.isArray(payload) || payload.length === 0)
+    if (!Array.isArray(payload) || payload.length !== 0)
       throw new Error('INVALID_RECOVERY_PACKAGE');
 
killedBy: PasskeyBindingService handles partial binding records and normalizes state
statusReason: INVALID_RECOVERY_PACKAGE

[Killed] StringLiteral
src/lib/PasskeyBindingService.ts:666:23
   ): Promise<void> {
     const payload = await BackupService.decryptBackup(encryptedPackage, password);
     if (!Array.isArray(payload) || payload.length === 0)
-      throw new Error('INVALID_RECOVERY_PACKAGE');
+      throw new Error("");
 
     const pkg = payload[0] as RecoveryPackage;
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws INVALID_RECOVERY_PACKAGE if payload is empty array
statusReason: expected [Function] to throw error including 'INVALID_RECOVERY_PACKAGE' but got ''

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:669:17
       throw new Error('INVALID_RECOVERY_PACKAGE');
 
     const pkg = payload[0] as RecoveryPackage;
-    if (!pkg || pkg.kind !== 'aegis-passkey-recovery-v2' || !pkg.binding) {
+    if (!pkg || false || !pkg.binding) {
       throw new Error('INVALID_RECOVERY_PACKAGE');
     }
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws INVALID_RECOVERY_PACKAGE if kind is wrong
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:669:9
       throw new Error('INVALID_RECOVERY_PACKAGE');
 
     const pkg = payload[0] as RecoveryPackage;
-    if (!pkg || pkg.kind !== 'aegis-passkey-recovery-v2' || !pkg.binding) {
+    if ((!pkg || pkg.kind !== 'aegis-passkey-recovery-v2') && !pkg.binding) {
       throw new Error('INVALID_RECOVERY_PACKAGE');
     }
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws INVALID_RECOVERY_PACKAGE if kind is wrong
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:673:18
       throw new Error('INVALID_RECOVERY_PACKAGE');
     }
 
-    const meta = pkg.binding.meta || ({} as PasskeyBindingMeta);
+    const meta = true;
     if (meta.profileId && meta.profileId !== expectedProfileId) {
       throw new Error('RECOVERY_PROFILE_MISMATCH');
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws RECOVERY_PROFILE_MISMATCH if profileId does not match
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/lib/PasskeyBindingService.ts:673:18
       throw new Error('INVALID_RECOVERY_PACKAGE');
     }
 
-    const meta = pkg.binding.meta || ({} as PasskeyBindingMeta);
+    const meta = pkg.binding.meta && {} as PasskeyBindingMeta;
     if (meta.profileId && meta.profileId !== expectedProfileId) {
       throw new Error('RECOVERY_PROFILE_MISMATCH');
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws RECOVERY_PROFILE_MISMATCH if profileId does not match
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:674:9
     }
 
     const meta = pkg.binding.meta || ({} as PasskeyBindingMeta);
-    if (meta.profileId && meta.profileId !== expectedProfileId) {
+    if (false) {
       throw new Error('RECOVERY_PROFILE_MISMATCH');
     }
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws RECOVERY_PROFILE_MISMATCH if profileId does not match
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:674:27
     }
 
     const meta = pkg.binding.meta || ({} as PasskeyBindingMeta);
-    if (meta.profileId && meta.profileId !== expectedProfileId) {
+    if (meta.profileId && meta.profileId === expectedProfileId) {
       throw new Error('RECOVERY_PROFILE_MISMATCH');
     }
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws RECOVERY_PROFILE_MISMATCH if profileId does not match
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/lib/PasskeyBindingService.ts:675:23
 
     const meta = pkg.binding.meta || ({} as PasskeyBindingMeta);
     if (meta.profileId && meta.profileId !== expectedProfileId) {
-      throw new Error('RECOVERY_PROFILE_MISMATCH');
+      throw new Error("");
     }
     if (meta.dbName && meta.dbName !== expectedDbName) {
killedBy: PasskeyBindingService Branch Coverage Import error blocks throws RECOVERY_PROFILE_MISMATCH if profileId does not match
statusReason: expected [Function] to throw error including 'RECOVERY_PROFILE_MISMATCH' but got ''

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:677:9
     if (meta.profileId && meta.profileId !== expectedProfileId) {
       throw new Error('RECOVERY_PROFILE_MISMATCH');
     }
-    if (meta.dbName && meta.dbName !== expectedDbName) {
+    if (true) {
       throw new Error('RECOVERY_DB_MISMATCH');
     }
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: RECOVERY_DB_MISMATCH

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:677:24
     if (meta.profileId && meta.profileId !== expectedProfileId) {
       throw new Error('RECOVERY_PROFILE_MISMATCH');
     }
-    if (meta.dbName && meta.dbName !== expectedDbName) {
+    if (meta.dbName && true) {
       throw new Error('RECOVERY_DB_MISMATCH');
     }
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: RECOVERY_DB_MISMATCH

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:693:9
     });
     const key = profileKey(expectedProfileId, expectedDbName);
     const map = readBindingMap();
-    if (Array.isArray(pkg.revocations)) {
+    if (false) {
       const merged = [...readRevocations(), ...pkg.revocations].reduce<PasskeyRevocationRecord[]>(
         (acc, item) => {
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:693:9
     });
     const key = profileKey(expectedProfileId, expectedDbName);
     const map = readBindingMap();
-    if (Array.isArray(pkg.revocations)) {
+    if (true) {
       const merged = [...readRevocations(), ...pkg.revocations].reduce<PasskeyRevocationRecord[]>(
         (acc, item) => {
killedBy: PasskeyBindingService handles partial binding records and normalizes state
statusReason: pkg.revocations is not iterable

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:695:24
     const map = readBindingMap();
     if (Array.isArray(pkg.revocations)) {
       const merged = [...readRevocations(), ...pkg.revocations].reduce<PasskeyRevocationRecord[]>(
-        (acc, item) => {
-          if (
-            !acc.some(
-              (existing) =>
-                existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt
-            )
-          ) {
-            acc.push(item);
-          }
-          return acc;
-        },
+        (acc, item) => {},
         []
       );
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:697:13
       const merged = [...readRevocations(), ...pkg.revocations].reduce<PasskeyRevocationRecord[]>(
         (acc, item) => {
           if (
-            !acc.some(
-              (existing) =>
-                existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt
-            )
+            true
           ) {
             acc.push(item);
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] BooleanLiteral
src/lib/PasskeyBindingService.ts:697:13
       const merged = [...readRevocations(), ...pkg.revocations].reduce<PasskeyRevocationRecord[]>(
         (acc, item) => {
           if (
-            !acc.some(
-              (existing) =>
-                existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt
-            )
+            acc.some(existing => existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt)
           ) {
             acc.push(item);
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:698:15
         (acc, item) => {
           if (
             !acc.some(
-              (existing) =>
-                existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt
+              () => undefined
             )
           ) {
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[NoCoverage] ConditionalExpression
src/lib/PasskeyBindingService.ts:699:17
           if (
             !acc.some(
               (existing) =>
-                existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt
+                true
             )
           ) {

[NoCoverage] ConditionalExpression
src/lib/PasskeyBindingService.ts:699:17
           if (
             !acc.some(
               (existing) =>
-                existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt
+                true && existing.revokedAt === item.revokedAt
             )
           ) {

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:701:13
               (existing) =>
                 existing.credentialId === item.credentialId && existing.revokedAt === item.revokedAt
             )
-          ) {
-            acc.push(item);
-          }
+          ) {}
           return acc;
         },
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] ArrayDeclaration
src/lib/PasskeyBindingService.ts:706:9
           }
           return acc;
         },
-        []
+        ["Stryker was here"]
       );
       writeRevocations(merged);
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:710:9
       );
       writeRevocations(merged);
     }
-    if (pkg.policy) {
+    if (true) {
       writePolicy({
         ...readPolicy(),
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:710:21
       );
       writeRevocations(merged);
     }
-    if (pkg.policy) {
-      writePolicy({
-        ...readPolicy(),
-        ...pkg.policy,
-      });
-    }
+    if (pkg.policy) {}
     if (map[key]) {
       appendEvent(map, key, {
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:716:9
         ...pkg.policy,
       });
     }
-    if (map[key]) {
+    if (true) {
       appendEvent(map, key, {
         at: new Date().toISOString(),
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: Cannot read properties of undefined (reading 'credentialId')

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:716:19
         ...pkg.policy,
       });
     }
-    if (map[key]) {
-      appendEvent(map, key, {
-        at: new Date().toISOString(),
-        type: 'recovery_imported',
-        profileId: expectedProfileId,
-        dbName: expectedDbName,
-        credentialId: map[key].credentialId,
-        deviceFingerprint: map[key].meta.deviceFingerprint,
-        detail: 'Recovery package imported for active vault profile.',
-      });
-      writeBindingMap(map);
-    }
+    if (map[key]) {}
   }
 
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:717:29
       });
     }
     if (map[key]) {
-      appendEvent(map, key, {
-        at: new Date().toISOString(),
-        type: 'recovery_imported',
-        profileId: expectedProfileId,
-        dbName: expectedDbName,
-        credentialId: map[key].credentialId,
-        deviceFingerprint: map[key].meta.deviceFingerprint,
-        detail: 'Recovery package imported for active vault profile.',
-      });
+      appendEvent(map, key, {});
       writeBindingMap(map);
     }
killedBy: PasskeyBindingService Branch Coverage Import error blocks successfully imports a valid recovery package with revocations and policy
statusReason: expected null not to be null

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:738:17
     entry: VaultEntry,
     credentialId: string,
     rpId: string
-  ): VaultEntry {
-    const now = new Date().toISOString();
-    return {
-      ...entry,
-      passkeyMetadata: {
-        ...(entry.passkeyMetadata || {}),
-        credential_id: credentialId,
-        rp_id: rpId,
-        mode: 'site_passkey_active',
-        created_at: entry.passkeyMetadata?.created_at || now,
-        last_registration_at: now,
-      },
-    };
-  }
+  ): VaultEntry {}
 
   /**
killedBy: PasskeyBindingService Branch Coverage Static Methods bindSiteCredentialToEntry updates vault entry with passkey metadata
statusReason: Cannot read properties of undefined (reading 'passkeyMetadata')
