[Killed] ObjectLiteral
src/lib/PasskeyBindingService.ts:742:24
     const now = new Date().toISOString();
     return {
       ...entry,
-      passkeyMetadata: {
-        ...(entry.passkeyMetadata || {}),
-        credential_id: credentialId,
-        rp_id: rpId,
-        mode: 'site_passkey_active',
-        created_at: entry.passkeyMetadata?.created_at || now,
-        last_registration_at: now,
-      },
+      passkeyMetadata: {},
     };
   }
killedBy: PasskeyBindingService Branch Coverage Static Methods bindSiteCredentialToEntry updates vault entry with passkey metadata
statusReason: expected undefined to be 'cred-123' // Object.is equality

[Survived] LogicalOperator
src/lib/PasskeyBindingService.ts:743:13
     return {
       ...entry,
       passkeyMetadata: {
-        ...(entry.passkeyMetadata || {}),
+        ...(entry.passkeyMetadata && {}),
         credential_id: credentialId,
         rp_id: rpId,

[Survived] ConditionalExpression
src/lib/PasskeyBindingService.ts:743:13
     return {
       ...entry,
       passkeyMetadata: {
-        ...(entry.passkeyMetadata || {}),
+        ...(true),
         credential_id: credentialId,
         rp_id: rpId,

[Killed] StringLiteral
src/lib/PasskeyBindingService.ts:746:15
         ...(entry.passkeyMetadata || {}),
         credential_id: credentialId,
         rp_id: rpId,
-        mode: 'site_passkey_active',
+        mode: "",
         created_at: entry.passkeyMetadata?.created_at || now,
         last_registration_at: now,
killedBy: PasskeyBindingService Branch Coverage Static Methods bindSiteCredentialToEntry updates vault entry with passkey metadata
statusReason: expected '' to be 'site_passkey_active' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:747:21
         credential_id: credentialId,
         rp_id: rpId,
         mode: 'site_passkey_active',
-        created_at: entry.passkeyMetadata?.created_at || now,
+        created_at: true,
         last_registration_at: now,
       },
killedBy: PasskeyBindingService Branch Coverage Static Methods bindSiteCredentialToEntry updates vault entry with passkey metadata
statusReason: expected true to be '2026-01-01T00:00:00.000Z' // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:747:21
         credential_id: credentialId,
         rp_id: rpId,
         mode: 'site_passkey_active',
-        created_at: entry.passkeyMetadata?.created_at || now,
+        created_at: false,
         last_registration_at: now,
       },
killedBy: PasskeyBindingService Branch Coverage Static Methods bindSiteCredentialToEntry updates vault entry with passkey metadata
statusReason: expected false to be '2026-01-01T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:757:80
    * Merges an external list of revocations into the local store.
    * Used by QR Sync and future encrypted sync to propagate revocation intent.
    */
-  static mergeExternalRevocations(external: PasskeyRevocationRecord[]): number {
-    const local = readRevocations();
-    const map = new Map<string, PasskeyRevocationRecord>();
-    let changedCount = 0;
-
-    local.forEach((rev) => map.set(rev.credentialId, rev));
-
-    external.forEach((rev) => {
-      const existing = map.get(rev.credentialId);
-      if (!existing || Date.parse(rev.revokedAt) > Date.parse(existing.revokedAt)) {
-        map.set(rev.credentialId, rev);
-        changedCount++;
-      }
-    });
-
-    if (changedCount > 0) {
-      writeRevocations(Array.from(map.values()));
-    }
-
-    return changedCount;
-  }
+  static mergeExternalRevocations(external: PasskeyRevocationRecord[]): number {}
 }
 
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArrowFunction
src/lib/PasskeyBindingService.ts:762:19
     const map = new Map<string, PasskeyRevocationRecord>();
     let changedCount = 0;
 
-    local.forEach((rev) => map.set(rev.credentialId, rev));
+    local.forEach(() => undefined);
 
     external.forEach((rev) => {
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations skips older external revocations
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:764:31
 
     local.forEach((rev) => map.set(rev.credentialId, rev));
 
-    external.forEach((rev) => {
-      const existing = map.get(rev.credentialId);
-      if (!existing || Date.parse(rev.revokedAt) > Date.parse(existing.revokedAt)) {
-        map.set(rev.credentialId, rev);
-        changedCount++;
-      }
-    });
+    external.forEach((rev) => {});
 
     if (changedCount > 0) {
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:766:11
 
     external.forEach((rev) => {
       const existing = map.get(rev.credentialId);
-      if (!existing || Date.parse(rev.revokedAt) > Date.parse(existing.revokedAt)) {
+      if (true) {
         map.set(rev.credentialId, rev);
         changedCount++;
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations skips older external revocations
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/PasskeyBindingService.ts:766:11
 
     external.forEach((rev) => {
       const existing = map.get(rev.credentialId);
-      if (!existing || Date.parse(rev.revokedAt) > Date.parse(existing.revokedAt)) {
+      if (false) {
         map.set(rev.credentialId, rev);
         changedCount++;
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: expected +0 to be 2 // Object.is equality

[Killed] UpdateOperator
src/lib/PasskeyBindingService.ts:768:9
       const existing = map.get(rev.credentialId);
       if (!existing || Date.parse(rev.revokedAt) > Date.parse(existing.revokedAt)) {
         map.set(rev.credentialId, rev);
-        changedCount++;
+        changedCount--;
       }
     });
killedBy: PasskeyBindingService Branch Coverage Static Methods mergeExternalRevocations merges new revocations keeping newest
statusReason: expected -2 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/PasskeyBindingService.ts:772:27
       }
     });
 
-    if (changedCount > 0) {
-      writeRevocations(Array.from(map.values()));
-    }
+    if (changedCount > 0) {}
 
     return changedCount;
killedBy: PasskeyBindingService merges external revocations and returns count
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/PasskeyBindingService.ts:772:9
       }
     });
 
-    if (changedCount > 0) {
+    if (changedCount <= 0) {
       writeRevocations(Array.from(map.values()));
     }
killedBy: PasskeyBindingService merges external revocations and returns count
statusReason: expected false to be true // Object.is equality
