[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:38:44
 // ─────────────────────────────────────────────────────────────────
 
 /** OPFS kullanılabilir mi? */
-export function isOPFSAvailable(): boolean {
-  return (
-    typeof navigator !== 'undefined' &&
-    'storage' in navigator &&
-    'getDirectory' in navigator.storage
-  );
-}
+export function isOPFSAvailable(): boolean {}
 
 /** OPFS'den dosya oku (yoksa null döner) */
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/lib/SQLiteOPFS.ts:40:5
 /** OPFS kullanılabilir mi? */
 export function isOPFSAvailable(): boolean {
   return (
-    typeof navigator !== 'undefined' &&
-    'storage' in navigator &&
-    'getDirectory' in navigator.storage
+    typeof navigator !== 'undefined' && 'storage' in navigator || 'getDirectory' in navigator.storage
   );
 }
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/lib/SQLiteOPFS.ts:40:5
 /** OPFS kullanılabilir mi? */
 export function isOPFSAvailable(): boolean {
   return (
-    typeof navigator !== 'undefined' &&
-    'storage' in navigator &&
+    typeof navigator !== 'undefined' || 'storage' in navigator &&
     'getDirectory' in navigator.storage
   );
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: navigator is not defined

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:42:5
   return (
     typeof navigator !== 'undefined' &&
     'storage' in navigator &&
-    'getDirectory' in navigator.storage
+    "" in navigator.storage
   );
 }
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/lib/SQLiteOPFS.ts:47:75
 }
 
 /** OPFS'den dosya oku (yoksa null döner) */
-async function readOPFSFile(filename: string): Promise<Uint8Array | null> {
-  try {
-    const root = await navigator.storage.getDirectory();
-    const fileHandle = await root.getFileHandle(filename);
-    const file = await fileHandle.getFile();
-    const buffer = await file.arrayBuffer();
-    return new Uint8Array(buffer);
-  } catch {
-    return null; // Dosya bulunamadı
-  }
-}
+async function readOPFSFile(filename: string): Promise<Uint8Array | null> {}
 
 /** OPFS'ye dosya yaz */

[Survived] BlockStatement
src/lib/SQLiteOPFS.ts:48:7
 
 /** OPFS'den dosya oku (yoksa null döner) */
 async function readOPFSFile(filename: string): Promise<Uint8Array | null> {
-  try {
-    const root = await navigator.storage.getDirectory();
-    const fileHandle = await root.getFileHandle(filename);
-    const file = await fileHandle.getFile();
-    const buffer = await file.arrayBuffer();
-    return new Uint8Array(buffer);
-  } catch {
+  try {} catch {
     return null; // Dosya bulunamadı
   }

[Survived] BlockStatement
src/lib/SQLiteOPFS.ts:54:11
     const file = await fileHandle.getFile();
     const buffer = await file.arrayBuffer();
     return new Uint8Array(buffer);
-  } catch {
-    return null; // Dosya bulunamadı
-  }
+  } catch {}
 }
 

[Survived] BlockStatement
src/lib/SQLiteOPFS.ts:60:81
 }
 
 /** OPFS'ye dosya yaz */
-async function writeOPFSFile(filename: string, data: Uint8Array): Promise<void> {
-  const root = await navigator.storage.getDirectory();
-  const fileHandle = await root.getFileHandle(filename, { create: true });
-  const writable = await fileHandle.createWritable();
-  await writable.write(new Blob([Uint8Array.from(data)]));
-  await writable.close();
-}
+async function writeOPFSFile(filename: string, data: Uint8Array): Promise<void> {}
 
 /** OPFS'den dosya sil */

[Survived] BooleanLiteral
src/lib/SQLiteOPFS.ts:62:67
 /** OPFS'ye dosya yaz */
 async function writeOPFSFile(filename: string, data: Uint8Array): Promise<void> {
   const root = await navigator.storage.getDirectory();
-  const fileHandle = await root.getFileHandle(filename, { create: true });
+  const fileHandle = await root.getFileHandle(filename, { create: false });
   const writable = await fileHandle.createWritable();
   await writable.write(new Blob([Uint8Array.from(data)]));

[Survived] ArrayDeclaration
src/lib/SQLiteOPFS.ts:64:33
   const root = await navigator.storage.getDirectory();
   const fileHandle = await root.getFileHandle(filename, { create: true });
   const writable = await fileHandle.createWritable();
-  await writable.write(new Blob([Uint8Array.from(data)]));
+  await writable.write(new Blob([]));
   await writable.close();
 }

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:69:71
 }
 
 /** OPFS'den dosya sil */
-export async function deleteOPFSFile(filename: string): Promise<void> {
-  try {
-    const root = await navigator.storage.getDirectory();
-    await root.removeEntry(filename);
-  } catch {
-    // Dosya zaten yok
-  }
-}
+export async function deleteOPFSFile(filename: string): Promise<void> {}
 
 /** TÜM OPFS dosyalarını sil (Fabrika Ayarları için) */
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-a.sqlite' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:70:7
 
 /** OPFS'den dosya sil */
 export async function deleteOPFSFile(filename: string): Promise<void> {
-  try {
-    const root = await navigator.storage.getDirectory();
-    await root.removeEntry(filename);
-  } catch {
+  try {} catch {
     // Dosya zaten yok
   }
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-a.sqlite' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:79:58
 }
 
 /** TÜM OPFS dosyalarını sil (Fabrika Ayarları için) */
-export async function clearAllOPFSFiles(): Promise<void> {
-  if (!isOPFSAvailable()) return;
-  try {
-    const root = await navigator.storage.getDirectory();
-    // @ts-expect-error entries async iterator is not modeled on all TS lib versions
-    for await (const [name] of root.entries()) {
-      if (name.endsWith('.sqlite')) {
-        await root.removeEntry(name);
-        console.log(`[OPFS] Silindi: ${name}`);
-      }
-    }
-  } catch (error) {
-    console.warn('[OPFS] Toplu silme hatası:', error);
-  }
-}
+export async function clearAllOPFSFiles(): Promise<void> {}
 
 // ─────────────────────────────────────────────────────────────────
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-b.sqlite' ]

Received: 

  1st vi.fn() call:

  [
-   "vault-b.sqlite",

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:80:7
 
 /** TÜM OPFS dosyalarını sil (Fabrika Ayarları için) */
 export async function clearAllOPFSFiles(): Promise<void> {
-  if (!isOPFSAvailable()) return;
+  if (isOPFSAvailable()) return;
   try {
     const root = await navigator.storage.getDirectory();
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-b.sqlite' ]

Received: 

  1st vi.fn() call:

  [
-   "vault-b.sqlite",

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:80:7
 
 /** TÜM OPFS dosyalarını sil (Fabrika Ayarları için) */
 export async function clearAllOPFSFiles(): Promise<void> {
-  if (!isOPFSAvailable()) return;
+  if (true) return;
   try {
     const root = await navigator.storage.getDirectory();
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-b.sqlite' ]

Received: 

  1st vi.fn() call:

  [
-   "vault-b.sqlite",

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:81:7
 /** TÜM OPFS dosyalarını sil (Fabrika Ayarları için) */
 export async function clearAllOPFSFiles(): Promise<void> {
   if (!isOPFSAvailable()) return;
-  try {
-    const root = await navigator.storage.getDirectory();
-    // @ts-expect-error entries async iterator is not modeled on all TS lib versions
-    for await (const [name] of root.entries()) {
-      if (name.endsWith('.sqlite')) {
-        await root.removeEntry(name);
-        console.log(`[OPFS] Silindi: ${name}`);
-      }
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.warn('[OPFS] Toplu silme hatası:', error);
   }
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-b.sqlite' ]

Received: 

  1st vi.fn() call:

  [
-   "vault-b.sqlite",

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:84:48
   try {
     const root = await navigator.storage.getDirectory();
     // @ts-expect-error entries async iterator is not modeled on all TS lib versions
-    for await (const [name] of root.entries()) {
-      if (name.endsWith('.sqlite')) {
-        await root.removeEntry(name);
-        console.log(`[OPFS] Silindi: ${name}`);
-      }
-    }
+    for await (const [name] of root.entries()) {}
   } catch (error) {
     console.warn('[OPFS] Toplu silme hatası:', error);
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-b.sqlite' ]

Received: 

  1st vi.fn() call:

  [
-   "vault-b.sqlite",

[Killed] MethodExpression
src/lib/SQLiteOPFS.ts:85:11
     const root = await navigator.storage.getDirectory();
     // @ts-expect-error entries async iterator is not modeled on all TS lib versions
     for await (const [name] of root.entries()) {
-      if (name.endsWith('.sqlite')) {
+      if (name.startsWith('.sqlite')) {
         await root.removeEntry(name);
         console.log(`[OPFS] Silindi: ${name}`);
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to be called with arguments: [ 'vault-b.sqlite' ]

Received: 

  1st vi.fn() call:

  [
-   "vault-b.sqlite",

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:85:11
     const root = await navigator.storage.getDirectory();
     // @ts-expect-error entries async iterator is not modeled on all TS lib versions
     for await (const [name] of root.entries()) {
-      if (name.endsWith('.sqlite')) {
+      if (true) {
         await root.removeEntry(name);
         console.log(`[OPFS] Silindi: ${name}`);
killedBy: SQLiteOPFS reports OPFS availability and handles file deletion helpers
statusReason: expected "vi.fn()" to not be called with arguments: [ 'notes.txt' ]

Received: 

  1st vi.fn() call:

  [
-   "notes.txt",

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:87:21
     for await (const [name] of root.entries()) {
       if (name.endsWith('.sqlite')) {
         await root.removeEntry(name);
-        console.log(`[OPFS] Silindi: ${name}`);
+        console.log(``);
       }
     }

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:90:19
         console.log(`[OPFS] Silindi: ${name}`);
       }
     }
-  } catch (error) {
-    console.warn('[OPFS] Toplu silme hatası:', error);
-  }
+  } catch (error) {}
 }
 
killedBy: SQLiteOPFS handles OPFS API failure during clearAllOPFSFiles
statusReason: expected "warn" to be called with arguments: [ '[OPFS] Toplu silme hatası:', …(1) ]

Number of calls: 0

[Survived] BooleanLiteral
src/lib/SQLiteOPFS.ts:166:21
   private db: Database | null = null;
   private dbFilename: string;
   private saveTimeout: ReturnType<typeof setTimeout> | null = null;
-  private isDirty = false;
+  private isDirty = true;
 
   constructor(dbName: string = 'aegis_vault') {

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:168:47
   private saveTimeout: ReturnType<typeof setTimeout> | null = null;
   private isDirty = false;
 
-  constructor(dbName: string = 'aegis_vault') {
-    this.dbFilename = `${dbName}.sqlite`;
-  }
+  constructor(dbName: string = 'aegis_vault') {}
 
   /** Veritabanını aç — OPFS'den yükle veya yeni oluştur */
killedBy: SQLiteOPFS wipeAll clears all tables and deletes the file from OPFS
statusReason: expected "vi.fn()" to be called with arguments: [ 'wipe-db.sqlite' ]

Received: 

  1st vi.fn() call:

  [
-   "wipe-db.sqlite",

[NoCoverage] StringLiteral
src/lib/SQLiteOPFS.ts:168:32
   private saveTimeout: ReturnType<typeof setTimeout> | null = null;
   private isDirty = false;
 
-  constructor(dbName: string = 'aegis_vault') {
+  constructor(dbName: string = "") {
     this.dbFilename = `${dbName}.sqlite`;
   }

[Survived] ArrowFunction
src/lib/SQLiteOPFS.ts:175:19
   /** Veritabanını aç — OPFS'den yükle veya yeni oluştur */
   async open(): Promise<void> {
     const SQL = await initSqlJs({
-      locateFile: () => sqlWasmUrl,
+      locateFile: () => undefined,
     });
 

[Killed] LogicalOperator
src/lib/SQLiteOPFS.ts:181:9
     // OPFS'den mevcut veritabanını yükle
     const existingData = await readOPFSFile(this.dbFilename);
 
-    if (existingData && existingData.length > 0) {
+    if (existingData || existingData.length > 0) {
       this.db = new SQL.Database(existingData);
       console.log(
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:181:9
     // OPFS'den mevcut veritabanını yükle
     const existingData = await readOPFSFile(this.dbFilename);
 
-    if (existingData && existingData.length > 0) {
+    if (true) {
       this.db = new SQL.Database(existingData);
       console.log(
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: Cannot read properties of null (reading 'length')

[NoCoverage] StringLiteral
src/lib/SQLiteOPFS.ts:184:9
     if (existingData && existingData.length > 0) {
       this.db = new SQL.Database(existingData);
       console.log(
-        `[SQLiteOPFS] Mevcut veritabanı OPFS'den yüklendi: ${this.dbFilename} (${existingData.length} bytes)`
+        ``
       );
     } else {

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:186:12
       console.log(
         `[SQLiteOPFS] Mevcut veritabanı OPFS'den yüklendi: ${this.dbFilename} (${existingData.length} bytes)`
       );
-    } else {
-      this.db = new SQL.Database();
-      console.log(`[SQLiteOPFS] Yeni veritabanı oluşturuldu: ${this.dbFilename}`);
-    }
+    } else {}
 
     // Şemayı uygula (IF NOT EXISTS güvenli)
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: Cannot read properties of null (reading 'run')

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:188:19
       );
     } else {
       this.db = new SQL.Database();
-      console.log(`[SQLiteOPFS] Yeni veritabanı oluşturuldu: ${this.dbFilename}`);
+      console.log(``);
     }
 

[Survived] ConditionalExpression
src/lib/SQLiteOPFS.ts:197:7
     // Eski veritabanları için eksik sütunları ekle (şema migrasyonu)
     const tableInfo = this.db.exec('PRAGMA table_info(passwords)');
     const existingCols =
-      tableInfo.length > 0
+      true
         ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
         : [];

[Survived] EqualityOperator
src/lib/SQLiteOPFS.ts:197:7
     // Eski veritabanları için eksik sütunları ekle (şema migrasyonu)
     const tableInfo = this.db.exec('PRAGMA table_info(passwords)');
     const existingCols =
-      tableInfo.length > 0
+      tableInfo.length <= 0
         ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
         : [];

[Survived] ArrowFunction
src/lib/SQLiteOPFS.ts:198:62
     const tableInfo = this.db.exec('PRAGMA table_info(passwords)');
     const existingCols =
       tableInfo.length > 0
-        ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
+        ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map(() => undefined)
         : [];
     const requiredCols: [string, string][] = [

[NoCoverage] ArrayDeclaration
src/lib/SQLiteOPFS.ts:199:11
     const existingCols =
       tableInfo.length > 0
         ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
-        : [];
+        : ["Stryker was here"];
     const requiredCols: [string, string][] = [
       ['encrypted_title', 'TEXT'],

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:202:7
         : [];
     const requiredCols: [string, string][] = [
       ['encrypted_title', 'TEXT'],
-      ['title_iv', 'TEXT'],
+      [],
       ['encrypted_username', 'TEXT'],
       ['username_iv', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:202:20
         : [];
     const requiredCols: [string, string][] = [
       ['encrypted_title', 'TEXT'],
-      ['title_iv', 'TEXT'],
+      ['title_iv', ""],
       ['encrypted_username', 'TEXT'],
       ['username_iv', 'TEXT'],

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:204:7
       ['encrypted_title', 'TEXT'],
       ['title_iv', 'TEXT'],
       ['encrypted_username', 'TEXT'],
-      ['username_iv', 'TEXT'],
+      [],
       ['encrypted_website', 'TEXT'],
       ['website_iv', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:205:7
       ['title_iv', 'TEXT'],
       ['encrypted_username', 'TEXT'],
       ['username_iv', 'TEXT'],
-      ['encrypted_website', 'TEXT'],
+      [],
       ['website_iv', 'TEXT'],
       ['encrypted_category', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:205:29
       ['title_iv', 'TEXT'],
       ['encrypted_username', 'TEXT'],
       ['username_iv', 'TEXT'],
-      ['encrypted_website', 'TEXT'],
+      ['encrypted_website', ""],
       ['website_iv', 'TEXT'],
       ['encrypted_category', 'TEXT'],

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:206:8
       ['encrypted_username', 'TEXT'],
       ['username_iv', 'TEXT'],
       ['encrypted_website', 'TEXT'],
-      ['website_iv', 'TEXT'],
+      ["", 'TEXT'],
       ['encrypted_category', 'TEXT'],
       ['category_iv', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:206:7
       ['encrypted_username', 'TEXT'],
       ['username_iv', 'TEXT'],
       ['encrypted_website', 'TEXT'],
-      ['website_iv', 'TEXT'],
+      [],
       ['encrypted_category', 'TEXT'],
       ['category_iv', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:207:30
       ['username_iv', 'TEXT'],
       ['encrypted_website', 'TEXT'],
       ['website_iv', 'TEXT'],
-      ['encrypted_category', 'TEXT'],
+      ['encrypted_category', ""],
       ['category_iv', 'TEXT'],
       ['encrypted_tags', 'TEXT'],

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:208:23
       ['encrypted_website', 'TEXT'],
       ['website_iv', 'TEXT'],
       ['encrypted_category', 'TEXT'],
-      ['category_iv', 'TEXT'],
+      ['category_iv', ""],
       ['encrypted_tags', 'TEXT'],
       ['tags_iv', 'TEXT'],

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:209:7
       ['website_iv', 'TEXT'],
       ['encrypted_category', 'TEXT'],
       ['category_iv', 'TEXT'],
-      ['encrypted_tags', 'TEXT'],
+      [],
       ['tags_iv', 'TEXT'],
       ['search_index', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:209:26
       ['website_iv', 'TEXT'],
       ['encrypted_category', 'TEXT'],
       ['category_iv', 'TEXT'],
-      ['encrypted_tags', 'TEXT'],
+      ['encrypted_tags', ""],
       ['tags_iv', 'TEXT'],
       ['search_index', 'TEXT'],

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:213:23
       ['tags_iv', 'TEXT'],
       ['search_index', 'TEXT'],
       ['deleted_at', 'TEXT'],
-      ['totp_secret', 'TEXT'],
+      ['totp_secret', ""],
       ['totp_iv', 'TEXT'],
       ['totp_issuer', 'TEXT'],

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:214:7
       ['search_index', 'TEXT'],
       ['deleted_at', 'TEXT'],
       ['totp_secret', 'TEXT'],
-      ['totp_iv', 'TEXT'],
+      [],
       ['totp_issuer', 'TEXT'],
       ['totp_algorithm', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:214:19
       ['search_index', 'TEXT'],
       ['deleted_at', 'TEXT'],
       ['totp_secret', 'TEXT'],
-      ['totp_iv', 'TEXT'],
+      ['totp_iv', ""],
       ['totp_issuer', 'TEXT'],
       ['totp_algorithm', 'TEXT'],

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:216:7
       ['totp_secret', 'TEXT'],
       ['totp_iv', 'TEXT'],
       ['totp_issuer', 'TEXT'],
-      ['totp_algorithm', 'TEXT'],
+      [],
       ['totp_digits', 'INTEGER'],
       ['totp_period', 'INTEGER'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:218:7
       ['totp_issuer', 'TEXT'],
       ['totp_algorithm', 'TEXT'],
       ['totp_digits', 'INTEGER'],
-      ['totp_period', 'INTEGER'],
+      [],
       ['encrypted_notes', 'TEXT'],
       ['notes_iv', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:219:8
       ['totp_algorithm', 'TEXT'],
       ['totp_digits', 'INTEGER'],
       ['totp_period', 'INTEGER'],
-      ['encrypted_notes', 'TEXT'],
+      ["", 'TEXT'],
       ['notes_iv', 'TEXT'],
       ['encrypted_passkey_meta', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:220:7
       ['totp_digits', 'INTEGER'],
       ['totp_period', 'INTEGER'],
       ['encrypted_notes', 'TEXT'],
-      ['notes_iv', 'TEXT'],
+      [],
       ['encrypted_passkey_meta', 'TEXT'],
       ['passkey_meta_iv', 'TEXT'],
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:226:7
       ['encrypted_card_details', 'TEXT'],
       ['card_details_iv', 'TEXT'],
       ['encrypted_identity_details', 'TEXT'],
-      ['identity_details_iv', 'TEXT'],
+      [],
     ];
     for (const [col, type] of requiredCols) {
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:226:8
       ['encrypted_card_details', 'TEXT'],
       ['card_details_iv', 'TEXT'],
       ['encrypted_identity_details', 'TEXT'],
-      ['identity_details_iv', 'TEXT'],
+      ["", 'TEXT'],
     ];
     for (const [col, type] of requiredCols) {
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:228:45
       ['encrypted_identity_details', 'TEXT'],
       ['identity_details_iv', 'TEXT'],
     ];
-    for (const [col, type] of requiredCols) {
-      if (!existingCols.includes(col)) {
-        console.warn(`[SQLiteOPFS] Migration: Adding missing column "${col}" to passwords table`);
-        this.db.run(`ALTER TABLE passwords ADD COLUMN ${col} ${type}`);
-      }
-    }
+    for (const [col, type] of requiredCols) {}
 
     // WAL modu — daha iyi eşzamanlılık
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:229:11
       ['identity_details_iv', 'TEXT'],
     ];
     for (const [col, type] of requiredCols) {
-      if (!existingCols.includes(col)) {
+      if (existingCols.includes(col)) {
         console.warn(`[SQLiteOPFS] Migration: Adding missing column "${col}" to passwords table`);
         this.db.run(`ALTER TABLE passwords ADD COLUMN ${col} ${type}`);
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:229:11
       ['identity_details_iv', 'TEXT'],
     ];
     for (const [col, type] of requiredCols) {
-      if (!existingCols.includes(col)) {
+      if (false) {
         console.warn(`[SQLiteOPFS] Migration: Adding missing column "${col}" to passwords table`);
         this.db.run(`ALTER TABLE passwords ADD COLUMN ${col} ${type}`);
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:230:22
     ];
     for (const [col, type] of requiredCols) {
       if (!existingCols.includes(col)) {
-        console.warn(`[SQLiteOPFS] Migration: Adding missing column "${col}" to passwords table`);
+        console.warn(``);
         this.db.run(`ALTER TABLE passwords ADD COLUMN ${col} ${type}`);
       }

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:236:17
     }
 
     // WAL modu — daha iyi eşzamanlılık
-    this.db.run('PRAGMA journal_mode = WAL;');
+    this.db.run("");
 
     // İlk kayıt

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:243:40
   }
 
   /** Veritabanını OPFS'ye kaydet */
-  async persistToOPFS(): Promise<void> {
-    if (!this.db) return;
-    const data = this.db.export();
-    const uint8 = new Uint8Array(data);
-    await writeOPFSFile(this.dbFilename, uint8);
-    this.isDirty = false;
-  }
+  async persistToOPFS(): Promise<void> {}
 
   /** Debounced kaydet — sık yazma işlemlerinde performans için */
killedBy: SQLiteOPFS persistToOPFS updates isDirty correctly
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:244:9
 
   /** Veritabanını OPFS'ye kaydet */
   async persistToOPFS(): Promise<void> {
-    if (!this.db) return;
+    if (true) return;
     const data = this.db.export();
     const uint8 = new Uint8Array(data);
killedBy: SQLiteOPFS persistToOPFS updates isDirty correctly
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:244:9
 
   /** Veritabanını OPFS'ye kaydet */
   async persistToOPFS(): Promise<void> {
-    if (!this.db) return;
+    if (this.db) return;
     const data = this.db.export();
     const uint8 = new Uint8Array(data);
killedBy: SQLiteOPFS persistToOPFS updates isDirty correctly
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:248:20
     const data = this.db.export();
     const uint8 = new Uint8Array(data);
     await writeOPFSFile(this.dbFilename, uint8);
-    this.isDirty = false;
+    this.isDirty = true;
   }
 
killedBy: SQLiteOPFS persistToOPFS updates isDirty correctly
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:252:27
   }
 
   /** Debounced kaydet — sık yazma işlemlerinde performans için */
-  schedulePersist(): void {
-    this.isDirty = true;
-    if (this.saveTimeout) clearTimeout(this.saveTimeout);
-    this.saveTimeout = setTimeout(() => {
-      this.persistToOPFS().catch(console.error);
-    }, 500);
-  }
+  schedulePersist(): void {}
 
   /** Hemen kaydet + debounce iptal */
killedBy: SQLiteOPFS flushes, wipes and closes the database cleanly
statusReason: expected "persistToOPFS" to be called 1 times, but got 0 times

[Survived] BooleanLiteral
src/lib/SQLiteOPFS.ts:253:20
 
   /** Debounced kaydet — sık yazma işlemlerinde performans için */
   schedulePersist(): void {
-    this.isDirty = true;
+    this.isDirty = false;
     if (this.saveTimeout) clearTimeout(this.saveTimeout);
     this.saveTimeout = setTimeout(() => {

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:254:9
   /** Debounced kaydet — sık yazma işlemlerinde performans için */
   schedulePersist(): void {
     this.isDirty = true;
-    if (this.saveTimeout) clearTimeout(this.saveTimeout);
+    if (false) clearTimeout(this.saveTimeout);
     this.saveTimeout = setTimeout(() => {
       this.persistToOPFS().catch(console.error);
killedBy: SQLiteOPFS schedulePersist handles debouncing properly
statusReason: expected "persistToOPFS" to be called 1 times, but got 3 times
