[Survived] ConditionalExpression
src/lib/SQLiteOPFS.ts:254:9
   /** Debounced kaydet — sık yazma işlemlerinde performans için */
   schedulePersist(): void {
     this.isDirty = true;
-    if (this.saveTimeout) clearTimeout(this.saveTimeout);
+    if (true) clearTimeout(this.saveTimeout);
     this.saveTimeout = setTimeout(() => {
       this.persistToOPFS().catch(console.error);

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:255:41
   schedulePersist(): void {
     this.isDirty = true;
     if (this.saveTimeout) clearTimeout(this.saveTimeout);
-    this.saveTimeout = setTimeout(() => {
-      this.persistToOPFS().catch(console.error);
-    }, 500);
+    this.saveTimeout = setTimeout(() => {}, 500);
   }
 
killedBy: SQLiteOPFS flushes, wipes and closes the database cleanly
statusReason: expected "persistToOPFS" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:261:38
   }
 
   /** Hemen kaydet + debounce iptal */
-  async flushToOPFS(): Promise<void> {
-    if (this.saveTimeout) {
-      clearTimeout(this.saveTimeout);
-      this.saveTimeout = null;
-    }
-    if (this.isDirty) {
-      await this.persistToOPFS();
-    }
-  }
+  async flushToOPFS(): Promise<void> {}
 
   // ─── Passwords CRUD ───
killedBy: SQLiteOPFS flushToOPFS logic for timeout and dirty state
statusReason: expected { Object (_idleTimeout, _idlePrev, ...) } to be null

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:262:27
 
   /** Hemen kaydet + debounce iptal */
   async flushToOPFS(): Promise<void> {
-    if (this.saveTimeout) {
-      clearTimeout(this.saveTimeout);
-      this.saveTimeout = null;
-    }
+    if (this.saveTimeout) {}
     if (this.isDirty) {
       await this.persistToOPFS();
killedBy: SQLiteOPFS flushToOPFS logic for timeout and dirty state
statusReason: expected { Object (_idleTimeout, _idlePrev, ...) } to be null

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:262:9
 
   /** Hemen kaydet + debounce iptal */
   async flushToOPFS(): Promise<void> {
-    if (this.saveTimeout) {
+    if (false) {
       clearTimeout(this.saveTimeout);
       this.saveTimeout = null;
killedBy: SQLiteOPFS flushToOPFS logic for timeout and dirty state
statusReason: expected { Object (_idleTimeout, _idlePrev, ...) } to be null

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:266:9
       clearTimeout(this.saveTimeout);
       this.saveTimeout = null;
     }
-    if (this.isDirty) {
+    if (false) {
       await this.persistToOPFS();
     }
killedBy: SQLiteOPFS flushToOPFS logic for timeout and dirty state
statusReason: expected "persistToOPFS" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:266:9
       clearTimeout(this.saveTimeout);
       this.saveTimeout = null;
     }
-    if (this.isDirty) {
+    if (true) {
       await this.persistToOPFS();
     }
killedBy: SQLiteOPFS flushToOPFS logic for timeout and dirty state
statusReason: expected "persistToOPFS" to not be called at all, but actually been called 1 times

Received: 

  1st persistToOPFS call:

    Array []

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:274:38
   // ─── Passwords CRUD ───
 
   /** SQL değer formatla (sql.js db.run param binding çalışmadığı için inline kullanıyoruz) */
-  private sqlVal(v: unknown): string {
-    if (v === null || v === undefined) return 'NULL';
-    if (typeof v === 'number') return String(v);
-    // String: tek tırnak escape
-    return `'${String(v).replace(/'/g, "''")}'`;
-  }
+  private sqlVal(v: unknown): string {}
 
   putPassword(entry: VaultEntry | SQLitePasswordRow): void {
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected 'INSERT OR REPLACE INTO passwords \n  …' to contain '\'O\'\'Reilly\'\'s Vault\''

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:275:9
 
   /** SQL değer formatla (sql.js db.run param binding çalışmadığı için inline kullanıyoruz) */
   private sqlVal(v: unknown): string {
-    if (v === null || v === undefined) return 'NULL';
+    if (false) return 'NULL';
     if (typeof v === 'number') return String(v);
     // String: tek tırnak escape
killedBy: SQLiteOPFS handles null values correctly in sqlVal
statusReason: expected 'INSERT OR REPLACE INTO vault_metadata…' to contain 'VALUES (\'null-test\', NULL)'

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:275:9
 
   /** SQL değer formatla (sql.js db.run param binding çalışmadığı için inline kullanıyoruz) */
   private sqlVal(v: unknown): string {
-    if (v === null || v === undefined) return 'NULL';
+    if (false || v === undefined) return 'NULL';
     if (typeof v === 'number') return String(v);
     // String: tek tırnak escape
killedBy: SQLiteOPFS handles null values correctly in sqlVal
statusReason: expected 'INSERT OR REPLACE INTO vault_metadata…' to contain 'VALUES (\'null-test\', NULL)'

[Killed] EqualityOperator
src/lib/SQLiteOPFS.ts:276:9
   /** SQL değer formatla (sql.js db.run param binding çalışmadığı için inline kullanıyoruz) */
   private sqlVal(v: unknown): string {
     if (v === null || v === undefined) return 'NULL';
-    if (typeof v === 'number') return String(v);
+    if (typeof v !== 'number') return String(v);
     // String: tek tırnak escape
     return `'${String(v).replace(/'/g, "''")}'`;
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected 'INSERT OR REPLACE INTO passwords \n  …' to contain '\'O\'\'Reilly\'\'s Vault\''

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:276:9
   /** SQL değer formatla (sql.js db.run param binding çalışmadığı için inline kullanıyoruz) */
   private sqlVal(v: unknown): string {
     if (v === null || v === undefined) return 'NULL';
-    if (typeof v === 'number') return String(v);
+    if (false) return String(v);
     // String: tek tırnak escape
     return `'${String(v).replace(/'/g, "''")}'`;
killedBy: SQLiteOPFS sqlVal handles numbers correctly
statusReason: expected '\'42\'' to be '42' // Object.is equality

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:278:40
     if (v === null || v === undefined) return 'NULL';
     if (typeof v === 'number') return String(v);
     // String: tek tırnak escape
-    return `'${String(v).replace(/'/g, "''")}'`;
+    return `'${String(v).replace(/'/g, "")}'`;
   }
 
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected 'INSERT OR REPLACE INTO passwords \n  …' to contain '\'O\'\'Reilly\'\'s Vault\''

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:282:9
   }
 
   putPassword(entry: VaultEntry | SQLitePasswordRow): void {
-    if (!this.db) throw new Error('Database not open');
+    if (true) throw new Error('Database not open');
 
     const tags = JSON.stringify(entry.tags || []);
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: Database not open

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:282:9
   }
 
   putPassword(entry: VaultEntry | SQLitePasswordRow): void {
-    if (!this.db) throw new Error('Database not open');
+    if (false) throw new Error('Database not open');
 
     const tags = JSON.stringify(entry.tags || []);
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to throw error including 'Database not open' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:284:33
   putPassword(entry: VaultEntry | SQLitePasswordRow): void {
     if (!this.db) throw new Error('Database not open');
 
-    const tags = JSON.stringify(entry.tags || []);
+    const tags = JSON.stringify(false);
     const attachments = JSON.stringify(entry.attachments || []);
 
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected [] to deeply equal [ 'prod' ]

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:284:33
   putPassword(entry: VaultEntry | SQLitePasswordRow): void {
     if (!this.db) throw new Error('Database not open');
 
-    const tags = JSON.stringify(entry.tags || []);
+    const tags = JSON.stringify(true);
     const attachments = JSON.stringify(entry.attachments || []);
 
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected [] to deeply equal [ 'prod' ]

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:285:40
     if (!this.db) throw new Error('Database not open');
 
     const tags = JSON.stringify(entry.tags || []);
-    const attachments = JSON.stringify(entry.attachments || []);
+    const attachments = JSON.stringify(true);
 
     const sql = `INSERT OR REPLACE INTO passwords 
killedBy: SQLiteOPFS putPassword prevents logic mutations by asserting exact SQL fallback string
statusReason: expected 'INSERT OR REPLACE INTO passwords \n  …' to contain 'VALUES (999, \'Untitled\', NULL, NULL…'

[Killed] LogicalOperator
src/lib/SQLiteOPFS.ts:285:40
     if (!this.db) throw new Error('Database not open');
 
     const tags = JSON.stringify(entry.tags || []);
-    const attachments = JSON.stringify(entry.attachments || []);
+    const attachments = JSON.stringify(entry.attachments && []);
 
     const sql = `INSERT OR REPLACE INTO passwords 
killedBy: SQLiteOPFS putPassword prevents logic mutations by asserting exact SQL fallback string
statusReason: expected 'INSERT OR REPLACE INTO passwords \n  …' to contain 'VALUES (999, \'Untitled\', NULL, NULL…'

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:295:9
   }
 
   getAllPasswords(): SQLitePasswordRow[] {
-    if (!this.db) return [];
+    if (true) return [];
     const stmt = this.db.prepare('SELECT * FROM passwords');
     const results: SQLitePasswordRow[] = [];
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be 'O\'Reilly\'s Vault' // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:295:9
   }
 
   getAllPasswords(): SQLitePasswordRow[] {
-    if (!this.db) return [];
+    if (false) return [];
     const stmt = this.db.prepare('SELECT * FROM passwords');
     const results: SQLitePasswordRow[] = [];
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: Cannot read properties of null (reading 'prepare')

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:296:34
 
   getAllPasswords(): SQLitePasswordRow[] {
     if (!this.db) return [];
-    const stmt = this.db.prepare('SELECT * FROM passwords');
+    const stmt = this.db.prepare("");
     const results: SQLitePasswordRow[] = [];
     while (stmt.step()) {
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be 'O\'Reilly\'s Vault' // Object.is equality

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:297:42
   getAllPasswords(): SQLitePasswordRow[] {
     if (!this.db) return [];
     const stmt = this.db.prepare('SELECT * FROM passwords');
-    const results: SQLitePasswordRow[] = [];
+    const results: SQLitePasswordRow[] = ["Stryker was here"];
     while (stmt.step()) {
       const row = stmt.getAsObject() as SQLitePasswordRow;
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be 'O\'Reilly\'s Vault' // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:298:12
     if (!this.db) return [];
     const stmt = this.db.prepare('SELECT * FROM passwords');
     const results: SQLitePasswordRow[] = [];
-    while (stmt.step()) {
+    while (false) {
       const row = stmt.getAsObject() as SQLitePasswordRow;
       // JSON alanlarını parse et
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be 'O\'Reilly\'s Vault' // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:298:25
     if (!this.db) return [];
     const stmt = this.db.prepare('SELECT * FROM passwords');
     const results: SQLitePasswordRow[] = [];
-    while (stmt.step()) {
-      const row = stmt.getAsObject() as SQLitePasswordRow;
-      // JSON alanlarını parse et
-      try {
-        row.tags = JSON.parse(String(row.tags || '[]'));
-      } catch {
-        row.tags = [];
-      }
-      try {
-        row.attachments = JSON.parse(String(row.attachments || '[]'));
-      } catch {
-        row.attachments = [];
-      }
-      try {
-        row.search_index = JSON.parse(String(row.search_index || '[]'));
-      } catch {
-        row.search_index = [];
-      }
-      // deleted_at → deletedAt dönüşümü (IDB uyumluluğu)
-      if (row.deleted_at) row.deletedAt = row.deleted_at;
-      results.push(row);
-    }
+    while (stmt.step()) {}
     stmt.free();
     return results;
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be 'O\'Reilly\'s Vault' // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:301:11
     while (stmt.step()) {
       const row = stmt.getAsObject() as SQLitePasswordRow;
       // JSON alanlarını parse et
-      try {
-        row.tags = JSON.parse(String(row.tags || '[]'));
-      } catch {
+      try {} catch {
         row.tags = [];
       }
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected '["prod"]' to deeply equal [ 'prod' ]

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:302:38
       const row = stmt.getAsObject() as SQLitePasswordRow;
       // JSON alanlarını parse et
       try {
-        row.tags = JSON.parse(String(row.tags || '[]'));
+        row.tags = JSON.parse(String(false));
       } catch {
         row.tags = [];
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected false to deeply equal [ 'prod' ]

[Killed] LogicalOperator
src/lib/SQLiteOPFS.ts:302:38
       const row = stmt.getAsObject() as SQLitePasswordRow;
       // JSON alanlarını parse et
       try {
-        row.tags = JSON.parse(String(row.tags || '[]'));
+        row.tags = JSON.parse(String(row.tags && '[]'));
       } catch {
         row.tags = [];
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected [] to deeply equal [ 'prod' ]

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:303:15
       // JSON alanlarını parse et
       try {
         row.tags = JSON.parse(String(row.tags || '[]'));
-      } catch {
-        row.tags = [];
-      }
+      } catch {}
       try {
         row.attachments = JSON.parse(String(row.attachments || '[]'));
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected 'invalid-json' to deeply equal []

[Killed] ArrayDeclaration
src/lib/SQLiteOPFS.ts:304:20
       try {
         row.tags = JSON.parse(String(row.tags || '[]'));
       } catch {
-        row.tags = [];
+        row.tags = ["Stryker was here"];
       }
       try {
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:306:11
       } catch {
         row.tags = [];
       }
-      try {
-        row.attachments = JSON.parse(String(row.attachments || '[]'));
-      } catch {
+      try {} catch {
         row.attachments = [];
       }
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected '{ bad: json }' to deeply equal []

[Killed] LogicalOperator
src/lib/SQLiteOPFS.ts:307:45
         row.tags = [];
       }
       try {
-        row.attachments = JSON.parse(String(row.attachments || '[]'));
+        row.attachments = JSON.parse(String(row.attachments && '[]'));
       } catch {
         row.attachments = [];
killedBy: SQLiteOPFS getAllPasswords handles malformed JSON fields gracefully
statusReason: expected [] to deeply equal [ 'item1' ]

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:307:45
         row.tags = [];
       }
       try {
-        row.attachments = JSON.parse(String(row.attachments || '[]'));
+        row.attachments = JSON.parse(String(false));
       } catch {
         row.attachments = [];
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected false to deeply equal []

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:308:15
       }
       try {
         row.attachments = JSON.parse(String(row.attachments || '[]'));
-      } catch {
-        row.attachments = [];
-      }
+      } catch {}
       try {
         row.search_index = JSON.parse(String(row.search_index || '[]'));
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected '{ bad: json }' to deeply equal []

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:311:11
       } catch {
         row.attachments = [];
       }
-      try {
-        row.search_index = JSON.parse(String(row.search_index || '[]'));
-      } catch {
+      try {} catch {
         row.search_index = [];
       }
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected null to deeply equal []

[Killed] LogicalOperator
src/lib/SQLiteOPFS.ts:312:46
         row.attachments = [];
       }
       try {
-        row.search_index = JSON.parse(String(row.search_index || '[]'));
+        row.search_index = JSON.parse(String(row.search_index && '[]'));
       } catch {
         row.search_index = [];
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected null to deeply equal []

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:312:46
         row.attachments = [];
       }
       try {
-        row.search_index = JSON.parse(String(row.search_index || '[]'));
+        row.search_index = JSON.parse(String(false));
       } catch {
         row.search_index = [];
killedBy: SQLiteOPFS handles JSON parsing errors gracefully in getAllPasswords
statusReason: expected false to deeply equal []

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:313:15
       }
       try {
         row.search_index = JSON.parse(String(row.search_index || '[]'));
-      } catch {
-        row.search_index = [];
-      }
+      } catch {}
       // deleted_at → deletedAt dönüşümü (IDB uyumluluğu)
       if (row.deleted_at) row.deletedAt = row.deleted_at;
killedBy: SQLiteOPFS getAllPasswords handles malformed JSON fields gracefully
statusReason: expected 'corrupt' to deeply equal []

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:317:11
         row.search_index = [];
       }
       // deleted_at → deletedAt dönüşümü (IDB uyumluluğu)
-      if (row.deleted_at) row.deletedAt = row.deleted_at;
+      if (false) row.deletedAt = row.deleted_at;
       results.push(row);
     }
killedBy: SQLiteOPFS getAllPasswords handles deleted_at fallback to deletedAt
statusReason: expected undefined to be '2026-01-01' // Object.is equality

[Survived] ConditionalExpression
src/lib/SQLiteOPFS.ts:317:11
         row.search_index = [];
       }
       // deleted_at → deletedAt dönüşümü (IDB uyumluluğu)
-      if (row.deleted_at) row.deletedAt = row.deleted_at;
+      if (true) row.deletedAt = row.deleted_at;
       results.push(row);
     }

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:324:36
     return results;
   }
 
-  deletePassword(id: number): void {
-    if (!this.db) throw new Error('Database not open');
-    this.db.run(`DELETE FROM passwords WHERE id = ${id}`);
-    this.schedulePersist();
-  }
+  deletePassword(id: number): void {}
 
   updatePasswordField(id: number, field: string, value: unknown): void {
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:325:9
   }
 
   deletePassword(id: number): void {
-    if (!this.db) throw new Error('Database not open');
+    if (true) throw new Error('Database not open');
     this.db.run(`DELETE FROM passwords WHERE id = ${id}`);
     this.schedulePersist();
killedBy: SQLiteOPFS deletePassword removes the correct entry and schedules persist
statusReason: Database not open

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:325:9
   }
 
   deletePassword(id: number): void {
-    if (!this.db) throw new Error('Database not open');
+    if (false) throw new Error('Database not open');
     this.db.run(`DELETE FROM passwords WHERE id = ${id}`);
     this.schedulePersist();
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to throw error including 'Database not open' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:331:9
   }
 
   updatePasswordField(id: number, field: string, value: unknown): void {
-    if (!this.db) throw new Error('Database not open');
+    if (true) throw new Error('Database not open');
 
     // Check if the column exists — old OPFS files may lack newer columns
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: Database not open

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:331:9
   }
 
   updatePasswordField(id: number, field: string, value: unknown): void {
-    if (!this.db) throw new Error('Database not open');
+    if (false) throw new Error('Database not open');
 
     // Check if the column exists — old OPFS files may lack newer columns
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to throw error including 'Database not open' but got 'Cannot read properties of null (readi…'

[Survived] ConditionalExpression
src/lib/SQLiteOPFS.ts:336:7
     // Check if the column exists — old OPFS files may lack newer columns
     const tableInfo = this.db.exec('PRAGMA table_info(passwords)');
     const columns =
-      tableInfo.length > 0
+      true
         ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
         : [];

[Survived] EqualityOperator
src/lib/SQLiteOPFS.ts:336:7
     // Check if the column exists — old OPFS files may lack newer columns
     const tableInfo = this.db.exec('PRAGMA table_info(passwords)');
     const columns =
-      tableInfo.length > 0
+      tableInfo.length >= 0
         ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
         : [];

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:340:9
         ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
         : [];
 
-    if (!columns.includes(field)) {
+    if (false) {
       console.warn(`[SQLiteOPFS] Migration: Adding missing column "${field}" to passwords table`);
       this.db.run(`ALTER TABLE passwords ADD COLUMN ${field} TEXT`);
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected [ …(3) ] to include 'ALTER TABLE passwords ADD COLUMN note…'

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:340:9
         ? (tableInfo[0].values as SQLiteColumnInfoRow[]).map((row) => row[1])
         : [];
 
-    if (!columns.includes(field)) {
+    if (columns.includes(field)) {
       console.warn(`[SQLiteOPFS] Migration: Adding missing column "${field}" to passwords table`);
       this.db.run(`ALTER TABLE passwords ADD COLUMN ${field} TEXT`);
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected [ …(3) ] to include 'ALTER TABLE passwords ADD COLUMN note…'

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:341:20
         : [];
 
     if (!columns.includes(field)) {
-      console.warn(`[SQLiteOPFS] Migration: Adding missing column "${field}" to passwords table`);
+      console.warn(``);
       this.db.run(`ALTER TABLE passwords ADD COLUMN ${field} TEXT`);
     }

[Killed] EqualityOperator
src/lib/SQLiteOPFS.ts:347:25
 
     // Use prepared statement to avoid sql.js db.run() param binding issues
     const safeValue =
-      value === null || value === undefined ? 'NULL' : `'${String(value).replace(/'/g, "''")}'`;
+      value === null || value !== undefined ? 'NULL' : `'${String(value).replace(/'/g, "''")}'`;
     const sql = `UPDATE passwords SET ${field} = ${safeValue} WHERE id = ${id}`;
     this.db.run(sql);
killedBy: SQLiteOPFS updatePasswordField adds missing columns safely and handles undefined/null
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/SQLiteOPFS.ts:347:7
 
     // Use prepared statement to avoid sql.js db.run() param binding issues
     const safeValue =
-      value === null || value === undefined ? 'NULL' : `'${String(value).replace(/'/g, "''")}'`;
+      value !== null || value === undefined ? 'NULL' : `'${String(value).replace(/'/g, "''")}'`;
     const sql = `UPDATE passwords SET ${field} = ${safeValue} WHERE id = ${id}`;
     this.db.run(sql);
killedBy: SQLiteOPFS updatePasswordField adds missing columns safely and handles undefined/null
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/lib/SQLiteOPFS.ts:352:7
     this.db.run(sql);
     const modified = this.db.getRowsModified();
     console.log(
-      `[SQLiteOPFS] updatePasswordField id=${id} field=${field} rowsModified=${modified}`
+      ``
     );
     this.schedulePersist();

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:357:28
     this.schedulePersist();
   }
 
-  countPasswords(): number {
-    if (!this.db) return 0;
-    const result = this.db.exec('SELECT COUNT(*) as count FROM passwords');
-    return result.length > 0 ? (result[0].values[0][0] as number) : 0;
-  }
+  countPasswords(): number {}
 
   // ─── Metadata CRUD ───
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:358:9
   }
 
   countPasswords(): number {
-    if (!this.db) return 0;
+    if (false) return 0;
     const result = this.db.exec('SELECT COUNT(*) as count FROM passwords');
     return result.length > 0 ? (result[0].values[0][0] as number) : 0;
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: Cannot read properties of null (reading 'exec')

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:358:9
   }
 
   countPasswords(): number {
-    if (!this.db) return 0;
+    if (true) return 0;
     const result = this.db.exec('SELECT COUNT(*) as count FROM passwords');
     return result.length > 0 ? (result[0].values[0][0] as number) : 0;
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:360:12
   countPasswords(): number {
     if (!this.db) return 0;
     const result = this.db.exec('SELECT COUNT(*) as count FROM passwords');
-    return result.length > 0 ? (result[0].values[0][0] as number) : 0;
+    return true ? (result[0].values[0][0] as number) : 0;
   }
 
killedBy: SQLiteOPFS countPasswords handles empty result array gracefully
statusReason: Cannot read properties of undefined (reading 'values')

[Killed] EqualityOperator
src/lib/SQLiteOPFS.ts:360:12
   countPasswords(): number {
     if (!this.db) return 0;
     const result = this.db.exec('SELECT COUNT(*) as count FROM passwords');
-    return result.length > 0 ? (result[0].values[0][0] as number) : 0;
+    return result.length <= 0 ? (result[0].values[0][0] as number) : 0;
   }
 
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:365:45
 
   // ─── Metadata CRUD ───
 
-  putMetadata<T>(id: string, data: T): void {
-    if (!this.db) throw new Error('Database not open');
-    const val = data === null ? null : JSON.stringify(data);
-    this.db.run(
-      `INSERT OR REPLACE INTO vault_metadata (id, data) VALUES (${this.sqlVal(id)}, ${this.sqlVal(val)})`
-    );
-    this.schedulePersist();
-  }
+  putMetadata<T>(id: string, data: T): void {}
 
   deleteMetadata(id: string): void {
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected 'INSERT OR REPLACE INTO passwords \n  …' to contain 'Special \'\' Name'

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:366:9
   // ─── Metadata CRUD ───
 
   putMetadata<T>(id: string, data: T): void {
-    if (!this.db) throw new Error('Database not open');
+    if (false) throw new Error('Database not open');
     const val = data === null ? null : JSON.stringify(data);
     this.db.run(
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to throw error including 'Database not open' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:366:9
   // ─── Metadata CRUD ───
 
   putMetadata<T>(id: string, data: T): void {
-    if (!this.db) throw new Error('Database not open');
+    if (true) throw new Error('Database not open');
     const val = data === null ? null : JSON.stringify(data);
     this.db.run(
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: Database not open
