[Killed] EqualityOperator
src/lib/SQLiteOPFS.ts:367:17
 
   putMetadata<T>(id: string, data: T): void {
     if (!this.db) throw new Error('Database not open');
-    const val = data === null ? null : JSON.stringify(data);
+    const val = data !== null ? null : JSON.stringify(data);
     this.db.run(
       `INSERT OR REPLACE INTO vault_metadata (id, data) VALUES (${this.sqlVal(id)}, ${this.sqlVal(val)})`
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected 'INSERT OR REPLACE INTO vault_metadata…' to contain 'Special \'\' Name'

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:367:17
 
   putMetadata<T>(id: string, data: T): void {
     if (!this.db) throw new Error('Database not open');
-    const val = data === null ? null : JSON.stringify(data);
+    const val = true ? null : JSON.stringify(data);
     this.db.run(
       `INSERT OR REPLACE INTO vault_metadata (id, data) VALUES (${this.sqlVal(id)}, ${this.sqlVal(val)})`
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected 'INSERT OR REPLACE INTO vault_metadata…' to contain 'Special \'\' Name'

[Survived] BlockStatement
src/lib/SQLiteOPFS.ts:374:36
     this.schedulePersist();
   }
 
-  deleteMetadata(id: string): void {
-    if (!this.db) return;
-    this.db.run(`DELETE FROM vault_metadata WHERE id = ${this.sqlVal(id)}`);
-    this.schedulePersist();
-  }
+  deleteMetadata(id: string): void {}
 
   getMetadata<T = Record<string, unknown>>(id: string): T | null {

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:375:9
   }
 
   deleteMetadata(id: string): void {
-    if (!this.db) return;
+    if (false) return;
     this.db.run(`DELETE FROM vault_metadata WHERE id = ${this.sqlVal(id)}`);
     this.schedulePersist();
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:375:9
   }
 
   deleteMetadata(id: string): void {
-    if (!this.db) return;
+    if (this.db) return;
     this.db.run(`DELETE FROM vault_metadata WHERE id = ${this.sqlVal(id)}`);
     this.schedulePersist();
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[NoCoverage] StringLiteral
src/lib/SQLiteOPFS.ts:376:17
 
   deleteMetadata(id: string): void {
     if (!this.db) return;
-    this.db.run(`DELETE FROM vault_metadata WHERE id = ${this.sqlVal(id)}`);
+    this.db.run(``);
     this.schedulePersist();
   }

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:380:66
     this.schedulePersist();
   }
 
-  getMetadata<T = Record<string, unknown>>(id: string): T | null {
-    if (!this.db) return null;
-    const sql = `SELECT data FROM vault_metadata WHERE id = ${this.sqlVal(id)}`;
-    const resultArr = this.db.exec(sql);
-    if (resultArr.length > 0 && resultArr[0].values.length > 0) {
-      try {
-        const val = resultArr[0].values[0][0];
-        return val ? (JSON.parse(val as string) as T) : null;
-      } catch (error) {
-        console.error('[SQLiteOPFS] Metadata parse error:', error);
-        return null;
-      }
-    }
-    return null;
-  }
+  getMetadata<T = Record<string, unknown>>(id: string): T | null {}
 
   // ─── Attachments CRUD ───
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:381:9
   }
 
   getMetadata<T = Record<string, unknown>>(id: string): T | null {
-    if (!this.db) return null;
+    if (true) return null;
     const sql = `SELECT data FROM vault_metadata WHERE id = ${this.sqlVal(id)}`;
     const resultArr = this.db.exec(sql);
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:381:9
   }
 
   getMetadata<T = Record<string, unknown>>(id: string): T | null {
-    if (!this.db) return null;
+    if (this.db) return null;
     const sql = `SELECT data FROM vault_metadata WHERE id = ${this.sqlVal(id)}`;
     const resultArr = this.db.exec(sql);
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:384:9
     if (!this.db) return null;
     const sql = `SELECT data FROM vault_metadata WHERE id = ${this.sqlVal(id)}`;
     const resultArr = this.db.exec(sql);
-    if (resultArr.length > 0 && resultArr[0].values.length > 0) {
+    if (false) {
       try {
         const val = resultArr[0].values[0][0];
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/lib/SQLiteOPFS.ts:384:33
     if (!this.db) return null;
     const sql = `SELECT data FROM vault_metadata WHERE id = ${this.sqlVal(id)}`;
     const resultArr = this.db.exec(sql);
-    if (resultArr.length > 0 && resultArr[0].values.length > 0) {
+    if (resultArr.length > 0 && resultArr[0].values.length <= 0) {
       try {
         const val = resultArr[0].values[0][0];
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:385:11
     const sql = `SELECT data FROM vault_metadata WHERE id = ${this.sqlVal(id)}`;
     const resultArr = this.db.exec(sql);
     if (resultArr.length > 0 && resultArr[0].values.length > 0) {
-      try {
-        const val = resultArr[0].values[0][0];
-        return val ? (JSON.parse(val as string) as T) : null;
-      } catch (error) {
+      try {} catch (error) {
         console.error('[SQLiteOPFS] Metadata parse error:', error);
         return null;
killedBy: SQLiteOPFS stores, reads and updates password and metadata records correctly with escaping
statusReason: expected undefined to be true // Object.is equality

[Survived] BlockStatement
src/lib/SQLiteOPFS.ts:388:23
       try {
         const val = resultArr[0].values[0][0];
         return val ? (JSON.parse(val as string) as T) : null;
-      } catch (error) {
-        console.error('[SQLiteOPFS] Metadata parse error:', error);
-        return null;
-      }
+      } catch (error) {}
     }
     return null;

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:398:96
 
   // ─── Attachments CRUD ───
 
-  putAttachment(id: string, entryId: number, iv: Uint8Array, encryptedData: ArrayBuffer): void {
-    if (!this.db) throw new Error('Database not open');
-    // Attachments still use param binding since they deal with binary BLOB data
-    // that can't be safely inlined into SQL strings
-    const stmt = this.db.prepare(
-      'INSERT OR REPLACE INTO attachments (id, entry_id, iv, encrypted_data) VALUES (?, ?, ?, ?)'
-    );
-    stmt.run([id, entryId, iv, new Uint8Array(encryptedData)]);
-    stmt.free();
-    this.schedulePersist();
-  }
+  putAttachment(id: string, entryId: number, iv: Uint8Array, encryptedData: ArrayBuffer): void {}
 
   getAttachment(id: string): { iv: Uint8Array; encrypted_data: Uint8Array } | null {
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:399:9
   // ─── Attachments CRUD ───
 
   putAttachment(id: string, entryId: number, iv: Uint8Array, encryptedData: ArrayBuffer): void {
-    if (!this.db) throw new Error('Database not open');
+    if (this.db) throw new Error('Database not open');
     // Attachments still use param binding since they deal with binary BLOB data
     // that can't be safely inlined into SQL strings
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: Database not open

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:399:9
   // ─── Attachments CRUD ───
 
   putAttachment(id: string, entryId: number, iv: Uint8Array, encryptedData: ArrayBuffer): void {
-    if (!this.db) throw new Error('Database not open');
+    if (false) throw new Error('Database not open');
     // Attachments still use param binding since they deal with binary BLOB data
     // that can't be safely inlined into SQL strings
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: expected [Function] to throw error including 'Database not open' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:410:84
     this.schedulePersist();
   }
 
-  getAttachment(id: string): { iv: Uint8Array; encrypted_data: Uint8Array } | null {
-    if (!this.db) return null;
-    const stmt = this.db.prepare('SELECT iv, encrypted_data FROM attachments WHERE id = ?');
-    stmt.bind([id]);
-    let result: { iv: Uint8Array; encrypted_data: Uint8Array } | null = null;
-    if (stmt.step()) {
-      const row = stmt.getAsObject() as SQLitePasswordRow;
-      result = {
-        iv: new Uint8Array(row.iv as ArrayLike<number>),
-        encrypted_data: new Uint8Array(row.encrypted_data as ArrayLike<number>),
-      };
-    }
-    stmt.free();
-    return result;
-  }
+  getAttachment(id: string): { iv: Uint8Array; encrypted_data: Uint8Array } | null {}
 
   deleteAttachment(id: string): void {
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:411:9
   }
 
   getAttachment(id: string): { iv: Uint8Array; encrypted_data: Uint8Array } | null {
-    if (!this.db) return null;
+    if (false) return null;
     const stmt = this.db.prepare('SELECT iv, encrypted_data FROM attachments WHERE id = ?');
     stmt.bind([id]);
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: Cannot read properties of null (reading 'prepare')

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:411:9
   }
 
   getAttachment(id: string): { iv: Uint8Array; encrypted_data: Uint8Array } | null {
-    if (!this.db) return null;
+    if (true) return null;
     const stmt = this.db.prepare('SELECT iv, encrypted_data FROM attachments WHERE id = ?');
     stmt.bind([id]);
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:415:9
     const stmt = this.db.prepare('SELECT iv, encrypted_data FROM attachments WHERE id = ?');
     stmt.bind([id]);
     let result: { iv: Uint8Array; encrypted_data: Uint8Array } | null = null;
-    if (stmt.step()) {
+    if (false) {
       const row = stmt.getAsObject() as SQLitePasswordRow;
       result = {
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:415:9
     const stmt = this.db.prepare('SELECT iv, encrypted_data FROM attachments WHERE id = ?');
     stmt.bind([id]);
     let result: { iv: Uint8Array; encrypted_data: Uint8Array } | null = null;
-    if (stmt.step()) {
+    if (true) {
       const row = stmt.getAsObject() as SQLitePasswordRow;
       result = {
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] ObjectLiteral
src/lib/SQLiteOPFS.ts:417:16
     let result: { iv: Uint8Array; encrypted_data: Uint8Array } | null = null;
     if (stmt.step()) {
       const row = stmt.getAsObject() as SQLitePasswordRow;
-      result = {
-        iv: new Uint8Array(row.iv as ArrayLike<number>),
-        encrypted_data: new Uint8Array(row.encrypted_data as ArrayLike<number>),
-      };
+      result = {};
     }
     stmt.free();
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:426:38
     return result;
   }
 
-  deleteAttachment(id: string): void {
-    if (!this.db) throw new Error('Database not open');
-    this.db.run(`DELETE FROM attachments WHERE id = ${this.sqlVal(id)}`);
-    this.schedulePersist();
-  }
+  deleteAttachment(id: string): void {}
 
   getAttachmentsByEntry(entryId: number): string[] {
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:427:9
   }
 
   deleteAttachment(id: string): void {
-    if (!this.db) throw new Error('Database not open');
+    if (true) throw new Error('Database not open');
     this.db.run(`DELETE FROM attachments WHERE id = ${this.sqlVal(id)}`);
     this.schedulePersist();
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: Database not open

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:427:9
   }
 
   deleteAttachment(id: string): void {
-    if (!this.db) throw new Error('Database not open');
+    if (this.db) throw new Error('Database not open');
     this.db.run(`DELETE FROM attachments WHERE id = ${this.sqlVal(id)}`);
     this.schedulePersist();
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: Database not open

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:428:17
 
   deleteAttachment(id: string): void {
     if (!this.db) throw new Error('Database not open');
-    this.db.run(`DELETE FROM attachments WHERE id = ${this.sqlVal(id)}`);
+    this.db.run(``);
     this.schedulePersist();
   }
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:432:52
     this.schedulePersist();
   }
 
-  getAttachmentsByEntry(entryId: number): string[] {
-    if (!this.db) return [];
-    const stmt = this.db.prepare('SELECT id FROM attachments WHERE entry_id = ?');
-    stmt.bind([entryId]);
-    const ids: string[] = [];
-    while (stmt.step()) {
-      ids.push(stmt.getAsObject().id as string);
-    }
-    stmt.free();
-    return ids;
-  }
+  getAttachmentsByEntry(entryId: number): string[] {}
 
   // ─── Genel İşlemler ───
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:433:9
   }
 
   getAttachmentsByEntry(entryId: number): string[] {
-    if (!this.db) return [];
+    if (false) return [];
     const stmt = this.db.prepare('SELECT id FROM attachments WHERE entry_id = ?');
     stmt.bind([entryId]);
killedBy: SQLiteOPFS throws or returns defaults when database is closed
statusReason: Cannot read properties of null (reading 'prepare')

[Killed] BooleanLiteral
src/lib/SQLiteOPFS.ts:433:9
   }
 
   getAttachmentsByEntry(entryId: number): string[] {
-    if (!this.db) return [];
+    if (this.db) return [];
     const stmt = this.db.prepare('SELECT id FROM attachments WHERE entry_id = ?');
     stmt.bind([entryId]);
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to include 'att-1'

[Survived] ArrayDeclaration
src/lib/SQLiteOPFS.ts:436:27
     if (!this.db) return [];
     const stmt = this.db.prepare('SELECT id FROM attachments WHERE entry_id = ?');
     stmt.bind([entryId]);
-    const ids: string[] = [];
+    const ids: string[] = ["Stryker was here"];
     while (stmt.step()) {
       ids.push(stmt.getAsObject().id as string);

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:437:12
     const stmt = this.db.prepare('SELECT id FROM attachments WHERE entry_id = ?');
     stmt.bind([entryId]);
     const ids: string[] = [];
-    while (stmt.step()) {
+    while (false) {
       ids.push(stmt.getAsObject().id as string);
     }
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to include 'att-1'

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:437:25
     const stmt = this.db.prepare('SELECT id FROM attachments WHERE entry_id = ?');
     stmt.bind([entryId]);
     const ids: string[] = [];
-    while (stmt.step()) {
-      ids.push(stmt.getAsObject().id as string);
-    }
+    while (stmt.step()) {}
     stmt.free();
     return ids;
killedBy: SQLiteOPFS stores, reads and deletes attachment records
statusReason: expected [] to include 'att-1'

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:447:34
   // ─── Genel İşlemler ───
 
   /** Tüm veritabanını temizle */
-  async wipeAll(): Promise<void> {
-    if (this.db) {
-      this.db.run('DELETE FROM passwords');
-      this.db.run('DELETE FROM vault_metadata');
-      this.db.run('DELETE FROM attachments');
-      await this.persistToOPFS();
-    }
-    await deleteOPFSFile(this.dbFilename);
-  }
+  async wipeAll(): Promise<void> {}
 
   /** Veritabanını kapat */
killedBy: SQLiteOPFS wipeAll clears all tables and deletes the file from OPFS
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:448:9
 
   /** Tüm veritabanını temizle */
   async wipeAll(): Promise<void> {
-    if (this.db) {
+    if (false) {
       this.db.run('DELETE FROM passwords');
       this.db.run('DELETE FROM vault_metadata');
killedBy: SQLiteOPFS wipeAll clears all tables and deletes the file from OPFS
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:448:18
 
   /** Tüm veritabanını temizle */
   async wipeAll(): Promise<void> {
-    if (this.db) {
-      this.db.run('DELETE FROM passwords');
-      this.db.run('DELETE FROM vault_metadata');
-      this.db.run('DELETE FROM attachments');
-      await this.persistToOPFS();
-    }
+    if (this.db) {}
     await deleteOPFSFile(this.dbFilename);
   }
killedBy: SQLiteOPFS wipeAll clears all tables and deletes the file from OPFS
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/lib/SQLiteOPFS.ts:450:19
   async wipeAll(): Promise<void> {
     if (this.db) {
       this.db.run('DELETE FROM passwords');
-      this.db.run('DELETE FROM vault_metadata');
+      this.db.run("");
       this.db.run('DELETE FROM attachments');
       await this.persistToOPFS();
killedBy: SQLiteOPFS wipeAll clears all tables and deletes the file from OPFS
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:458:32
   }
 
   /** Veritabanını kapat */
-  async close(): Promise<void> {
-    await this.flushToOPFS();
-    if (this.db) {
-      this.db.close();
-      this.db = null;
-    }
-  }
+  async close(): Promise<void> {}
 
   /** Veritabanı açık mı? */
killedBy: SQLiteOPFS flushes, wipes and closes the database cleanly
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:460:9
   /** Veritabanını kapat */
   async close(): Promise<void> {
     await this.flushToOPFS();
-    if (this.db) {
+    if (false) {
       this.db.close();
       this.db = null;
killedBy: SQLiteOPFS flushes, wipes and closes the database cleanly
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:460:18
   /** Veritabanını kapat */
   async close(): Promise<void> {
     await this.flushToOPFS();
-    if (this.db) {
-      this.db.close();
-      this.db = null;
-    }
+    if (this.db) {}
   }
 
killedBy: SQLiteOPFS flushes, wipes and closes the database cleanly
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/SQLiteOPFS.ts:467:25
   }
 
   /** Veritabanı açık mı? */
-  get isOpen(): boolean {
-    return this.db !== null;
-  }
+  get isOpen(): boolean {}
 }
 
killedBy: SQLiteOPFS flushes, wipes and closes the database cleanly
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:468:12
 
   /** Veritabanı açık mı? */
   get isOpen(): boolean {
-    return this.db !== null;
+    return false;
   }
 }
killedBy: SQLiteOPFS initializes and migrates schema with all required columns, and falls back if OPFS fails
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/SQLiteOPFS.ts:468:12
 
   /** Veritabanı açık mı? */
   get isOpen(): boolean {
-    return this.db !== null;
+    return true;
   }
 }
killedBy: SQLiteOPFS flushes, wipes and closes the database cleanly
statusReason: expected true to be false // Object.is equality
