[Killed] BlockStatement
src/lib/WebAuthnService.ts:80:48
 /* ------------------------------------------------------------------ */
 
 /** WebAuthn API destegini kontrol eder */
-export function isWebAuthnSupported(): boolean {
-  return (
-    typeof window !== 'undefined' &&
-    typeof window.PublicKeyCredential !== 'undefined' &&
-    typeof navigator.credentials !== 'undefined'
-  );
-}
+export function isWebAuthnSupported(): boolean {}
 
 /** Conditional UI (autofill) destegini kontrol eder */
killedBy: WebAuthnService detects WebAuthn support correctly
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/lib/WebAuthnService.ts:82:5
 /** WebAuthn API destegini kontrol eder */
 export function isWebAuthnSupported(): boolean {
   return (
-    typeof window !== 'undefined' &&
+    typeof window === 'undefined' &&
     typeof window.PublicKeyCredential !== 'undefined' &&
     typeof navigator.credentials !== 'undefined'
killedBy: WebAuthnService detects WebAuthn support correctly
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:82:5
 /** WebAuthn API destegini kontrol eder */
 export function isWebAuthnSupported(): boolean {
   return (
-    typeof window !== 'undefined' &&
-    typeof window.PublicKeyCredential !== 'undefined' &&
-    typeof navigator.credentials !== 'undefined'
+    typeof window !== 'undefined' && typeof window.PublicKeyCredential !== 'undefined' || typeof navigator.credentials !== 'undefined'
   );
 }
killedBy: WebAuthnService detects WebAuthn support correctly
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/WebAuthnService.ts:83:5
 export function isWebAuthnSupported(): boolean {
   return (
     typeof window !== 'undefined' &&
-    typeof window.PublicKeyCredential !== 'undefined' &&
+    typeof window.PublicKeyCredential === 'undefined' &&
     typeof navigator.credentials !== 'undefined'
   );
killedBy: WebAuthnService detects WebAuthn support correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:83:5
 export function isWebAuthnSupported(): boolean {
   return (
     typeof window !== 'undefined' &&
-    typeof window.PublicKeyCredential !== 'undefined' &&
+    true &&
     typeof navigator.credentials !== 'undefined'
   );
killedBy: WebAuthnService Edge cases and surviving mutants isWebAuthnSupported returns false if PublicKeyCredential is undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:84:5
   return (
     typeof window !== 'undefined' &&
     typeof window.PublicKeyCredential !== 'undefined' &&
-    typeof navigator.credentials !== 'undefined'
+    true
   );
 }
killedBy: WebAuthnService detects WebAuthn support correctly
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/WebAuthnService.ts:84:5
   return (
     typeof window !== 'undefined' &&
     typeof window.PublicKeyCredential !== 'undefined' &&
-    typeof navigator.credentials !== 'undefined'
+    typeof navigator.credentials === 'undefined'
   );
 }
killedBy: WebAuthnService detects WebAuthn support correctly
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:89:75
 }
 
 /** Conditional UI (autofill) destegini kontrol eder */
-export async function isConditionalMediationSupported(): Promise<boolean> {
-  if (!isWebAuthnSupported()) return false;
-  try {
-    if (typeof PublicKeyCredential.isConditionalMediationAvailable === 'function') {
-      return await PublicKeyCredential.isConditionalMediationAvailable();
-    }
-  } catch {
-    /* tarayici desteklemiyorsa sessizce false don */
-  }
-  return false;
-}
+export async function isConditionalMediationSupported(): Promise<boolean> {}
 
 /** RP ID'yi URL'den cikarir */
killedBy: WebAuthnService checks conditional mediation support
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/lib/WebAuthnService.ts:90:7
 
 /** Conditional UI (autofill) destegini kontrol eder */
 export async function isConditionalMediationSupported(): Promise<boolean> {
-  if (!isWebAuthnSupported()) return false;
+  if (isWebAuthnSupported()) return false;
   try {
     if (typeof PublicKeyCredential.isConditionalMediationAvailable === 'function') {
killedBy: WebAuthnService checks conditional mediation support
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:90:7
 
 /** Conditional UI (autofill) destegini kontrol eder */
 export async function isConditionalMediationSupported(): Promise<boolean> {
-  if (!isWebAuthnSupported()) return false;
+  if (true) return false;
   try {
     if (typeof PublicKeyCredential.isConditionalMediationAvailable === 'function') {
killedBy: WebAuthnService checks conditional mediation support
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:91:7
 /** Conditional UI (autofill) destegini kontrol eder */
 export async function isConditionalMediationSupported(): Promise<boolean> {
   if (!isWebAuthnSupported()) return false;
-  try {
-    if (typeof PublicKeyCredential.isConditionalMediationAvailable === 'function') {
-      return await PublicKeyCredential.isConditionalMediationAvailable();
-    }
-  } catch {
+  try {} catch {
     /* tarayici desteklemiyorsa sessizce false don */
   }
killedBy: WebAuthnService checks conditional mediation support
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/lib/WebAuthnService.ts:92:9
 export async function isConditionalMediationSupported(): Promise<boolean> {
   if (!isWebAuthnSupported()) return false;
   try {
-    if (typeof PublicKeyCredential.isConditionalMediationAvailable === 'function') {
+    if (typeof PublicKeyCredential.isConditionalMediationAvailable !== 'function') {
       return await PublicKeyCredential.isConditionalMediationAvailable();
     }
killedBy: WebAuthnService checks conditional mediation support
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:92:9
 export async function isConditionalMediationSupported(): Promise<boolean> {
   if (!isWebAuthnSupported()) return false;
   try {
-    if (typeof PublicKeyCredential.isConditionalMediationAvailable === 'function') {
+    if (false) {
       return await PublicKeyCredential.isConditionalMediationAvailable();
     }
killedBy: WebAuthnService checks conditional mediation support
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:102:57
 }
 
 /** RP ID'yi URL'den cikarir */
-export function extractRpIdFromUrl(url: string): string {
-  try {
-    const parsed = new URL(url.startsWith('http') ? url : `https://${url}`);
-    return parsed.hostname;
-  } catch {
-    return url;
-  }
-}
+export function extractRpIdFromUrl(url: string): string {}
 
 /* ------------------------------------------------------------------ */
killedBy: WebAuthnService can extract RP ID from URL
statusReason: expected undefined to be 'github.com' // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:103:7
 
 /** RP ID'yi URL'den cikarir */
 export function extractRpIdFromUrl(url: string): string {
-  try {
-    const parsed = new URL(url.startsWith('http') ? url : `https://${url}`);
-    return parsed.hostname;
-  } catch {
+  try {} catch {
     return url;
   }
killedBy: WebAuthnService can extract RP ID from URL
statusReason: expected undefined to be 'github.com' // Object.is equality

[Killed] MethodExpression
src/lib/WebAuthnService.ts:104:28
 /** RP ID'yi URL'den cikarir */
 export function extractRpIdFromUrl(url: string): string {
   try {
-    const parsed = new URL(url.startsWith('http') ? url : `https://${url}`);
+    const parsed = new URL(url.endsWith('http') ? url : `https://${url}`);
     return parsed.hostname;
   } catch {
killedBy: WebAuthnService can extract RP ID from URL
statusReason: expected 'https' to be 'github.com' // Object.is equality

[Killed] StringLiteral
src/lib/WebAuthnService.ts:104:43
 /** RP ID'yi URL'den cikarir */
 export function extractRpIdFromUrl(url: string): string {
   try {
-    const parsed = new URL(url.startsWith('http') ? url : `https://${url}`);
+    const parsed = new URL(url.startsWith("") ? url : `https://${url}`);
     return parsed.hostname;
   } catch {
killedBy: WebAuthnService can extract RP ID from URL
statusReason: expected '' to be 'invalid-url::::' // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:106:11
   try {
     const parsed = new URL(url.startsWith('http') ? url : `https://${url}`);
     return parsed.hostname;
-  } catch {
-    return url;
-  }
+  } catch {}
 }
 
killedBy: WebAuthnService can extract RP ID from URL
statusReason: expected undefined to be 'invalid-url::::' // Object.is equality

[Killed] BooleanLiteral
src/lib/WebAuthnService.ts:125:9
   static async registerSitePasskey(
     options: SitePasskeyRegistrationOptions
   ): Promise<SitePasskeyRegistrationResult | null> {
-    if (!isWebAuthnSupported()) {
+    if (isWebAuthnSupported()) {
       throw new Error('WebAuthn is not supported in this browser.');
     }
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: WebAuthn is not supported in this browser.

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:125:9
   static async registerSitePasskey(
     options: SitePasskeyRegistrationOptions
   ): Promise<SitePasskeyRegistrationResult | null> {
-    if (!isWebAuthnSupported()) {
+    if (true) {
       throw new Error('WebAuthn is not supported in this browser.');
     }
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: WebAuthn is not supported in this browser.

[Killed] StringLiteral
src/lib/WebAuthnService.ts:126:23
     options: SitePasskeyRegistrationOptions
   ): Promise<SitePasskeyRegistrationResult | null> {
     if (!isWebAuthnSupported()) {
-      throw new Error('WebAuthn is not supported in this browser.');
+      throw new Error("");
     }
 
killedBy: WebAuthnService registerSitePasskey throws if WebAuthn is unsupported during register
statusReason: expected [Function] to throw error including 'WebAuthn is not supported in this bro…' but got ''

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:136:7
     const challenge = window.crypto.getRandomValues(new Uint8Array(32));
 
     const excludeCredentials: PublicKeyCredentialDescriptor[] = (
-      options.excludeCredentialIds || []
+      true
     ).map((id) => ({
       type: 'public-key' as const,
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:136:7
     const challenge = window.crypto.getRandomValues(new Uint8Array(32));
 
     const excludeCredentials: PublicKeyCredentialDescriptor[] = (
-      options.excludeCredentialIds || []
+      false
     ).map((id) => ({
       type: 'public-key' as const,
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] ArrowFunction
src/lib/WebAuthnService.ts:137:11
 
     const excludeCredentials: PublicKeyCredentialDescriptor[] = (
       options.excludeCredentialIds || []
-    ).map((id) => ({
-      type: 'public-key' as const,
-      id: base64urlToBuffer(id),
-    }));
+    ).map(() => undefined);
 
     const publicKeyOptions: PublicKeyCredentialCreationOptions = {
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/lib/WebAuthnService.ts:142:66
       id: base64urlToBuffer(id),
     }));
 
-    const publicKeyOptions: PublicKeyCredentialCreationOptions = {
-      challenge,
-      rp: {
-        id: options.rpId,
-        name: options.rpName || options.rpId,
-      },
-      user: {
-        id: userId,
-        name: options.userName,
-        displayName: options.userDisplayName || options.userName,
-      },
-      pubKeyCredParams: [
-        { type: 'public-key', alg: -7 }, // ES256
-        { type: 'public-key', alg: -257 }, // RS256
-      ],
-      timeout: options.timeout || 60000,
-      attestation: options.attestation || 'none',
-      excludeCredentials,
-      authenticatorSelection: {
-        authenticatorAttachment: options.authenticatorAttachment || 'platform',
-        residentKey: options.residentKey || 'preferred',
-        userVerification: options.userVerification || 'preferred',
-      },
-    };
+    const publicKeyOptions: PublicKeyCredentialCreationOptions = {};
 
     // Note: When attachment is 'cross-platform', browsers usually offer QR code (hybrid).
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:146:15
       challenge,
       rp: {
         id: options.rpId,
-        name: options.rpName || options.rpId,
+        name: options.rpName && options.rpId,
       },
       user: {
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected undefined to be 'test.com' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:146:15
       challenge,
       rp: {
         id: options.rpId,
-        name: options.rpName || options.rpId,
+        name: true,
       },
       user: {
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected true to be 'test.com' // Object.is equality

[Killed] ObjectLiteral
src/lib/WebAuthnService.ts:148:13
         id: options.rpId,
         name: options.rpName || options.rpId,
       },
-      user: {
-        id: userId,
-        name: options.userName,
-        displayName: options.userDisplayName || options.userName,
-      },
+      user: {},
       pubKeyCredParams: [
         { type: 'public-key', alg: -7 }, // ES256
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected undefined to be 'user' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:151:22
       user: {
         id: userId,
         name: options.userName,
-        displayName: options.userDisplayName || options.userName,
+        displayName: true,
       },
       pubKeyCredParams: [
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected true to be 'user' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:151:22
       user: {
         id: userId,
         name: options.userName,
-        displayName: options.userDisplayName || options.userName,
+        displayName: false,
       },
       pubKeyCredParams: [
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected false to be 'user' // Object.is equality

[Survived] UnaryOperator
src/lib/WebAuthnService.ts:154:36
         displayName: options.userDisplayName || options.userName,
       },
       pubKeyCredParams: [
-        { type: 'public-key', alg: -7 }, // ES256
+        { type: 'public-key', alg: +7 }, // ES256
         { type: 'public-key', alg: -257 }, // RS256
       ],

[Survived] ObjectLiteral
src/lib/WebAuthnService.ts:154:9
         displayName: options.userDisplayName || options.userName,
       },
       pubKeyCredParams: [
-        { type: 'public-key', alg: -7 }, // ES256
+        {}, // ES256
         { type: 'public-key', alg: -257 }, // RS256
       ],

[Survived] UnaryOperator
src/lib/WebAuthnService.ts:155:36
       },
       pubKeyCredParams: [
         { type: 'public-key', alg: -7 }, // ES256
-        { type: 'public-key', alg: -257 }, // RS256
+        { type: 'public-key', alg: +257 }, // RS256
       ],
       timeout: options.timeout || 60000,

[Survived] StringLiteral
src/lib/WebAuthnService.ts:155:17
       },
       pubKeyCredParams: [
         { type: 'public-key', alg: -7 }, // ES256
-        { type: 'public-key', alg: -257 }, // RS256
+        { type: "", alg: -257 }, // RS256
       ],
       timeout: options.timeout || 60000,

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:157:16
         { type: 'public-key', alg: -7 }, // ES256
         { type: 'public-key', alg: -257 }, // RS256
       ],
-      timeout: options.timeout || 60000,
+      timeout: false,
       attestation: options.attestation || 'none',
       excludeCredentials,
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: expected false to be 45000 // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:157:16
         { type: 'public-key', alg: -7 }, // ES256
         { type: 'public-key', alg: -257 }, // RS256
       ],
-      timeout: options.timeout || 60000,
+      timeout: true,
       attestation: options.attestation || 'none',
       excludeCredentials,
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: expected true to be 45000 // Object.is equality

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:158:20
         { type: 'public-key', alg: -257 }, // RS256
       ],
       timeout: options.timeout || 60000,
-      attestation: options.attestation || 'none',
+      attestation: options.attestation && 'none',
       excludeCredentials,
       authenticatorSelection: {
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: expected 'none' to be 'direct' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:158:20
         { type: 'public-key', alg: -257 }, // RS256
       ],
       timeout: options.timeout || 60000,
-      attestation: options.attestation || 'none',
+      attestation: false,
       excludeCredentials,
       authenticatorSelection: {
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: expected false to be 'direct' // Object.is equality

[Killed] ObjectLiteral
src/lib/WebAuthnService.ts:160:31
       timeout: options.timeout || 60000,
       attestation: options.attestation || 'none',
       excludeCredentials,
-      authenticatorSelection: {
-        authenticatorAttachment: options.authenticatorAttachment || 'platform',
-        residentKey: options.residentKey || 'preferred',
-        userVerification: options.userVerification || 'preferred',
-      },
+      authenticatorSelection: {},
     };
 
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: expected undefined to be 'required' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:161:34
       attestation: options.attestation || 'none',
       excludeCredentials,
       authenticatorSelection: {
-        authenticatorAttachment: options.authenticatorAttachment || 'platform',
+        authenticatorAttachment: true,
         residentKey: options.residentKey || 'preferred',
         userVerification: options.userVerification || 'preferred',
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected true to be 'platform' // Object.is equality

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:161:34
       attestation: options.attestation || 'none',
       excludeCredentials,
       authenticatorSelection: {
-        authenticatorAttachment: options.authenticatorAttachment || 'platform',
+        authenticatorAttachment: options.authenticatorAttachment && 'platform',
         residentKey: options.residentKey || 'preferred',
         userVerification: options.userVerification || 'preferred',
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected undefined to be 'platform' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:162:22
       excludeCredentials,
       authenticatorSelection: {
         authenticatorAttachment: options.authenticatorAttachment || 'platform',
-        residentKey: options.residentKey || 'preferred',
+        residentKey: false,
         userVerification: options.userVerification || 'preferred',
       },
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: expected false to be 'required' // Object.is equality

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:162:22
       excludeCredentials,
       authenticatorSelection: {
         authenticatorAttachment: options.authenticatorAttachment || 'platform',
-        residentKey: options.residentKey || 'preferred',
+        residentKey: options.residentKey && 'preferred',
         userVerification: options.userVerification || 'preferred',
       },
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: expected 'preferred' to be 'required' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:163:27
       authenticatorSelection: {
         authenticatorAttachment: options.authenticatorAttachment || 'platform',
         residentKey: options.residentKey || 'preferred',
-        userVerification: options.userVerification || 'preferred',
+        userVerification: true,
       },
     };
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: expected true to be 'required' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:163:27
       authenticatorSelection: {
         authenticatorAttachment: options.authenticatorAttachment || 'platform',
         residentKey: options.residentKey || 'preferred',
-        userVerification: options.userVerification || 'preferred',
+        userVerification: false,
       },
     };
killedBy: WebAuthnService registerSitePasskey sets optional parameters properly when provided
statusReason: expected false to be 'required' // Object.is equality

[Killed] EqualityOperator
src/lib/WebAuthnService.ts:170:7
     // Note: When attachment is 'cross-platform', browsers usually offer QR code (hybrid).
     // We allow the user to specify it via options, defaulting to 'platform'.
     if (
-      options.authenticatorAttachment === 'cross-platform' &&
+      options.authenticatorAttachment !== 'cross-platform' &&
       publicKeyOptions.authenticatorSelection
     ) {
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected 'cross-platform' to be 'platform' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:170:7
     // Note: When attachment is 'cross-platform', browsers usually offer QR code (hybrid).
     // We allow the user to specify it via options, defaulting to 'platform'.
     if (
-      options.authenticatorAttachment === 'cross-platform' &&
-      publicKeyOptions.authenticatorSelection
+      true
     ) {
       publicKeyOptions.authenticatorSelection.authenticatorAttachment = 'cross-platform';
killedBy: WebAuthnService registerSitePasskey falls back to defaults when optional parameters are omitted
statusReason: expected 'cross-platform' to be 'platform' // Object.is equality

[Survived] BlockStatement
src/lib/WebAuthnService.ts:172:7
     if (
       options.authenticatorAttachment === 'cross-platform' &&
       publicKeyOptions.authenticatorSelection
-    ) {
-      publicKeyOptions.authenticatorSelection.authenticatorAttachment = 'cross-platform';
-    }
+    ) {}
 
     try {

[Killed] BooleanLiteral
src/lib/WebAuthnService.ts:182:11
       });
       const credential = resp as PublicKeyCredential;
 
-      if (!credential) return null;
+      if (credential) return null;
 
       const response = credential.response as AuthenticatorAttestationResponse;
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:182:11
       });
       const credential = resp as PublicKeyCredential;
 
-      if (!credential) return null;
+      if (true) return null;
 
       const response = credential.response as AuthenticatorAttestationResponse;
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: expected null not to be null

[Killed] OptionalChaining
src/lib/WebAuthnService.ts:185:30
       if (!credential) return null;
 
       const response = credential.response as AuthenticatorAttestationResponse;
-      const publicKeyBytes = response.getPublicKey?.();
+      const publicKeyBytes = response.getPublicKey();
 
       // Transport bilgisi
killedBy: WebAuthnService registerSitePasskey handles missing response methods gracefully
statusReason: expected undefined to be 'no-methods' // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:189:57
 
       // Transport bilgisi
       let transports: string[] = [];
-      if (typeof response.getTransports === 'function') {
-        transports = response.getTransports() as string[];
-      }
+      if (typeof response.getTransports === 'function') {}
 
       // Algoritma bilgisi
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: expected [] to include 'hybrid'

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:189:11
 
       // Transport bilgisi
       let transports: string[] = [];
-      if (typeof response.getTransports === 'function') {
+      if (false) {
         transports = response.getTransports() as string[];
       }
killedBy: WebAuthnService registerSitePasskey calls navigator.credentials.create with correct options including PRF and timeouts
statusReason: expected [] to include 'hybrid'

[Killed] UnaryOperator
src/lib/WebAuthnService.ts:194:23
       }
 
       // Algoritma bilgisi
-      let algorithm = -7; // ES256 varsayilan
+      let algorithm = +7; // ES256 varsayilan
       if (typeof response.getPublicKeyAlgorithm === 'function') {
         algorithm = response.getPublicKeyAlgorithm();
killedBy: WebAuthnService registerSitePasskey handles missing response methods gracefully
statusReason: expected 7 to be -7 // Object.is equality

[Killed] EqualityOperator
src/lib/WebAuthnService.ts:195:11
 
       // Algoritma bilgisi
       let algorithm = -7; // ES256 varsayilan
-      if (typeof response.getPublicKeyAlgorithm === 'function') {
+      if (typeof response.getPublicKeyAlgorithm !== 'function') {
         algorithm = response.getPublicKeyAlgorithm();
       }
killedBy: WebAuthnService registerSitePasskey handles missing response methods gracefully
statusReason: expected undefined to be 'no-methods' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:195:11
 
       // Algoritma bilgisi
       let algorithm = -7; // ES256 varsayilan
-      if (typeof response.getPublicKeyAlgorithm === 'function') {
+      if (true) {
         algorithm = response.getPublicKeyAlgorithm();
       }
killedBy: WebAuthnService registerSitePasskey handles missing response methods gracefully
statusReason: expected undefined to be 'no-methods' // Object.is equality

[Survived] MethodExpression
src/lib/WebAuthnService.ts:205:15
         rpId: options.rpId,
         userHandle: bufferToBase64url(
           userId instanceof Uint8Array
-            ? userId.buffer.slice(userId.byteOffset, userId.byteOffset + userId.byteLength)
+            ? userId.buffer
             : userId
         ),

[Survived] ArithmeticOperator
src/lib/WebAuthnService.ts:205:54
         rpId: options.rpId,
         userHandle: bufferToBase64url(
           userId instanceof Uint8Array
-            ? userId.buffer.slice(userId.byteOffset, userId.byteOffset + userId.byteLength)
+            ? userId.buffer.slice(userId.byteOffset, userId.byteOffset - userId.byteLength)
             : userId
         ),

[Survived] ConditionalExpression
src/lib/WebAuthnService.ts:208:22
             ? userId.buffer.slice(userId.byteOffset, userId.byteOffset + userId.byteLength)
             : userId
         ),
-        displayName: options.userDisplayName || options.userName,
+        displayName: false,
         transport: transports,
         authenticatorAttachment:
