[Survived] LogicalOperator
src/lib/WebAuthnService.ts:208:22
             ? userId.buffer.slice(userId.byteOffset, userId.byteOffset + userId.byteLength)
             : userId
         ),
-        displayName: options.userDisplayName || options.userName,
+        displayName: options.userDisplayName && options.userName,
         transport: transports,
         authenticatorAttachment:

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:211:11
         displayName: options.userDisplayName || options.userName,
         transport: transports,
         authenticatorAttachment:
-          (credential as PublicKeyCredentialWithAttachment).authenticatorAttachment ||
-          options.authenticatorAttachment ||
-          'platform',
+          false,
         algorithm,
         registeredAt: new Date().toISOString(),
killedBy: WebAuthnService registerSitePasskey handles missing response methods gracefully
statusReason: expected false to be 'platform' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:211:11
         displayName: options.userDisplayName || options.userName,
         transport: transports,
         authenticatorAttachment:
-          (credential as PublicKeyCredentialWithAttachment).authenticatorAttachment ||
-          options.authenticatorAttachment ||
-          'platform',
+          true,
         algorithm,
         registeredAt: new Date().toISOString(),
killedBy: WebAuthnService registerSitePasskey handles missing response methods gracefully
statusReason: expected true to be 'platform' // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:217:21
         algorithm,
         registeredAt: new Date().toISOString(),
       };
-    } catch (error) {
-      console.error('[WebAuthnService] Site passkey registration failed:', error);
-      return null;
-    }
+    } catch (error) {}
   }
 
killedBy: WebAuthnService registerSitePasskey returns null if navigator.credentials.create fails
statusReason: expected undefined to be null

[Killed] StringLiteral
src/lib/WebAuthnService.ts:218:21
         registeredAt: new Date().toISOString(),
       };
     } catch (error) {
-      console.error('[WebAuthnService] Site passkey registration failed:', error);
+      console.error("", error);
       return null;
     }
killedBy: WebAuthnService Edge cases and surviving mutants registerSitePasskey logs error properly on reject
statusReason: expected "error" to be called with arguments: [ …(2) ]

Received: 

  1st error call:

  [
-   "[WebAuthnService] Site passkey registration failed:",

[Killed] BooleanLiteral
src/lib/WebAuthnService.ts:232:9
   static async authenticateSitePasskey(
     options: SitePasskeyAuthOptions
   ): Promise<SitePasskeyAuthResult | null> {
-    if (!isWebAuthnSupported()) {
+    if (isWebAuthnSupported()) {
       throw new Error('WebAuthn is not supported in this browser.');
     }
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: WebAuthn is not supported in this browser.

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:232:9
   static async authenticateSitePasskey(
     options: SitePasskeyAuthOptions
   ): Promise<SitePasskeyAuthResult | null> {
-    if (!isWebAuthnSupported()) {
+    if (true) {
       throw new Error('WebAuthn is not supported in this browser.');
     }
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: WebAuthn is not supported in this browser.

[Killed] OptionalChaining
src/lib/WebAuthnService.ts:239:7
     const challenge = window.crypto.getRandomValues(new Uint8Array(32));
 
     const allowCredentials: PublicKeyCredentialDescriptor[] | undefined =
-      options.allowCredentialIds?.map((id) => ({
+      options.allowCredentialIds.map((id) => ({
         type: 'public-key' as const,
         id: base64urlToBuffer(id),
killedBy: WebAuthnService authenticateSitePasskey handles authentication without allowCredentialIds and without userHandle
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/lib/WebAuthnService.ts:239:39
     const challenge = window.crypto.getRandomValues(new Uint8Array(32));
 
     const allowCredentials: PublicKeyCredentialDescriptor[] | undefined =
-      options.allowCredentialIds?.map((id) => ({
-        type: 'public-key' as const,
-        id: base64urlToBuffer(id),
-        transports: ['internal', 'hybrid', 'usb', 'ble', 'nfc'] as AuthenticatorTransport[],
-      }));
+      options.allowCredentialIds?.map(() => undefined);
 
     const publicKeyOptions: PublicKeyCredentialRequestOptions = {
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:249:25
       challenge,
       rpId: options.rpId,
       allowCredentials,
-      userVerification: options.userVerification || 'preferred',
+      userVerification: options.userVerification && 'preferred',
       timeout: options.timeout || 60000,
     };
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: expected 'preferred' to be 'required' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:249:25
       challenge,
       rpId: options.rpId,
       allowCredentials,
-      userVerification: options.userVerification || 'preferred',
+      userVerification: true,
       timeout: options.timeout || 60000,
     };
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: expected true to be 'required' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:250:16
       rpId: options.rpId,
       allowCredentials,
       userVerification: options.userVerification || 'preferred',
-      timeout: options.timeout || 60000,
+      timeout: false,
     };
 
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: expected false to be 30000 // Object.is equality

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:250:16
       rpId: options.rpId,
       allowCredentials,
       userVerification: options.userVerification || 'preferred',
-      timeout: options.timeout || 60000,
+      timeout: options.timeout && 60000,
     };
 
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: expected 60000 to be 30000 // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:253:9
       timeout: options.timeout || 60000,
     };
 
-    try {
-      const assertion = (await navigator.credentials.get({
-        publicKey: publicKeyOptions,
-      })) as PublicKeyCredential | null;
-
-      if (!assertion) return null;
-
-      const response = assertion.response as AuthenticatorAssertionResponse;
-
-      return {
-        credentialId: assertion.id,
-        rpId: options.rpId,
-        authenticatorDataBase64: bufferToBase64url(response.authenticatorData),
-        clientDataJSONBase64: bufferToBase64url(response.clientDataJSON),
-        signatureBase64: bufferToBase64url(response.signature),
-        userHandleBase64: response.userHandle ? bufferToBase64url(response.userHandle) : null,
-        authenticatedAt: new Date().toISOString(),
-      };
-    } catch (error) {
+    try {} catch (error) {
       console.error('[WebAuthnService] Site passkey authentication failed:', error);
       return null;
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:258:11
         publicKey: publicKeyOptions,
       })) as PublicKeyCredential | null;
 
-      if (!assertion) return null;
+      if (true) return null;
 
       const response = assertion.response as AuthenticatorAssertionResponse;
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: expected undefined to be 'auth-cred-id' // Object.is equality

[Killed] BooleanLiteral
src/lib/WebAuthnService.ts:258:11
         publicKey: publicKeyOptions,
       })) as PublicKeyCredential | null;
 
-      if (!assertion) return null;
+      if (assertion) return null;
 
       const response = assertion.response as AuthenticatorAssertionResponse;
killedBy: WebAuthnService authenticateSitePasskey calls navigator.credentials.get with correct timeout and rpId
statusReason: expected undefined to be 'auth-cred-id' // Object.is equality

[Killed] BlockStatement
src/lib/WebAuthnService.ts:271:21
         userHandleBase64: response.userHandle ? bufferToBase64url(response.userHandle) : null,
         authenticatedAt: new Date().toISOString(),
       };
-    } catch (error) {
-      console.error('[WebAuthnService] Site passkey authentication failed:', error);
-      return null;
-    }
+    } catch (error) {}
   }
 
killedBy: WebAuthnService authenticateSitePasskey returns null if navigator.credentials.get fails
statusReason: expected undefined to be null

[Killed] BlockStatement
src/lib/WebAuthnService.ts:283:29
    */
   static registrationToPasskeyMetadata(
     result: SitePasskeyRegistrationResult
-  ): CanonicalPasskeyFields {
-    return {
-      rp_id: result.rpId,
-      credential_id: result.credentialId,
-      user_handle: result.userHandle,
-      display_name: result.displayName,
-      transport: (result.transport || []).join(','),
-      authenticator_attachment: result.authenticatorAttachment,
-      algorithm: String(result.algorithm),
-      mode: 'site_passkey_active',
-      server_verified: false,
-      created_at: result.registeredAt,
-      last_registration_at: result.registeredAt,
-      last_auth_at: undefined,
-    };
-  }
+  ): CanonicalPasskeyFields {}
 
   /**
killedBy: WebAuthnService Metadata Mapping and Updates correctly maps registration result to canonical metadata
statusReason: Cannot read properties of undefined (reading 'rp_id')

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:289:19
       credential_id: result.credentialId,
       user_handle: result.userHandle,
       display_name: result.displayName,
-      transport: (result.transport || []).join(','),
+      transport: (true).join(','),
       authenticator_attachment: result.authenticatorAttachment,
       algorithm: String(result.algorithm),
killedBy: WebAuthnService Metadata Mapping and Updates correctly maps registration result to canonical metadata
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).join is not a function

[Killed] LogicalOperator
src/lib/WebAuthnService.ts:289:19
       credential_id: result.credentialId,
       user_handle: result.userHandle,
       display_name: result.displayName,
-      transport: (result.transport || []).join(','),
+      transport: (result.transport && []).join(','),
       authenticator_attachment: result.authenticatorAttachment,
       algorithm: String(result.algorithm),
killedBy: WebAuthnService Metadata Mapping and Updates correctly maps registration result to canonical metadata
statusReason: expected '' to be 'internal,hybrid' // Object.is equality

[Survived] BooleanLiteral
src/lib/WebAuthnService.ts:293:24
       authenticator_attachment: result.authenticatorAttachment,
       algorithm: String(result.algorithm),
       mode: 'site_passkey_active',
-      server_verified: false,
+      server_verified: true,
       created_at: result.registeredAt,
       last_registration_at: result.registeredAt,

[Killed] BlockStatement
src/lib/WebAuthnService.ts:306:29
   static updateMetadataAfterAuth(
     existing: CanonicalPasskeyFields,
     authResult: SitePasskeyAuthResult
-  ): CanonicalPasskeyFields {
-    return {
-      ...existing,
-      credential_id: existing.credential_id || authResult.credentialId,
-      server_verified: true,
-      last_auth_at: authResult.authenticatedAt,
-    };
-  }
+  ): CanonicalPasskeyFields {}
 }
 
killedBy: WebAuthnService Metadata Mapping and Updates updates metadata properly when credentialId is missing from existing
statusReason: Cannot read properties of undefined (reading 'credential_id')

[Killed] ObjectLiteral
src/lib/WebAuthnService.ts:307:12
     existing: CanonicalPasskeyFields,
     authResult: SitePasskeyAuthResult
   ): CanonicalPasskeyFields {
-    return {
-      ...existing,
-      credential_id: existing.credential_id || authResult.credentialId,
-      server_verified: true,
-      last_auth_at: authResult.authenticatedAt,
-    };
+    return {};
   }
 }
killedBy: WebAuthnService Metadata Mapping and Updates updates metadata properly when credentialId is missing from existing
statusReason: expected undefined to be 'auth-cid' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:309:22
   ): CanonicalPasskeyFields {
     return {
       ...existing,
-      credential_id: existing.credential_id || authResult.credentialId,
+      credential_id: true,
       server_verified: true,
       last_auth_at: authResult.authenticatedAt,
killedBy: WebAuthnService Metadata Mapping and Updates updates metadata properly when credentialId is missing from existing
statusReason: expected true to be 'auth-cid' // Object.is equality

[Killed] ConditionalExpression
src/lib/WebAuthnService.ts:309:22
   ): CanonicalPasskeyFields {
     return {
       ...existing,
-      credential_id: existing.credential_id || authResult.credentialId,
+      credential_id: false,
       server_verified: true,
       last_auth_at: authResult.authenticatedAt,
killedBy: WebAuthnService Metadata Mapping and Updates updates metadata properly when credentialId is missing from existing
statusReason: expected false to be 'auth-cid' // Object.is equality

[Killed] BooleanLiteral
src/lib/WebAuthnService.ts:310:24
     return {
       ...existing,
       credential_id: existing.credential_id || authResult.credentialId,
-      server_verified: true,
+      server_verified: false,
       last_auth_at: authResult.authenticatedAt,
     };
killedBy: WebAuthnService Metadata Mapping and Updates updates metadata after successful authentication
statusReason: expected false to be true // Object.is equality
