[Survived] BooleanLiteral
src/vaultService.ts:42:24
   public aesKey: CryptoKey | null = null;
   public sensitiveMaterial: Uint8Array | null = null;
   public searchIndexHmacKey: CryptoKey | null = null;
-  public isConnected = false;
+  public isConnected = true;
   public opfsMockDb: IDBPDatabase | null = null;
   public sqliteDb: SQLiteOPFS | null = null;

[Survived] BooleanLiteral
src/vaultService.ts:45:22
   public isConnected = false;
   public opfsMockDb: IDBPDatabase | null = null;
   public sqliteDb: SQLiteOPFS | null = null;
-  public useSQLite = false;
+  public useSQLite = true;
   public decryptedEntriesCache: VaultEntry[] | null = null;
   public mutationLock: Promise<void> = Promise.resolve();

[Killed] BlockStatement
src/vaultService.ts:53:32
   private _authFailureLog: Map<string, { count: number; lastTs: number }> = new Map();
 
   // ─── Getters ───
-  public isUnlocked(): boolean {
-    return this.aesKey !== null;
-  }
+  public isUnlocked(): boolean {}
 
   public getVaultDbName(): string {
killedBy: VaultService Security & Cryptography 22. Lock: Tüm hassas materyalleri ve bağlantıları temizlemeli
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/vaultService.ts:54:12
 
   // ─── Getters ───
   public isUnlocked(): boolean {
-    return this.aesKey !== null;
+    return this.aesKey === null;
   }
 
killedBy: VaultService Security & Cryptography 22. Lock: Tüm hassas materyalleri ve bağlantıları temizlemeli
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/vaultService.ts:54:12
 
   // ─── Getters ───
   public isUnlocked(): boolean {
-    return this.aesKey !== null;
+    return true;
   }
 
killedBy: VaultService Security & Cryptography 22. Lock: Tüm hassas materyalleri ve bağlantıları temizlemeli
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:57:35
     return this.aesKey !== null;
   }
 
-  public getVaultDbName(): string {
-    return this._vaultDbName;
-  }
+  public getVaultDbName(): string {}
 
   public setVaultDbName(name: string): void {
killedBy: VaultService Security & Cryptography 27. dbName getters and setters work correctly
statusReason: expected undefined to be 'new_db_name' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:61:45
     return this._vaultDbName;
   }
 
-  public setVaultDbName(name: string): void {
-    this._vaultDbName = name;
-  }
+  public setVaultDbName(name: string): void {}
 
   // ─── Test & Coverage Bridge Metodları ───
killedBy: VaultService Security & Cryptography 27. dbName getters and setters work correctly
statusReason: expected 'aegis_opfs_vault' to be 'new_db_name' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:66:54
   }
 
   // ─── Test & Coverage Bridge Metodları ───
-  public calculateStrength(password: string): number {
-    return VaultCryptoService.calculateStrength(password);
-  }
+  public calculateStrength(password: string): number {}
 
   public static async verifyPassword(password: string, stored: StoredCredential): Promise<boolean> {
killedBy: VaultService coverage helpers calculates strength, normalizes search terms and tokenizes prefixes
statusReason: expected undefined to be +0 // Object.is equality

[NoCoverage] BlockStatement
src/vaultService.ts:70:100
     return VaultCryptoService.calculateStrength(password);
   }
 
-  public static async verifyPassword(password: string, stored: StoredCredential): Promise<boolean> {
-    return VaultAuthService.verifyPassword(
-      password,
-      stored,
-      VaultAuthService.calibrateArgon2Params()
-    );
-  }
+  public static async verifyPassword(password: string, stored: StoredCredential): Promise<boolean> {}
 
   public async encryptTextField(value: string): Promise<{ encrypted: string; iv: string }> {

[Killed] BlockStatement
src/vaultService.ts:78:92
     );
   }
 
-  public async encryptTextField(value: string): Promise<{ encrypted: string; iv: string }> {
-    return VaultCryptoService.encryptTextField(this.aesKey, value);
-  }
+  public async encryptTextField(value: string): Promise<{ encrypted: string; iv: string }> {}
 
   public async decryptTextField(encrypted?: string, iv?: string): Promise<string | null> {
killedBy: VaultService coverage helpers encrypts and decrypts text fields with the active AES key
statusReason: Cannot read properties of undefined (reading 'encrypted')

[Killed] BlockStatement
src/vaultService.ts:82:90
     return VaultCryptoService.encryptTextField(this.aesKey, value);
   }
 
-  public async decryptTextField(encrypted?: string, iv?: string): Promise<string | null> {
-    return VaultCryptoService.decryptTextField(this.aesKey, encrypted, iv);
-  }
+  public async decryptTextField(encrypted?: string, iv?: string): Promise<string | null> {}
 
   public async verifyCurrentPassword(password: string): Promise<boolean> {
killedBy: VaultService coverage helpers encrypts and decrypts text fields with the active AES key
statusReason: expected undefined to be 'vault-secret' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:86:74
     return VaultCryptoService.decryptTextField(this.aesKey, encrypted, iv);
   }
 
-  public async verifyCurrentPassword(password: string): Promise<boolean> {
-    const stored = await this.getAuthCredential();
-    if (!stored) return false;
-    return VaultAuthService.verifyPassword(
-      password,
-      stored,
-      VaultAuthService.calibrateArgon2Params()
-    );
-  }
+  public async verifyCurrentPassword(password: string): Promise<boolean> {}
 
   private async getAuthCredential(): Promise<StoredCredential | null> {
killedBy: VaultService coverage helpers verifies password state and auth migration helpers
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/vaultService.ts:88:25
 
   public async verifyCurrentPassword(password: string): Promise<boolean> {
     const stored = await this.getAuthCredential();
-    if (!stored) return false;
+    if (!stored) return true;
     return VaultAuthService.verifyPassword(
       password,
killedBy: VaultService coverage helpers verifies password state and auth migration helpers
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/vaultService.ts:88:9
 
   public async verifyCurrentPassword(password: string): Promise<boolean> {
     const stored = await this.getAuthCredential();
-    if (!stored) return false;
+    if (false) return false;
     return VaultAuthService.verifyPassword(
       password,
killedBy: VaultService coverage helpers verifies password state and auth migration helpers
statusReason: Cannot read properties of null (reading 'salt')

[Killed] BlockStatement
src/vaultService.ts:96:71
     );
   }
 
-  private async getAuthCredential(): Promise<StoredCredential | null> {
-    if (this.useSQLite && this.sqliteDb) {
-      const meta = (
-        this.sqliteDb as unknown as { getMetadata: () => Record<string, unknown> | null }
-      ).getMetadata?.();
-      return (meta?.credential as StoredCredential) ?? null;
-    }
-    if (this.opfsMockDb) {
-      const meta = await (
-        this.opfsMockDb as unknown as {
-          get: (store: string, key: string) => Promise<Record<string, unknown> | undefined>;
-        }
-      ).get('meta', 'auth');
-      return (meta?.credential as StoredCredential) ?? null;
-    }
-    return null;
-  }
+  private async getAuthCredential(): Promise<StoredCredential | null> {}
 
   public normalizeSearchValue(value: string): string {
killedBy: VaultService Security & Cryptography 23. getAuthCredential: SQLite getMetadata opsiyonel zincirlemeyi doğrulamalı
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/vaultService.ts:97:9
   }
 
   private async getAuthCredential(): Promise<StoredCredential | null> {
-    if (this.useSQLite && this.sqliteDb) {
+    if (false) {
       const meta = (
         this.sqliteDb as unknown as { getMetadata: () => Record<string, unknown> | null }
killedBy: VaultService Security & Cryptography 28. getAuthCredential: SQLite üzerinden credential bilgisini okumalı
statusReason: expected undefined to be 'sqlitehash123' // Object.is equality

[Killed] ConditionalExpression
src/vaultService.ts:97:9
   }
 
   private async getAuthCredential(): Promise<StoredCredential | null> {
-    if (this.useSQLite && this.sqliteDb) {
+    if (true) {
       const meta = (
         this.sqliteDb as unknown as { getMetadata: () => Record<string, unknown> | null }
killedBy: VaultService coverage helpers verifies password state and auth migration helpers
statusReason: Cannot read properties of null (reading 'getMetadata')

[Killed] OptionalChaining
src/vaultService.ts:98:20
 
   private async getAuthCredential(): Promise<StoredCredential | null> {
     if (this.useSQLite && this.sqliteDb) {
-      const meta = (
-        this.sqliteDb as unknown as { getMetadata: () => Record<string, unknown> | null }
-      ).getMetadata?.();
+      const meta = (this.sqliteDb as unknown as {
+  getMetadata: () => Record<string, unknown> | null;
+}).getMetadata();
       return (meta?.credential as StoredCredential) ?? null;
     }
killedBy: VaultService Security & Cryptography 23. getAuthCredential: SQLite getMetadata opsiyonel zincirlemeyi doğrulamalı
statusReason: this.sqliteDb.getMetadata is not a function

[Killed] LogicalOperator
src/vaultService.ts:101:14
       const meta = (
         this.sqliteDb as unknown as { getMetadata: () => Record<string, unknown> | null }
       ).getMetadata?.();
-      return (meta?.credential as StoredCredential) ?? null;
+      return meta?.credential as StoredCredential && null;
     }
     if (this.opfsMockDb) {
killedBy: VaultService coverage helpers verifies current password using sqlite metadata and falls back correctly
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/vaultService.ts:103:9
       ).getMetadata?.();
       return (meta?.credential as StoredCredential) ?? null;
     }
-    if (this.opfsMockDb) {
+    if (false) {
       const meta = await (
         this.opfsMockDb as unknown as {
killedBy: VaultService Security & Cryptography 24. getAuthCredential: opfsMockDb üzerinden kimlik doğrulama bilgisini okumalı
statusReason: expected undefined to be 'hash123' // Object.is equality

[Killed] ConditionalExpression
src/vaultService.ts:103:9
       ).getMetadata?.();
       return (meta?.credential as StoredCredential) ?? null;
     }
-    if (this.opfsMockDb) {
+    if (true) {
       const meta = await (
         this.opfsMockDb as unknown as {
killedBy: VaultService coverage helpers verifies password state and auth migration helpers
statusReason: Cannot read properties of null (reading 'get')

[Killed] StringLiteral
src/vaultService.ts:108:13
         this.opfsMockDb as unknown as {
           get: (store: string, key: string) => Promise<Record<string, unknown> | undefined>;
         }
-      ).get('meta', 'auth');
+      ).get("", 'auth');
       return (meta?.credential as StoredCredential) ?? null;
     }
killedBy: VaultService Security & Cryptography 24. getAuthCredential: opfsMockDb üzerinden kimlik doğrulama bilgisini okumalı
statusReason: expected "vi.fn()" to be called with arguments: [ 'meta', 'auth' ]

Received: 

  1st vi.fn() call:

  [
-   "meta",

[Killed] LogicalOperator
src/vaultService.ts:109:14
           get: (store: string, key: string) => Promise<Record<string, unknown> | undefined>;
         }
       ).get('meta', 'auth');
-      return (meta?.credential as StoredCredential) ?? null;
+      return meta?.credential as StoredCredential && null;
     }
     return null;
killedBy: VaultService Security & Cryptography 24. getAuthCredential: opfsMockDb üzerinden kimlik doğrulama bilgisini okumalı
statusReason: expected undefined to be 'hash123' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:114:54
     return null;
   }
 
-  public normalizeSearchValue(value: string): string {
-    return VaultSearchIndexer.normalize(value);
-  }
+  public normalizeSearchValue(value: string): string {}
 
   public tokenizeSearchFields(fields: string[]): string[] {
killedBy: VaultService coverage helpers calculates strength, normalizes search terms and tokenizes prefixes
statusReason: expected undefined to be 'c lg n sifre   123' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:118:59
     return VaultSearchIndexer.normalize(value);
   }
 
-  public tokenizeSearchFields(fields: string[]): string[] {
-    return VaultSearchIndexer.tokenize(fields);
-  }
+  public tokenizeSearchFields(fields: string[]): string[] {}
 
   private async getHmacKey(): Promise<CryptoKey> {
killedBy: VaultService coverage helpers calculates strength, normalizes search terms and tokenizes prefixes
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/vaultService.ts:122:50
     return VaultSearchIndexer.tokenize(fields);
   }
 
-  private async getHmacKey(): Promise<CryptoKey> {
-    return VaultSearchIndexer.getOrCreateHmacKey(this.sensitiveMaterial, this.searchIndexHmacKey);
-  }
+  private async getHmacKey(): Promise<CryptoKey> {}
 
   public async hashSearchToken(token: string): Promise<string> {
killedBy: VaultService coverage helpers builds search indexes through the hashing helper
statusReason: Failed to execute 'sign' on 'SubtleCrypto': 2nd argument is not of type CryptoKey.

[Killed] BlockStatement
src/vaultService.ts:126:64
     return VaultSearchIndexer.getOrCreateHmacKey(this.sensitiveMaterial, this.searchIndexHmacKey);
   }
 
-  public async hashSearchToken(token: string): Promise<string> {
-    if (!this.aesKey) return '';
-    const hmacKey = await this.getHmacKey();
-    return VaultSearchIndexer.hashToken(token, hmacKey);
-  }
+  public async hashSearchToken(token: string): Promise<string> {}
 
   public async buildSearchIndex(
killedBy: VaultService Security & Cryptography 29. hashSearchToken, buildSearchIndex, buildMetadataAtRest return empty when locked
statusReason: expected undefined to be '' // Object.is equality

[Killed] BooleanLiteral
src/vaultService.ts:127:9
   }
 
   public async hashSearchToken(token: string): Promise<string> {
-    if (!this.aesKey) return '';
+    if (this.aesKey) return '';
     const hmacKey = await this.getHmacKey();
     return VaultSearchIndexer.hashToken(token, hmacKey);
killedBy: VaultService Security & Cryptography 29. hashSearchToken, buildSearchIndex, buildMetadataAtRest return empty when locked
statusReason: Search index key unavailable

[Killed] ConditionalExpression
src/vaultService.ts:127:9
   }
 
   public async hashSearchToken(token: string): Promise<string> {
-    if (!this.aesKey) return '';
+    if (false) return '';
     const hmacKey = await this.getHmacKey();
     return VaultSearchIndexer.hashToken(token, hmacKey);
killedBy: VaultService Security & Cryptography 29. hashSearchToken, buildSearchIndex, buildMetadataAtRest return empty when locked
statusReason: Search index key unavailable

[Killed] BlockStatement
src/vaultService.ts:138:24
     website: string,
     category: string,
     tags: string[]
-  ): Promise<string[]> {
-    if (!this.aesKey) return [];
-    const hmacKey = await this.getHmacKey();
-    return VaultSearchIndexer.buildIndex({ title, username, website, category, tags }, async (t) =>
-      VaultSearchIndexer.hashToken(t, hmacKey)
-    );
-  }
+  ): Promise<string[]> {}
 
   public async prepareEntryMetadataForUse(entry: VaultEntry) {
killedBy: VaultService Security & Cryptography 25. buildSearchIndex: Tokenları gerçekten hashlemeli (undefined dönmemeli)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/vaultService.ts:139:9
     category: string,
     tags: string[]
   ): Promise<string[]> {
-    if (!this.aesKey) return [];
+    if (false) return [];
     const hmacKey = await this.getHmacKey();
     return VaultSearchIndexer.buildIndex({ title, username, website, category, tags }, async (t) =>
killedBy: VaultService Security & Cryptography 29. hashSearchToken, buildSearchIndex, buildMetadataAtRest return empty when locked
statusReason: Search index key unavailable

[Killed] BooleanLiteral
src/vaultService.ts:139:9
     category: string,
     tags: string[]
   ): Promise<string[]> {
-    if (!this.aesKey) return [];
+    if (this.aesKey) return [];
     const hmacKey = await this.getHmacKey();
     return VaultSearchIndexer.buildIndex({ title, username, website, category, tags }, async (t) =>
killedBy: VaultService Security & Cryptography 25. buildSearchIndex: Tokenları gerçekten hashlemeli (undefined dönmemeli)
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
src/vaultService.ts:141:88
   ): Promise<string[]> {
     if (!this.aesKey) return [];
     const hmacKey = await this.getHmacKey();
-    return VaultSearchIndexer.buildIndex({ title, username, website, category, tags }, async (t) =>
-      VaultSearchIndexer.hashToken(t, hmacKey)
+    return VaultSearchIndexer.buildIndex({ title, username, website, category, tags }, () => undefined
     );
   }
killedBy: VaultService Security & Cryptography 25. buildSearchIndex: Tokenları gerçekten hashlemeli (undefined dönmemeli)
statusReason: expected undefined to be type of 'string'

[Killed] BlockStatement
src/vaultService.ts:150:77
     const res = await VaultCryptoService.prepareEntryMetadataForUse(entry, this.aesKey);
 
     // Gen search_index if missing during lazy migration
-    if (!res.uiEntry.search_index || res.uiEntry.search_index.length === 0) {
-      if (res.uiEntry.title) {
-        const hmacKey = await this.getHmacKey();
-        const rawTokens = [
-          res.uiEntry.title,
-          res.uiEntry.username || '',
-          res.uiEntry.website || '',
-          res.uiEntry.category || '',
-          ...(res.uiEntry.tags || []),
-        ];
-        const tokens = VaultSearchIndexer.tokenize(rawTokens);
-        const uniqueTokens = Array.from(new Set(tokens));
-        const searchIndex: string[] = [];
-        for (const token of uniqueTokens) {
-          const hash = await VaultSearchIndexer.hashToken(token, hmacKey);
-          searchIndex.push(hash);
-        }
-        res.uiEntry.search_index = searchIndex;
-        if (res.storageEntry) {
-          res.storageEntry.search_index = searchIndex;
-        } else {
-          res.storageEntry = { ...res.uiEntry };
-        }
-      }
-    }
+    if (!res.uiEntry.search_index || res.uiEntry.search_index.length === 0) {}
     return res;
   }
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/vaultService.ts:150:38
     const res = await VaultCryptoService.prepareEntryMetadataForUse(entry, this.aesKey);
 
     // Gen search_index if missing during lazy migration
-    if (!res.uiEntry.search_index || res.uiEntry.search_index.length === 0) {
+    if (!res.uiEntry.search_index || res.uiEntry.search_index.length !== 0) {
       if (res.uiEntry.title) {
         const hmacKey = await this.getHmacKey();
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/vaultService.ts:151:11
 
     // Gen search_index if missing during lazy migration
     if (!res.uiEntry.search_index || res.uiEntry.search_index.length === 0) {
-      if (res.uiEntry.title) {
+      if (false) {
         const hmacKey = await this.getHmacKey();
         const rawTokens = [
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vaultService.ts:151:30
 
     // Gen search_index if missing during lazy migration
     if (!res.uiEntry.search_index || res.uiEntry.search_index.length === 0) {
-      if (res.uiEntry.title) {
-        const hmacKey = await this.getHmacKey();
-        const rawTokens = [
-          res.uiEntry.title,
-          res.uiEntry.username || '',
-          res.uiEntry.website || '',
-          res.uiEntry.category || '',
-          ...(res.uiEntry.tags || []),
-        ];
-        const tokens = VaultSearchIndexer.tokenize(rawTokens);
-        const uniqueTokens = Array.from(new Set(tokens));
-        const searchIndex: string[] = [];
-        for (const token of uniqueTokens) {
-          const hash = await VaultSearchIndexer.hashToken(token, hmacKey);
-          searchIndex.push(hash);
-        }
-        res.uiEntry.search_index = searchIndex;
-        if (res.storageEntry) {
-          res.storageEntry.search_index = searchIndex;
-        } else {
-          res.storageEntry = { ...res.uiEntry };
-        }
-      }
+      if (res.uiEntry.title) {}
     }
     return res;
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/vaultService.ts:155:11
         const hmacKey = await this.getHmacKey();
         const rawTokens = [
           res.uiEntry.title,
-          res.uiEntry.username || '',
+          true,
           res.uiEntry.website || '',
           res.uiEntry.category || '',
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected undefined to be type of 'string'

[Survived] LogicalOperator
src/vaultService.ts:155:11
         const hmacKey = await this.getHmacKey();
         const rawTokens = [
           res.uiEntry.title,
-          res.uiEntry.username || '',
+          res.uiEntry.username && '',
           res.uiEntry.website || '',
           res.uiEntry.category || '',

[Killed] ConditionalExpression
src/vaultService.ts:156:11
         const rawTokens = [
           res.uiEntry.title,
           res.uiEntry.username || '',
-          res.uiEntry.website || '',
+          true,
           res.uiEntry.category || '',
           ...(res.uiEntry.tags || []),
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected undefined to be type of 'string'

[Survived] LogicalOperator
src/vaultService.ts:156:11
         const rawTokens = [
           res.uiEntry.title,
           res.uiEntry.username || '',
-          res.uiEntry.website || '',
+          res.uiEntry.website && '',
           res.uiEntry.category || '',
           ...(res.uiEntry.tags || []),

[Killed] ConditionalExpression
src/vaultService.ts:157:11
           res.uiEntry.title,
           res.uiEntry.username || '',
           res.uiEntry.website || '',
-          res.uiEntry.category || '',
+          true,
           ...(res.uiEntry.tags || []),
         ];
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected undefined to be type of 'string'

[Survived] LogicalOperator
src/vaultService.ts:157:11
           res.uiEntry.title,
           res.uiEntry.username || '',
           res.uiEntry.website || '',
-          res.uiEntry.category || '',
+          res.uiEntry.category && '',
           ...(res.uiEntry.tags || []),
         ];

[Killed] LogicalOperator
src/vaultService.ts:158:15
           res.uiEntry.username || '',
           res.uiEntry.website || '',
           res.uiEntry.category || '',
-          ...(res.uiEntry.tags || []),
+          ...(res.uiEntry.tags && []),
         ];
         const tokens = VaultSearchIndexer.tokenize(rawTokens);
killedBy: VaultService Security & Cryptography 32. prepareEntryMetadataForUse constructs search_index correctly
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
src/vaultService.ts:158:15
           res.uiEntry.username || '',
           res.uiEntry.website || '',
           res.uiEntry.category || '',
-          ...(res.uiEntry.tags || []),
+          ...(false),
         ];
         const tokens = VaultSearchIndexer.tokenize(rawTokens);
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected undefined to be type of 'string'

[Killed] BlockStatement
src/vaultService.ts:163:43
         const tokens = VaultSearchIndexer.tokenize(rawTokens);
         const uniqueTokens = Array.from(new Set(tokens));
         const searchIndex: string[] = [];
-        for (const token of uniqueTokens) {
-          const hash = await VaultSearchIndexer.hashToken(token, hmacKey);
-          searchIndex.push(hash);
-        }
+        for (const token of uniqueTokens) {}
         res.uiEntry.search_index = searchIndex;
         if (res.storageEntry) {
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vaultService.ts:168:31
           searchIndex.push(hash);
         }
         res.uiEntry.search_index = searchIndex;
-        if (res.storageEntry) {
-          res.storageEntry.search_index = searchIndex;
-        } else {
+        if (res.storageEntry) {} else {
           res.storageEntry = { ...res.uiEntry };
         }
killedBy: VaultService Security & Cryptography 32. prepareEntryMetadataForUse constructs search_index correctly
statusReason: expected undefined to deeply equal [ …(10) ]

[Survived] ConditionalExpression
src/vaultService.ts:168:13
           searchIndex.push(hash);
         }
         res.uiEntry.search_index = searchIndex;
-        if (res.storageEntry) {
+        if (true) {
           res.storageEntry.search_index = searchIndex;
         } else {

[NoCoverage] BlockStatement
src/vaultService.ts:170:16
         res.uiEntry.search_index = searchIndex;
         if (res.storageEntry) {
           res.storageEntry.search_index = searchIndex;
-        } else {
-          res.storageEntry = { ...res.uiEntry };
-        }
+        } else {}
       }
     }

[Killed] BlockStatement
src/vaultService.ts:184:39
     website: string,
     category: string,
     tags: string[]
-  ): Promise<Record<string, unknown>> {
-    if (!this.aesKey) return {};
-    return VaultCryptoService.buildMetadataAtRest({
-      title,
-      username,
-      website,
-      category,
-      tags,
-      aesKey: this.aesKey,
-      getSearchIndexHmacKey: () => this.getHmacKey(),
-    });
-  }
+  ): Promise<Record<string, unknown>> {}
 
   public async encryptAttachmentMetadataList(
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Cannot destructure property 'title' of '(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/vaultService.ts:185:9
     category: string,
     tags: string[]
   ): Promise<Record<string, unknown>> {
-    if (!this.aesKey) return {};
+    if (true) return {};
     return VaultCryptoService.buildMetadataAtRest({
       title,
killedBy: VaultService Security & Cryptography 4. Metadata Encryption + Attachment Metadata: At-rest plaintext sizintisi olmamali
statusReason: expected undefined to be type of 'string'

[Killed] ConditionalExpression
src/vaultService.ts:185:9
     category: string,
     tags: string[]
   ): Promise<Record<string, unknown>> {
-    if (!this.aesKey) return {};
+    if (false) return {};
     return VaultCryptoService.buildMetadataAtRest({
       title,
killedBy: VaultService Security & Cryptography 29. hashSearchToken, buildSearchIndex, buildMetadataAtRest return empty when locked
statusReason: expected { title: 'T', username: 'U', …(3) } to deeply equal {}

[Killed] ArrowFunction
src/vaultService.ts:193:30
       category,
       tags,
       aesKey: this.aesKey,
-      getSearchIndexHmacKey: () => this.getHmacKey(),
+      getSearchIndexHmacKey: () => undefined,
     });
   }
killedBy: Private Search Index Benchmark indexes and queries medium dataset in acceptable time
statusReason: Failed to execute 'sign' on 'SubtleCrypto': 2nd argument is not of type CryptoKey.

[Killed] BlockStatement
src/vaultService.ts:199:37
 
   public async encryptAttachmentMetadataList(
     attachments: Array<{ id: string; name: string; type: string; size: number }>
-  ): Promise<VaultAttachmentMeta[]> {
-    if (
-      !EncryptionProfiles.isFieldEncrypted(SecureAppSettings.getEncryptionProfile(), 'attachments')
-    ) {
-      return attachments as unknown as Array<VaultAttachmentMeta>;
-    }
-    return VaultCryptoService.encryptAttachmentMetadataList(
-      attachments as VaultAttachmentMeta[],
-      this.aesKey
-    );
-  }
+  ): Promise<VaultAttachmentMeta[]> {}
 
   public async hydrateRichSensitiveFields(entries: VaultEntry[]): Promise<void> {
killedBy: VaultService Security & Cryptography 4. Metadata Encryption + Attachment Metadata: At-rest plaintext sizintisi olmamali
statusReason: Cannot read properties of undefined (reading '0')
