[Killed] ConditionalExpression
src/vaultService.ts:201:7
     attachments: Array<{ id: string; name: string; type: string; size: number }>
   ): Promise<VaultAttachmentMeta[]> {
     if (
-      !EncryptionProfiles.isFieldEncrypted(SecureAppSettings.getEncryptionProfile(), 'attachments')
+      false
     ) {
       return attachments as unknown as Array<VaultAttachmentMeta>;
killedBy: VaultService Security & Cryptography 31. encryptAttachmentMetadataList skips encryption if profile does not encrypt attachments
statusReason: expected [] to be [ { id: 'a', name: 'Original', …(2) } ] // Object.is equality

[Killed] BooleanLiteral
src/vaultService.ts:201:7
     attachments: Array<{ id: string; name: string; type: string; size: number }>
   ): Promise<VaultAttachmentMeta[]> {
     if (
-      !EncryptionProfiles.isFieldEncrypted(SecureAppSettings.getEncryptionProfile(), 'attachments')
+      EncryptionProfiles.isFieldEncrypted(SecureAppSettings.getEncryptionProfile(), 'attachments')
     ) {
       return attachments as unknown as Array<VaultAttachmentMeta>;
killedBy: VaultService Security & Cryptography 4. Metadata Encryption + Attachment Metadata: At-rest plaintext sizintisi olmamali
statusReason: expected undefined to be type of 'string'

[Killed] BlockStatement
src/vaultService.ts:202:7
   ): Promise<VaultAttachmentMeta[]> {
     if (
       !EncryptionProfiles.isFieldEncrypted(SecureAppSettings.getEncryptionProfile(), 'attachments')
-    ) {
-      return attachments as unknown as Array<VaultAttachmentMeta>;
-    }
+    ) {}
     return VaultCryptoService.encryptAttachmentMetadataList(
       attachments as VaultAttachmentMeta[],
killedBy: VaultService Security & Cryptography 31. encryptAttachmentMetadataList skips encryption if profile does not encrypt attachments
statusReason: expected [] to be [ { id: 'a', name: 'Original', …(2) } ] // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:211:81
     );
   }
 
-  public async hydrateRichSensitiveFields(entries: VaultEntry[]): Promise<void> {
-    return VaultCryptoService.hydrateRichSensitiveFields(entries, this.aesKey);
-  }
+  public async hydrateRichSensitiveFields(entries: VaultEntry[]): Promise<void> {}
 
   public registerAuthFailure(scope: 'unlock' | 'reauth', dbName: string): void {
killedBy: VaultService Security & Cryptography 6. Card ve Identity ozel tip detaylari sifreli olarak saklanip UI icin desifre edilmelidir
statusReason: expected undefined to be 'Jane Doe' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:215:80
     return VaultCryptoService.hydrateRichSensitiveFields(entries, this.aesKey);
   }
 
-  public registerAuthFailure(scope: 'unlock' | 'reauth', dbName: string): void {
-    const key = `${scope}:${dbName}`;
-    const entry = this._authFailureLog.get(key) || { count: 0, lastTs: 0 };
-    entry.count += 1;
-    entry.lastTs = Date.now();
-    this._authFailureLog.set(key, entry);
-  }
+  public registerAuthFailure(scope: 'unlock' | 'reauth', dbName: string): void {}
 
   public enforceAuthRateLimit(scope: 'unlock' | 'reauth', dbName: string): void {
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vaultService.ts:217:19
 
   public registerAuthFailure(scope: 'unlock' | 'reauth', dbName: string): void {
     const key = `${scope}:${dbName}`;
-    const entry = this._authFailureLog.get(key) || { count: 0, lastTs: 0 };
+    const entry = false;
     entry.count += 1;
     entry.lastTs = Date.now();
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: Cannot create property 'count' on boolean 'false'

[Killed] LogicalOperator
src/vaultService.ts:217:19
 
   public registerAuthFailure(scope: 'unlock' | 'reauth', dbName: string): void {
     const key = `${scope}:${dbName}`;
-    const entry = this._authFailureLog.get(key) || { count: 0, lastTs: 0 };
+    const entry = this._authFailureLog.get(key) && {
+  count: 0,
+  lastTs: 0
+};
     entry.count += 1;
     entry.lastTs = Date.now();
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] AssignmentOperator
src/vaultService.ts:218:5
   public registerAuthFailure(scope: 'unlock' | 'reauth', dbName: string): void {
     const key = `${scope}:${dbName}`;
     const entry = this._authFailureLog.get(key) || { count: 0, lastTs: 0 };
-    entry.count += 1;
+    entry.count -= 1;
     entry.lastTs = Date.now();
     this._authFailureLog.set(key, entry);
killedBy: VaultService coverage helpers applies exponential auth backoff and lockout windows
statusReason: expected 'expected-rate-limit-error' to be 'RATE_LIMITED' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:223:81
     this._authFailureLog.set(key, entry);
   }
 
-  public enforceAuthRateLimit(scope: 'unlock' | 'reauth', dbName: string): void {
-    const key = `${scope}:${dbName}`;
-    const entry = this._authFailureLog.get(key);
-    if (!entry || entry.count === 0) return;
-    const baseDelay = 1000; // 1 second base
-    const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
-    const elapsed = Date.now() - entry.lastTs;
-    if (elapsed < delay) {
-      const err = new Error('RATE_LIMITED') as Error & { retryAfterMs: number };
-      err.retryAfterMs = delay - elapsed;
-      throw err;
-    }
-  }
+  public enforceAuthRateLimit(scope: 'unlock' | 'reauth', dbName: string): void {}
 
   public registerAuthSuccess(scope: 'unlock' | 'reauth', dbName: string): void {
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/vaultService.ts:224:17
   }
 
   public enforceAuthRateLimit(scope: 'unlock' | 'reauth', dbName: string): void {
-    const key = `${scope}:${dbName}`;
+    const key = ``;
     const entry = this._authFailureLog.get(key);
     if (!entry || entry.count === 0) return;
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vaultService.ts:226:19
   public enforceAuthRateLimit(scope: 'unlock' | 'reauth', dbName: string): void {
     const key = `${scope}:${dbName}`;
     const entry = this._authFailureLog.get(key);
-    if (!entry || entry.count === 0) return;
+    if (!entry || entry.count !== 0) return;
     const baseDelay = 1000; // 1 second base
     const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/vaultService.ts:226:9
   public enforceAuthRateLimit(scope: 'unlock' | 'reauth', dbName: string): void {
     const key = `${scope}:${dbName}`;
     const entry = this._authFailureLog.get(key);
-    if (!entry || entry.count === 0) return;
+    if (entry || entry.count === 0) return;
     const baseDelay = 1000; // 1 second base
     const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/vaultService.ts:228:43
     const entry = this._authFailureLog.get(key);
     if (!entry || entry.count === 0) return;
     const baseDelay = 1000; // 1 second base
-    const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
+    const delay = baseDelay * Math.pow(2, Math.max(entry.count - 1, 20));
     const elapsed = Date.now() - entry.lastTs;
     if (elapsed < delay) {
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to not throw an error but 'Error: RATE_LIMITED' was thrown

[Killed] ArithmeticOperator
src/vaultService.ts:228:19
     const entry = this._authFailureLog.get(key);
     if (!entry || entry.count === 0) return;
     const baseDelay = 1000; // 1 second base
-    const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
+    const delay = baseDelay / Math.pow(2, Math.min(entry.count - 1, 20));
     const elapsed = Date.now() - entry.lastTs;
     if (elapsed < delay) {
killedBy: VaultService coverage helpers applies exponential auth backoff and lockout windows
statusReason: expected 'expected-rate-limit-error' to be 'RATE_LIMITED' // Object.is equality

[Killed] ArithmeticOperator
src/vaultService.ts:229:21
     if (!entry || entry.count === 0) return;
     const baseDelay = 1000; // 1 second base
     const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
-    const elapsed = Date.now() - entry.lastTs;
+    const elapsed = Date.now() + entry.lastTs;
     if (elapsed < delay) {
       const err = new Error('RATE_LIMITED') as Error & { retryAfterMs: number };
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vaultService.ts:230:9
     const baseDelay = 1000; // 1 second base
     const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
     const elapsed = Date.now() - entry.lastTs;
-    if (elapsed < delay) {
+    if (elapsed >= delay) {
       const err = new Error('RATE_LIMITED') as Error & { retryAfterMs: number };
       err.retryAfterMs = delay - elapsed;
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vaultService.ts:230:9
     const baseDelay = 1000; // 1 second base
     const delay = baseDelay * Math.pow(2, Math.min(entry.count - 1, 20));
     const elapsed = Date.now() - entry.lastTs;
-    if (elapsed < delay) {
+    if (false) {
       const err = new Error('RATE_LIMITED') as Error & { retryAfterMs: number };
       err.retryAfterMs = delay - elapsed;
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to throw an error

[Survived] ArithmeticOperator
src/vaultService.ts:232:26
     const elapsed = Date.now() - entry.lastTs;
     if (elapsed < delay) {
       const err = new Error('RATE_LIMITED') as Error & { retryAfterMs: number };
-      err.retryAfterMs = delay - elapsed;
+      err.retryAfterMs = delay + elapsed;
       throw err;
     }

[Killed] BlockStatement
src/vaultService.ts:237:80
     }
   }
 
-  public registerAuthSuccess(scope: 'unlock' | 'reauth', dbName: string): void {
-    const key = `${scope}:${dbName}`;
-    this._authFailureLog.delete(key);
-  }
+  public registerAuthSuccess(scope: 'unlock' | 'reauth', dbName: string): void {}
 
   public resolveArgon2Params(): NonNullable<StoredCredential['argon2']> {
killedBy: VaultService Security & Cryptography 21. Auth Rate Limiting: Hatalı denemeler sonrası gecikme uygulamalı
statusReason: expected [Function] to not throw an error but 'Error: RATE_LIMITED' was thrown

[Killed] StringLiteral
src/vaultService.ts:238:17
   }
 
   public registerAuthSuccess(scope: 'unlock' | 'reauth', dbName: string): void {
-    const key = `${scope}:${dbName}`;
+    const key = ``;
     this._authFailureLog.delete(key);
   }
killedBy: VaultService coverage helpers applies exponential auth backoff and lockout windows
statusReason: expected [Function] to not throw an error but 'Error: RATE_LIMITED' was thrown

[Killed] BlockStatement
src/vaultService.ts:242:73
     this._authFailureLog.delete(key);
   }
 
-  public resolveArgon2Params(): NonNullable<StoredCredential['argon2']> {
-    return VaultAuthService.calibrateArgon2Params();
-  }
+  public resolveArgon2Params(): NonNullable<StoredCredential['argon2']> {}
 
   // ─── Orkestrasyon Yardımcıları ───
killedBy: VaultService Security & Cryptography 30. resolveArgon2Params returns correctly calibrated params
statusReason: Cannot read properties of undefined (reading 'iterations')

[Killed] BlockStatement
src/vaultService.ts:247:71
   }
 
   // ─── Orkestrasyon Yardımcıları ───
-  private async withMutationLock<T>(fn: () => Promise<T>): Promise<T> {
-    const unlock = this.mutationLock;
-    let resolveLock: () => void;
-    this.mutationLock = new Promise((resolve) => {
-      resolveLock = resolve;
-    });
-    await unlock;
-    try {
-      return await fn();
-    } finally {
-      resolveLock!();
-    }
-  }
+  private async withMutationLock<T>(fn: () => Promise<T>): Promise<T> {}
 
   // ─── Bootstrap & Auth ───
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: expected 'e9khDE/1RF8OGefEn4ClPg==' not to be 'e9khDE/1RF8OGefEn4ClPg==' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:250:50
   private async withMutationLock<T>(fn: () => Promise<T>): Promise<T> {
     const unlock = this.mutationLock;
     let resolveLock: () => void;
-    this.mutationLock = new Promise((resolve) => {
-      resolveLock = resolve;
-    });
+    this.mutationLock = new Promise((resolve) => {});
     await unlock;
     try {
killedBy: VaultService coverage helpers handles mutation lock failures and keeps queue reusable
statusReason: expected [Function] to throw error including 'lock-fail' but got 'resolveLock is not a function'

[Killed] BlockStatement
src/vaultService.ts:254:9
       resolveLock = resolve;
     });
     await unlock;
-    try {
-      return await fn();
-    } finally {
+    try {} finally {
       resolveLock!();
     }
killedBy: Private Search Index Benchmark indexes and queries medium dataset in acceptable time
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vaultService.ts:256:15
     await unlock;
     try {
       return await fn();
-    } finally {
-      resolveLock!();
-    }
+    } finally {}
   }
 
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Test timed out in 30000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] BooleanLiteral
src/vaultService.ts:266:30
     password: string,
     secretKey: string,
     dbName: string = 'aegis_opfs_vault',
-    isSetupAction: boolean = false
+    isSetupAction: boolean = true
   ): Promise<void> {
     const result = await VaultBootstrapService.initDb({

[Killed] ObjectLiteral
src/vaultService.ts:268:55
     dbName: string = 'aegis_opfs_vault',
     isSetupAction: boolean = false
   ): Promise<void> {
-    const result = await VaultBootstrapService.initDb({
-      password,
-      secretKey,
-      dbName,
-      isSetupAction,
-      deriveMasterKey: (pw, sk, salt) => this.deriveMasterKey(pw, sk, salt),
-      verifyPassword: (pw, stored) =>
-        VaultAuthService.verifyPassword(pw, stored, VaultAuthService.calibrateArgon2Params()),
-      migrateAuthCredentialToArgon2: (pw, old) =>
-        VaultAuthService.migrateCredentialToArgon2(
-          pw,
-          old,
-          VaultAuthService.calibrateArgon2Params()
-        ),
-      createAuthCredential: (pw) =>
-        VaultAuthService.createAuthCredential(pw, VaultAuthService.calibrateArgon2Params()),
-      getAesKey: () => this.aesKey,
-      setAesKey: (k) => {
-        this.aesKey = k;
-      },
-      setDecryptedEntriesCache: (e) => {
-        this.decryptedEntriesCache = e;
-      },
-    });
+    const result = await VaultBootstrapService.initDb({});
 
     // Anahtar derivedMasterKey callback'i tarafindan set edildi, ama garanti olsun diye return'den de alak
killedBy: Private Search Index Benchmark indexes and queries medium dataset in acceptable time
statusReason: deriveMasterKey is not a function

[Killed] ArrowFunction
src/vaultService.ts:273:24
       secretKey,
       dbName,
       isSetupAction,
-      deriveMasterKey: (pw, sk, salt) => this.deriveMasterKey(pw, sk, salt),
+      deriveMasterKey: () => undefined,
       verifyPassword: (pw, stored) =>
         VaultAuthService.verifyPassword(pw, stored, VaultAuthService.calibrateArgon2Params()),
killedBy: Private Search Index Benchmark indexes and queries medium dataset in acceptable time
statusReason: Cannot read properties of undefined (reading 'saltB64')

[Killed] ArrowFunction
src/vaultService.ts:274:23
       dbName,
       isSetupAction,
       deriveMasterKey: (pw, sk, salt) => this.deriveMasterKey(pw, sk, salt),
-      verifyPassword: (pw, stored) =>
-        VaultAuthService.verifyPassword(pw, stored, VaultAuthService.calibrateArgon2Params()),
+      verifyPassword: () => undefined,
       migrateAuthCredentialToArgon2: (pw, old) =>
         VaultAuthService.migrateCredentialToArgon2(
killedBy: VaultService Security & Cryptography 6. Auth Credential Migration: legacy PBKDF2 dogrulamasi Argon2id modeline otomatik tasinmali
statusReason: Invalid credentials

[Killed] ArrowFunction
src/vaultService.ts:276:38
       deriveMasterKey: (pw, sk, salt) => this.deriveMasterKey(pw, sk, salt),
       verifyPassword: (pw, stored) =>
         VaultAuthService.verifyPassword(pw, stored, VaultAuthService.calibrateArgon2Params()),
-      migrateAuthCredentialToArgon2: (pw, old) =>
-        VaultAuthService.migrateCredentialToArgon2(
-          pw,
-          old,
-          VaultAuthService.calibrateArgon2Params()
-        ),
+      migrateAuthCredentialToArgon2: () => undefined,
       createAuthCredential: (pw) =>
         VaultAuthService.createAuthCredential(pw, VaultAuthService.calibrateArgon2Params()),
killedBy: VaultService Security & Cryptography 6. Auth Credential Migration: legacy PBKDF2 dogrulamasi Argon2id modeline otomatik tasinmali
statusReason: Cannot read properties of undefined (reading 'scheme')

[Killed] ArrowFunction
src/vaultService.ts:282:29
           old,
           VaultAuthService.calibrateArgon2Params()
         ),
-      createAuthCredential: (pw) =>
-        VaultAuthService.createAuthCredential(pw, VaultAuthService.calibrateArgon2Params()),
+      createAuthCredential: () => undefined,
       getAesKey: () => this.aesKey,
       setAesKey: (k) => {
killedBy: VaultService Security & Cryptography 1. Yeni Kasa Oluşturma: Benzersiz Dinamik Salt Üretilmelidir
statusReason: Cannot read properties of undefined (reading 'verificationHash')

[Survived] ArrowFunction
src/vaultService.ts:284:18
         ),
       createAuthCredential: (pw) =>
         VaultAuthService.createAuthCredential(pw, VaultAuthService.calibrateArgon2Params()),
-      getAesKey: () => this.aesKey,
+      getAesKey: () => undefined,
       setAesKey: (k) => {
         this.aesKey = k;

[Survived] BlockStatement
src/vaultService.ts:285:25
       createAuthCredential: (pw) =>
         VaultAuthService.createAuthCredential(pw, VaultAuthService.calibrateArgon2Params()),
       getAesKey: () => this.aesKey,
-      setAesKey: (k) => {
-        this.aesKey = k;
-      },
+      setAesKey: (k) => {},
       setDecryptedEntriesCache: (e) => {
         this.decryptedEntriesCache = e;

[NoCoverage] BlockStatement
src/vaultService.ts:288:40
       setAesKey: (k) => {
         this.aesKey = k;
       },
-      setDecryptedEntriesCache: (e) => {
-        this.decryptedEntriesCache = e;
-      },
+      setDecryptedEntriesCache: (e) => {},
     });
 

[Survived] LogicalOperator
src/vaultService.ts:294:9
     });
 
     // Anahtar derivedMasterKey callback'i tarafindan set edildi, ama garanti olsun diye return'den de alak
-    if (result.aesKey && !this.aesKey) {
+    if (result.aesKey || !this.aesKey) {
       this.aesKey = result.aesKey;
     }

[Survived] ConditionalExpression
src/vaultService.ts:294:9
     });
 
     // Anahtar derivedMasterKey callback'i tarafindan set edildi, ama garanti olsun diye return'den de alak
-    if (result.aesKey && !this.aesKey) {
+    if (false) {
       this.aesKey = result.aesKey;
     }

[Killed] BooleanLiteral
src/vaultService.ts:300:24
     this.opfsMockDb = result.opfsMockDb;
     this.sqliteDb = result.sqliteDb;
     this.useSQLite = result.useSQLite;
-    this.isConnected = true;
+    this.isConnected = false;
     this.decryptedEntriesCache = null;
     if (!this.activeVaultDbNames.includes(dbName)) {
killedBy: VaultService Security & Cryptography 2. Mevcut Kasa Açma: Eski Salt ve Şifre Modelleri ile Uyumluluk (Legacy Fallback)
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/vaultService.ts:302:9
     this.useSQLite = result.useSQLite;
     this.isConnected = true;
     this.decryptedEntriesCache = null;
-    if (!this.activeVaultDbNames.includes(dbName)) {
+    if (this.activeVaultDbNames.includes(dbName)) {
       this.activeVaultDbNames.push(dbName);
     }

[Survived] ConditionalExpression
src/vaultService.ts:302:9
     this.useSQLite = result.useSQLite;
     this.isConnected = true;
     this.decryptedEntriesCache = null;
-    if (!this.activeVaultDbNames.includes(dbName)) {
+    if (false) {
       this.activeVaultDbNames.push(dbName);
     }

[Survived] BooleanLiteral
src/vaultService.ts:307:61
     }
     this.aesKey = result.aesKey;
     this.sensitiveMaterial = result.sensitiveMaterial;
-    console.log('[VaultService] initDb SUCCESS:', { hasKey: !!this.aesKey });
+    console.log('[VaultService] initDb SUCCESS:', { hasKey: !this.aesKey });
   }
 

[Killed] BlockStatement
src/vaultService.ts:314:85
     password: string,
     secretKey: string,
     saltB64?: string
-  ): Promise<{ saltB64: string; aesKey: CryptoKey; sensitiveMaterial: Uint8Array }> {
-    const result = await VaultAuthService.deriveMasterKey({
-      password,
-      secretKey,
-      saltB64,
-      params: VaultAuthService.calibrateArgon2Params(),
-    });
-    this.aesKey = result.aesKey;
-    this.sensitiveMaterial = result.sensitiveMaterial;
-    await Promise.resolve();
-    return result;
-  }
+  ): Promise<{ saltB64: string; aesKey: CryptoKey; sensitiveMaterial: Uint8Array }> {}
 
   async wipeAllData(): Promise<void> {
killedBy: VaultService Security & Cryptography 1. Yeni Kasa Oluşturma: Benzersiz Dinamik Salt Üretilmelidir
statusReason: Cannot read properties of undefined (reading 'saltB64')

[Killed] BlockStatement
src/vaultService.ts:327:38
     return result;
   }
 
-  async wipeAllData(): Promise<void> {
-    await VaultBootstrapService.wipeAllData(this.opfsMockDb, this.sqliteDb);
-    localStorage.removeItem('aegis_active_vault');
-    localStorage.removeItem('aegis_vault_remember_me');
-    await this.lock();
-  }
+  async wipeAllData(): Promise<void> {}
 
   async exportVault(): Promise<string> {
killedBy: VaultService Security & Cryptography 16. Fabrika Ayarlarına Sıfırlama: wipeAllData ile her şeyi temizleme
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:334:40
     await this.lock();
   }
 
-  async exportVault(): Promise<string> {
-    const entries = await this.getPasswords();
-    return JSON.stringify(entries);
-  }
+  async exportVault(): Promise<string> {}
 
   // ─── Entry CRUD ───
killedBy: VaultService Security & Cryptography 7. Kasa Aktarma: Tum verilerin JSON olarak export edilmesi
statusReason: "undefined" is not valid JSON

[Killed] BooleanLiteral
src/vaultService.ts:342:11
   // ─── Entry CRUD ───
   async addPassword(entry: Partial<VaultEntry>): Promise<number> {
     return this.withMutationLock(async () => {
-      if (!this.aesKey) {
+      if (this.aesKey) {
         console.error('[VaultService] Blocking addPassword: NO KEY AVAILABLE');
         throw new AegisError('AUTH_VAULT_LOCKED', 'Vault encryption key not initialized', {
killedBy: Private Search Index Benchmark indexes and queries medium dataset in acceptable time
statusReason: Vault encryption key not initialized

[Killed] ConditionalExpression
src/vaultService.ts:342:11
   // ─── Entry CRUD ───
   async addPassword(entry: Partial<VaultEntry>): Promise<number> {
     return this.withMutationLock(async () => {
-      if (!this.aesKey) {
+      if (true) {
         console.error('[VaultService] Blocking addPassword: NO KEY AVAILABLE');
         throw new AegisError('AUTH_VAULT_LOCKED', 'Vault encryption key not initialized', {
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Vault encryption key not initialized

[NoCoverage] StringLiteral
src/vaultService.ts:344:30
     return this.withMutationLock(async () => {
       if (!this.aesKey) {
         console.error('[VaultService] Blocking addPassword: NO KEY AVAILABLE');
-        throw new AegisError('AUTH_VAULT_LOCKED', 'Vault encryption key not initialized', {
+        throw new AegisError("", 'Vault encryption key not initialized', {
           severity: 'high',
           context: { source: 'VaultService', operation: 'addPassword' },

[NoCoverage] StringLiteral
src/vaultService.ts:345:21
       if (!this.aesKey) {
         console.error('[VaultService] Blocking addPassword: NO KEY AVAILABLE');
         throw new AegisError('AUTH_VAULT_LOCKED', 'Vault encryption key not initialized', {
-          severity: 'high',
+          severity: "",
           context: { source: 'VaultService', operation: 'addPassword' },
         });

[NoCoverage] StringLiteral
src/vaultService.ts:346:57
         console.error('[VaultService] Blocking addPassword: NO KEY AVAILABLE');
         throw new AegisError('AUTH_VAULT_LOCKED', 'Vault encryption key not initialized', {
           severity: 'high',
-          context: { source: 'VaultService', operation: 'addPassword' },
+          context: { source: 'VaultService', operation: "" },
         });
       }

[NoCoverage] StringLiteral
src/vaultService.ts:346:30
         console.error('[VaultService] Blocking addPassword: NO KEY AVAILABLE');
         throw new AegisError('AUTH_VAULT_LOCKED', 'Vault encryption key not initialized', {
           severity: 'high',
-          context: { source: 'VaultService', operation: 'addPassword' },
+          context: { source: "", operation: 'addPassword' },
         });
       }

[Killed] ArithmeticOperator
src/vaultService.ts:355:43
         opfsMockDb: this.opfsMockDb,
         sqliteDb: this.sqliteDb,
         useSQLite: this.useSQLite,
-        generateEntryId: () => Math.floor(Math.random() * 1000000000),
+        generateEntryId: () => Math.floor(Math.random() / 1000000000),
         calculateStrength: (password) => VaultCryptoService.calculateStrength(password),
         buildMetadataAtRest: (title, username, website, category, tags) =>
killedBy: VaultService Security & Cryptography 6. Card ve Identity ozel tip detaylari sifreli olarak saklanip UI icin desifre edilmelidir
statusReason: expected undefined to be type of 'string'

[Killed] ArrowFunction
src/vaultService.ts:355:26
         opfsMockDb: this.opfsMockDb,
         sqliteDb: this.sqliteDb,
         useSQLite: this.useSQLite,
-        generateEntryId: () => Math.floor(Math.random() * 1000000000),
+        generateEntryId: () => undefined,
         calculateStrength: (password) => VaultCryptoService.calculateStrength(password),
         buildMetadataAtRest: (title, username, website, category, tags) =>
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Data provided to an operation does not meet requirements.

[Survived] ArrowFunction
src/vaultService.ts:356:28
         sqliteDb: this.sqliteDb,
         useSQLite: this.useSQLite,
         generateEntryId: () => Math.floor(Math.random() * 1000000000),
-        calculateStrength: (password) => VaultCryptoService.calculateStrength(password),
+        calculateStrength: () => undefined,
         buildMetadataAtRest: (title, username, website, category, tags) =>
           this.buildMetadataAtRest(title, username, website, category, tags),

[Killed] ArrowFunction
src/vaultService.ts:357:30
         useSQLite: this.useSQLite,
         generateEntryId: () => Math.floor(Math.random() * 1000000000),
         calculateStrength: (password) => VaultCryptoService.calculateStrength(password),
-        buildMetadataAtRest: (title, username, website, category, tags) =>
-          this.buildMetadataAtRest(title, username, website, category, tags),
+        buildMetadataAtRest: () => undefined,
         normalizeCardDetails: (details) => VaultCryptoService.normalizeCardDetails(details),
         normalizeIdentityDetails: (details) => VaultCryptoService.normalizeIdentityDetails(details),
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Cannot destructure property 'title' of '(intermediate value)' as it is undefined.
