[Killed] ArrowFunction
src/vaultService.ts:359:31
         calculateStrength: (password) => VaultCryptoService.calculateStrength(password),
         buildMetadataAtRest: (title, username, website, category, tags) =>
           this.buildMetadataAtRest(title, username, website, category, tags),
-        normalizeCardDetails: (details) => VaultCryptoService.normalizeCardDetails(details),
+        normalizeCardDetails: () => undefined,
         normalizeIdentityDetails: (details) => VaultCryptoService.normalizeIdentityDetails(details),
         encryptAttachmentMetadataList: (attachments) =>
killedBy: VaultService Security & Cryptography 6. Card ve Identity ozel tip detaylari sifreli olarak saklanip UI icin desifre edilmelidir
statusReason: expected undefined to be type of 'string'

[Killed] ArrowFunction
src/vaultService.ts:360:35
         buildMetadataAtRest: (title, username, website, category, tags) =>
           this.buildMetadataAtRest(title, username, website, category, tags),
         normalizeCardDetails: (details) => VaultCryptoService.normalizeCardDetails(details),
-        normalizeIdentityDetails: (details) => VaultCryptoService.normalizeIdentityDetails(details),
+        normalizeIdentityDetails: () => undefined,
         encryptAttachmentMetadataList: (attachments) =>
           this.encryptAttachmentMetadataList(attachments),
killedBy: VaultService Security & Cryptography 6. Card ve Identity ozel tip detaylari sifreli olarak saklanip UI icin desifre edilmelidir
statusReason: expected undefined to be type of 'string'

[Survived] ArrowFunction
src/vaultService.ts:361:40
           this.buildMetadataAtRest(title, username, website, category, tags),
         normalizeCardDetails: (details) => VaultCryptoService.normalizeCardDetails(details),
         normalizeIdentityDetails: (details) => VaultCryptoService.normalizeIdentityDetails(details),
-        encryptAttachmentMetadataList: (attachments) =>
-          this.encryptAttachmentMetadataList(attachments),
+        encryptAttachmentMetadataList: () => undefined,
       });
       this.decryptedEntriesCache = null;

[Killed] BlockStatement
src/vaultService.ts:369:81
     });
   }
 
-  async updatePassword(id: number, entry: Partial<VaultEntry>): Promise<number> {
-    return this.addPassword({ ...entry, id });
-  }
+  async updatePassword(id: number, entry: Partial<VaultEntry>): Promise<number> {}
 
   async getPasswords(
killedBy: VaultService Security & Cryptography 10. Parola Güncelleme: updatePassword ile kayıt verilerini değiştirme
statusReason: expected 'Initial' to be 'Updated' // Object.is equality

[Killed] BooleanLiteral
src/vaultService.ts:376:24
   async getPasswords(
     searchQuery: string = '',
     categoryFilter: string = '',
-    isTrash: boolean = false,
+    isTrash: boolean = true,
     searchScope: 'all' | 'title' | 'username' | 'tags' = 'all'
   ): Promise<VaultEntry[]> {
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: expected 0 to be greater than or equal to 1

[Killed] StringLiteral
src/vaultService.ts:377:58
     searchQuery: string = '',
     categoryFilter: string = '',
     isTrash: boolean = false,
-    searchScope: 'all' | 'title' | 'username' | 'tags' = 'all'
+    searchScope: 'all' | 'title' | 'username' | 'tags' = ""
   ): Promise<VaultEntry[]> {
     const result = await VaultEntryService.getPasswords({
killedBy: Private Search Index Benchmark indexes and queries medium dataset in acceptable time
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/vaultService.ts:378:28
     categoryFilter: string = '',
     isTrash: boolean = false,
     searchScope: 'all' | 'title' | 'username' | 'tags' = 'all'
-  ): Promise<VaultEntry[]> {
-    const result = await VaultEntryService.getPasswords({
-      searchQuery,
-      categoryFilter,
-      isTrash,
-      searchScope,
-      aesKey: this.aesKey,
-      opfsMockDb: this.opfsMockDb,
-      sqliteDb: this.sqliteDb,
-      useSQLite: this.useSQLite,
-      decryptedEntriesCache: this.decryptedEntriesCache,
-      prepareEntryMetadataForUse: (entry) => this.prepareEntryMetadataForUse(entry),
-      hydrateRichSensitiveFields: (entries) => this.hydrateRichSensitiveFields(entries),
-    });
-
-    this.decryptedEntriesCache = result.cache;
-    return result.entries;
-  }
+  ): Promise<VaultEntry[]> {}
 
   async bulkAddPasswords(
killedBy: VaultService coverage helpers reports unlocked state and exports vault from sqlite backend
statusReason: "undefined" is not valid JSON

[Killed] ObjectLiteral
src/vaultService.ts:379:57
     isTrash: boolean = false,
     searchScope: 'all' | 'title' | 'username' | 'tags' = 'all'
   ): Promise<VaultEntry[]> {
-    const result = await VaultEntryService.getPasswords({
-      searchQuery,
-      categoryFilter,
-      isTrash,
-      searchScope,
-      aesKey: this.aesKey,
-      opfsMockDb: this.opfsMockDb,
-      sqliteDb: this.sqliteDb,
-      useSQLite: this.useSQLite,
-      decryptedEntriesCache: this.decryptedEntriesCache,
-      prepareEntryMetadataForUse: (entry) => this.prepareEntryMetadataForUse(entry),
-      hydrateRichSensitiveFields: (entries) => this.hydrateRichSensitiveFields(entries),
-    });
+    const result = await VaultEntryService.getPasswords({});
 
     this.decryptedEntriesCache = result.cache;
killedBy: VaultService coverage helpers reports unlocked state and exports vault from sqlite backend
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/vaultService.ts:389:35
       sqliteDb: this.sqliteDb,
       useSQLite: this.useSQLite,
       decryptedEntriesCache: this.decryptedEntriesCache,
-      prepareEntryMetadataForUse: (entry) => this.prepareEntryMetadataForUse(entry),
+      prepareEntryMetadataForUse: () => undefined,
       hydrateRichSensitiveFields: (entries) => this.hydrateRichSensitiveFields(entries),
     });
killedBy: VaultService Security & Cryptography 5. Private Search Index: legacy plaintext metadata kayitlari lazy migrate edilmeli
statusReason: expected undefined to be type of 'string'

[Killed] ArrowFunction
src/vaultService.ts:390:35
       useSQLite: this.useSQLite,
       decryptedEntriesCache: this.decryptedEntriesCache,
       prepareEntryMetadataForUse: (entry) => this.prepareEntryMetadataForUse(entry),
-      hydrateRichSensitiveFields: (entries) => this.hydrateRichSensitiveFields(entries),
+      hydrateRichSensitiveFields: () => undefined,
     });
 
killedBy: VaultService Security & Cryptography 6. Card ve Identity ozel tip detaylari sifreli olarak saklanip UI icin desifre edilmelidir
statusReason: expected undefined to be 'Jane Doe' // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:399:89
 
   async bulkAddPasswords(
     entries: Partial<VaultEntry>[]
-  ): Promise<{ total: number; weak: number; missingFields: number; weakIds: number[] }> {
-    return this.withMutationLock(async () => {
-      const result = await VaultEntryService.bulkAddPasswords({
-        entries,
-        aesKey: this.aesKey,
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        generateEntryId: () => Math.floor(Math.random() * 1000000000),
-        calculateStrength: (password) => VaultCryptoService.calculateStrength(password),
-        buildMetadataAtRest: (title, username, website, category, tags) =>
-          this.buildMetadataAtRest(title, username, website, category, tags),
-      });
-      this.decryptedEntriesCache = null;
-      return result;
-    });
-  }
+  ): Promise<{ total: number; weak: number; missingFields: number; weakIds: number[] }> {}
 
   async changeMasterPassword(
killedBy: VaultService coverage helpers bulkAddPasswords populates encrypted metadata fields and writes to SQLite
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] BlockStatement
src/vaultService.ts:400:46
   async bulkAddPasswords(
     entries: Partial<VaultEntry>[]
   ): Promise<{ total: number; weak: number; missingFields: number; weakIds: number[] }> {
-    return this.withMutationLock(async () => {
-      const result = await VaultEntryService.bulkAddPasswords({
-        entries,
-        aesKey: this.aesKey,
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        generateEntryId: () => Math.floor(Math.random() * 1000000000),
-        calculateStrength: (password) => VaultCryptoService.calculateStrength(password),
-        buildMetadataAtRest: (title, username, website, category, tags) =>
-          this.buildMetadataAtRest(title, username, website, category, tags),
-      });
-      this.decryptedEntriesCache = null;
-      return result;
-    });
+    return this.withMutationLock(async () => {});
   }
 
killedBy: VaultService Security & Cryptography 8. Toplu Veri Ekleme: bulkAddPasswords ile hizli iceri aktarma
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] ArrowFunction
src/vaultService.ts:431:25
         sqliteDb: this.sqliteDb,
         useSQLite: this.useSQLite,
         aesKey: this.aesKey,
-        verifyPassword: (password, stored) =>
-          VaultAuthService.verifyPassword(
-            password,
-            stored,
-            VaultAuthService.calibrateArgon2Params()
-          ),
+        verifyPassword: () => undefined,
         getPasswords: () => this.getPasswords(),
         deriveMasterKey: async (password, key, salt) =>
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Invalid current password

[Killed] ArrowFunction
src/vaultService.ts:437:23
             stored,
             VaultAuthService.calibrateArgon2Params()
           ),
-        getPasswords: () => this.getPasswords(),
+        getPasswords: () => undefined,
         deriveMasterKey: async (password, key, salt) =>
           (await this.deriveMasterKey(password, key, salt)).saltB64,
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: allEntries is not iterable

[Survived] ArrowFunction
src/vaultService.ts:438:26
             VaultAuthService.calibrateArgon2Params()
           ),
         getPasswords: () => this.getPasswords(),
-        deriveMasterKey: async (password, key, salt) =>
-          (await this.deriveMasterKey(password, key, salt)).saltB64,
+        deriveMasterKey: () => undefined,
         createAuthCredential: (password) =>
           VaultAuthService.createAuthCredential(password, VaultAuthService.calibrateArgon2Params()),

[Killed] ArrowFunction
src/vaultService.ts:440:31
         getPasswords: () => this.getPasswords(),
         deriveMasterKey: async (password, key, salt) =>
           (await this.deriveMasterKey(password, key, salt)).saltB64,
-        createAuthCredential: (password) =>
-          VaultAuthService.createAuthCredential(password, VaultAuthService.calibrateArgon2Params()),
+        createAuthCredential: () => undefined,
         buildMetadataAtRest: (t, u, w, c, tg) => this.buildMetadataAtRest(t, u, w, c, tg),
         encryptAttachmentMetadataList: (a) => this.encryptAttachmentMetadataList(a),
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Cannot read properties of undefined (reading 'salt')

[Killed] ArrowFunction
src/vaultService.ts:442:30
           (await this.deriveMasterKey(password, key, salt)).saltB64,
         createAuthCredential: (password) =>
           VaultAuthService.createAuthCredential(password, VaultAuthService.calibrateArgon2Params()),
-        buildMetadataAtRest: (t, u, w, c, tg) => this.buildMetadataAtRest(t, u, w, c, tg),
+        buildMetadataAtRest: () => undefined,
         encryptAttachmentMetadataList: (a) => this.encryptAttachmentMetadataList(a),
         getAesKey: () => this.aesKey,
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Cannot destructure property 'title' of '(intermediate value)' as it is undefined.

[Survived] ArrowFunction
src/vaultService.ts:443:40
         createAuthCredential: (password) =>
           VaultAuthService.createAuthCredential(password, VaultAuthService.calibrateArgon2Params()),
         buildMetadataAtRest: (t, u, w, c, tg) => this.buildMetadataAtRest(t, u, w, c, tg),
-        encryptAttachmentMetadataList: (a) => this.encryptAttachmentMetadataList(a),
+        encryptAttachmentMetadataList: () => undefined,
         getAesKey: () => this.aesKey,
       });

[Killed] ArrowFunction
src/vaultService.ts:444:20
           VaultAuthService.createAuthCredential(password, VaultAuthService.calibrateArgon2Params()),
         buildMetadataAtRest: (t, u, w, c, tg) => this.buildMetadataAtRest(t, u, w, c, tg),
         encryptAttachmentMetadataList: (a) => this.encryptAttachmentMetadataList(a),
-        getAesKey: () => this.aesKey,
+        getAesKey: () => undefined,
       });
       this.decryptedEntriesCache = null;
killedBy: VaultService Security & Cryptography 3. Parola Değiştirme: Yeni Salt, Anahtar Üretimi ve De-şifreleme (Re-encryption)
statusReason: Vault key unavailable

[Killed] BlockStatement
src/vaultService.ts:453:72
   async addAttachment(
     entryId: number,
     file: File
-  ): Promise<{ id: string; name: string; type: string; size: number }> {
-    return this.withMutationLock(async () => {
-      return VaultAttachmentService.addAttachment({
-        aesKey: this.aesKey,
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        file,
-        encryptAttachmentMetadataList: (attachments) =>
-          this.encryptAttachmentMetadataList(attachments),
-      });
-    });
-  }
+  ): Promise<{ id: string; name: string; type: string; size: number }> {}
 
   async getDecryptedAttachment(attachmentId: string): Promise<Blob> {
killedBy: VaultService coverage helpers addAttachment executes SQLite primary write path and updates entry attachments
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/vaultService.ts:454:46
     entryId: number,
     file: File
   ): Promise<{ id: string; name: string; type: string; size: number }> {
-    return this.withMutationLock(async () => {
-      return VaultAttachmentService.addAttachment({
-        aesKey: this.aesKey,
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        file,
-        encryptAttachmentMetadataList: (attachments) =>
-          this.encryptAttachmentMetadataList(attachments),
-      });
-    });
+    return this.withMutationLock(async () => {});
   }
 
killedBy: VaultService coverage helpers addAttachment executes SQLite primary write path and updates entry attachments
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/vaultService.ts:462:40
         useSQLite: this.useSQLite,
         entryId,
         file,
-        encryptAttachmentMetadataList: (attachments) =>
-          this.encryptAttachmentMetadataList(attachments),
+        encryptAttachmentMetadataList: () => undefined,
       });
     });
killedBy: VaultService Security & Cryptography 4. Metadata Encryption + Attachment Metadata: At-rest plaintext sizintisi olmamali
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/vaultService.ts:468:69
     });
   }
 
-  async getDecryptedAttachment(attachmentId: string): Promise<Blob> {
-    return VaultAttachmentService.getDecryptedAttachment({
-      aesKey: this.aesKey,
-      opfsMockDb: this.opfsMockDb,
-      sqliteDb: this.sqliteDb,
-      useSQLite: this.useSQLite,
-      attachmentId,
-    });
-  }
+  async getDecryptedAttachment(attachmentId: string): Promise<Blob> {}
 
   async deleteAttachment(entryId: number, attachmentId: string): Promise<void> {
killedBy: VaultService Security & Cryptography 11. Attachment Yönetimi: Silme ve deşifreleme
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] BlockStatement
src/vaultService.ts:478:80
     });
   }
 
-  async deleteAttachment(entryId: number, attachmentId: string): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultAttachmentService.deleteAttachment({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        attachmentId,
-      });
-      this.decryptedEntriesCache = null;
-    });
-  }
+  async deleteAttachment(entryId: number, attachmentId: string): Promise<void> {}
 
   async moveToTrash(entryId: number): Promise<void> {
killedBy: VaultService coverage helpers deleteAttachment executes SQLite deletion and password metadata update
statusReason: expected "vi.fn()" to be called with arguments: [ 'drop' ]

Number of calls: 0

[Killed] BlockStatement
src/vaultService.ts:479:46
   }
 
   async deleteAttachment(entryId: number, attachmentId: string): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultAttachmentService.deleteAttachment({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        attachmentId,
-      });
-      this.decryptedEntriesCache = null;
-    });
+    return this.withMutationLock(async () => {});
   }
 
killedBy: VaultService coverage helpers deleteAttachment executes SQLite deletion and password metadata update
statusReason: expected "vi.fn()" to be called with arguments: [ 'drop' ]

Number of calls: 0

[Killed] BlockStatement
src/vaultService.ts:491:53
     });
   }
 
-  async moveToTrash(entryId: number): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.moveToTrash({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
-      });
-    });
-  }
+  async moveToTrash(entryId: number): Promise<void> {}
 
   async restoreFromTrash(entryId: number): Promise<void> {
killedBy: VaultService Security & Cryptography 9. Trash Yönetimi: Çöp kutusuna taşıma ve geri yükleme
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:492:46
   }
 
   async moveToTrash(entryId: number): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.moveToTrash({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
-      });
-    });
+    return this.withMutationLock(async () => {});
   }
 
killedBy: VaultService Security & Cryptography 9. Trash Yönetimi: Çöp kutusuna taşıma ve geri yükleme
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/vaultService.ts:498:32
         sqliteDb: this.sqliteDb,
         useSQLite: this.useSQLite,
         entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
+        invalidateCache: () => {},
       });
     });

[Killed] BlockStatement
src/vaultService.ts:505:58
     });
   }
 
-  async restoreFromTrash(entryId: number): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.restoreFromTrash({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
-      });
-    });
-  }
+  async restoreFromTrash(entryId: number): Promise<void> {}
 
   async deletePermanently(entryId: number): Promise<void> {
killedBy: VaultService SQLite Branch Coverage 2. restoreFromTrash path with SQLite
statusReason: expected "vi.fn()" to be called with arguments: [ 123, 'deleted_at', null ]

Number of calls: 0

[Killed] BlockStatement
src/vaultService.ts:506:46
   }
 
   async restoreFromTrash(entryId: number): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.restoreFromTrash({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
-      });
-    });
+    return this.withMutationLock(async () => {});
   }
 
killedBy: VaultService coverage helpers moveToTrash and restoreFromTrash execute SQLite write paths
statusReason: expected "vi.fn()" to be called with arguments: [ 31, 'deleted_at', null ]

Received: 

  1st vi.fn() call:

  [
    31,

[Killed] BlockStatement
src/vaultService.ts:519:59
     });
   }
 
-  async deletePermanently(entryId: number): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.deletePermanently({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
-      });
-    });
-  }
+  async deletePermanently(entryId: number): Promise<void> {}
 
   async emptyTrash(): Promise<void> {
killedBy: VaultService Security & Cryptography 15. Otomatik Temizlik: 30 günü geçmiş çöpleri silme
statusReason: expected { id: 233637426, …(23) } to be undefined

[Killed] BlockStatement
src/vaultService.ts:520:46
   }
 
   async deletePermanently(entryId: number): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.deletePermanently({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
-      });
-    });
+    return this.withMutationLock(async () => {});
   }
 
killedBy: VaultService coverage helpers deletePermanently removes IDB attachments before deleting the entry
statusReason: expected "vi.fn()" to be called with arguments: [ 'passwords', 'readwrite' ]

Number of calls: 0

[Killed] ObjectLiteral
src/vaultService.ts:521:49
 
   async deletePermanently(entryId: number): Promise<void> {
     return this.withMutationLock(async () => {
-      await VaultTrashService.deletePermanently({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-        entryId,
-        invalidateCache: () => {
-          this.decryptedEntriesCache = null;
-        },
-      });
+      await VaultTrashService.deletePermanently({});
     });
   }
killedBy: VaultService Security & Cryptography 13. Kalıcı Silme: Artıklarıyla birlikte yok etme
statusReason: invalidateCache is not a function

[Killed] BlockStatement
src/vaultService.ts:533:37
     });
   }
 
-  async emptyTrash(): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.emptyTrash({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-      });
-      this.decryptedEntriesCache = null;
-    });
-  }
+  async emptyTrash(): Promise<void> {}
 
   async cleanupTrash(): Promise<void> {
killedBy: VaultService Security & Cryptography 14. Çöpü Boşaltma: Tüm silinmişleri temizle
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:534:46
   }
 
   async emptyTrash(): Promise<void> {
-    return this.withMutationLock(async () => {
-      await VaultTrashService.emptyTrash({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-      });
-      this.decryptedEntriesCache = null;
-    });
+    return this.withMutationLock(async () => {});
   }
 
killedBy: VaultService coverage helpers emptyTrash executes both IDB and SQLite cleanup branches
statusReason: expected "vi.fn()" to be called with arguments: [ 'attachments', 'att-1' ]

Number of calls: 0

[Killed] ObjectLiteral
src/vaultService.ts:535:42
 
   async emptyTrash(): Promise<void> {
     return this.withMutationLock(async () => {
-      await VaultTrashService.emptyTrash({
-        opfsMockDb: this.opfsMockDb,
-        sqliteDb: this.sqliteDb,
-        useSQLite: this.useSQLite,
-      });
+      await VaultTrashService.emptyTrash({});
       this.decryptedEntriesCache = null;
     });
killedBy: VaultService Security & Cryptography 14. Çöpü Boşaltma: Tüm silinmişleri temizle
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/vaultService.ts:544:39
     });
   }
 
-  async cleanupTrash(): Promise<void> {
-    await VaultTrashService.cleanupTrash({
-      opfsMockDb: this.opfsMockDb,
-      deletePermanently: (id) => this.deletePermanently(id),
-    });
-  }
+  async cleanupTrash(): Promise<void> {}
 
   async saveSecurityPins(duressPin: string, killPin: string): Promise<void> {
killedBy: VaultService coverage helpers cleanupTrash skips when db missing and deletes old trashed entries
statusReason: expected "deletePermanently" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/vaultService.ts:547:26
   async cleanupTrash(): Promise<void> {
     await VaultTrashService.cleanupTrash({
       opfsMockDb: this.opfsMockDb,
-      deletePermanently: (id) => this.deletePermanently(id),
+      deletePermanently: () => undefined,
     });
   }
killedBy: VaultService Security & Cryptography 15. Otomatik Temizlik: 30 günü geçmiş çöpleri silme
statusReason: expected { id: 303850855, …(23) } to be undefined

[NoCoverage] BlockStatement
src/vaultService.ts:551:77
     });
   }
 
-  async saveSecurityPins(duressPin: string, killPin: string): Promise<void> {
-    await VaultPinService.saveSecurityPins({
-      aesKey: this.aesKey,
-      opfsMockDb: this.opfsMockDb,
-      sqliteDb: this.sqliteDb,
-      useSQLite: this.useSQLite,
-      duressPin,
-      killPin,
-      randomBytes: (len: number) => window.crypto.getRandomValues(new Uint8Array(len)),
-    });
-  }
+  async saveSecurityPins(duressPin: string, killPin: string): Promise<void> {}
 
   async getSecurityPins(): Promise<{ duressPin: string; killPin: string }> {

[NoCoverage] ArrowFunction
src/vaultService.ts:559:20
       useSQLite: this.useSQLite,
       duressPin,
       killPin,
-      randomBytes: (len: number) => window.crypto.getRandomValues(new Uint8Array(len)),
+      randomBytes: () => undefined,
     });
   }

[NoCoverage] BlockStatement
src/vaultService.ts:563:76
     });
   }
 
-  async getSecurityPins(): Promise<{ duressPin: string; killPin: string }> {
-    return VaultPinService.getSecurityPins({
-      aesKey: this.aesKey,
-      opfsMockDb: this.opfsMockDb,
-      sqliteDb: this.sqliteDb,
-      useSQLite: this.useSQLite,
-    });
-  }
+  async getSecurityPins(): Promise<{ duressPin: string; killPin: string }> {}
 
   async getSearchIndexHmacKey(): Promise<CryptoKey> {

[Killed] BlockStatement
src/vaultService.ts:572:53
     });
   }
 
-  async getSearchIndexHmacKey(): Promise<CryptoKey> {
-    if (this.searchIndexHmacKey) return this.searchIndexHmacKey;
-    if (!this.sensitiveMaterial && !this.aesKey)
-      throw new Error('Lock required for HMAC key derivation');
-    const key = await VaultSearchIndexer.getOrCreateHmacKey(this.sensitiveMaterial, null);
-    this.searchIndexHmacKey = key;
-    return key;
-  }
+  async getSearchIndexHmacKey(): Promise<CryptoKey> {}
 
   async lock(): Promise<void> {
killedBy: VaultService Security & Cryptography 32. prepareEntryMetadataForUse constructs search_index correctly
statusReason: Failed to execute 'sign' on 'SubtleCrypto': 2nd argument is not of type CryptoKey.

[Killed] ConditionalExpression
src/vaultService.ts:573:9
   }
 
   async getSearchIndexHmacKey(): Promise<CryptoKey> {
-    if (this.searchIndexHmacKey) return this.searchIndexHmacKey;
+    if (true) return this.searchIndexHmacKey;
     if (!this.sensitiveMaterial && !this.aesKey)
       throw new Error('Lock required for HMAC key derivation');
killedBy: VaultService Security & Cryptography 32. prepareEntryMetadataForUse constructs search_index correctly
statusReason: Failed to execute 'sign' on 'SubtleCrypto': 2nd argument is not of type CryptoKey.

[Survived] ConditionalExpression
src/vaultService.ts:573:9
   }
 
   async getSearchIndexHmacKey(): Promise<CryptoKey> {
-    if (this.searchIndexHmacKey) return this.searchIndexHmacKey;
+    if (false) return this.searchIndexHmacKey;
     if (!this.sensitiveMaterial && !this.aesKey)
       throw new Error('Lock required for HMAC key derivation');

[Killed] ConditionalExpression
src/vaultService.ts:574:9
 
   async getSearchIndexHmacKey(): Promise<CryptoKey> {
     if (this.searchIndexHmacKey) return this.searchIndexHmacKey;
-    if (!this.sensitiveMaterial && !this.aesKey)
+    if (true)
       throw new Error('Lock required for HMAC key derivation');
     const key = await VaultSearchIndexer.getOrCreateHmacKey(this.sensitiveMaterial, null);
killedBy: VaultService Security & Cryptography 32. prepareEntryMetadataForUse constructs search_index correctly
statusReason: Lock required for HMAC key derivation
