[Survived] BooleanLiteral
src/vaultService.ts:574:9
 
   async getSearchIndexHmacKey(): Promise<CryptoKey> {
     if (this.searchIndexHmacKey) return this.searchIndexHmacKey;
-    if (!this.sensitiveMaterial && !this.aesKey)
+    if (this.sensitiveMaterial && !this.aesKey)
       throw new Error('Lock required for HMAC key derivation');
     const key = await VaultSearchIndexer.getOrCreateHmacKey(this.sensitiveMaterial, null);

[NoCoverage] StringLiteral
src/vaultService.ts:575:23
   async getSearchIndexHmacKey(): Promise<CryptoKey> {
     if (this.searchIndexHmacKey) return this.searchIndexHmacKey;
     if (!this.sensitiveMaterial && !this.aesKey)
-      throw new Error('Lock required for HMAC key derivation');
+      throw new Error("");
     const key = await VaultSearchIndexer.getOrCreateHmacKey(this.sensitiveMaterial, null);
     this.searchIndexHmacKey = key;

[Killed] BlockStatement
src/vaultService.ts:581:31
     return key;
   }
 
-  async lock(): Promise<void> {
-    if (this.sensitiveMaterial) {
-      window.crypto.getRandomValues(this.sensitiveMaterial);
-      this.sensitiveMaterial = null;
-    }
-    this.aesKey = null;
-    this.searchIndexHmacKey = null;
-
-    if (this.sqliteDb) {
-      this.sqliteDb.close();
-      this.sqliteDb = null;
-    }
-    if (this.opfsMockDb) {
-      this.opfsMockDb.close();
-      this.opfsMockDb = null;
-    }
-
-    this.useSQLite = false;
-    this.decryptedEntriesCache = null;
-    this.isConnected = false;
-    this.activeVaultDbNames = [];
-    console.log('[SQLite-OPFS] Vault locked.');
-  }
+  async lock(): Promise<void> {}
 }
 
killedBy: VaultService Security & Cryptography 16. Fabrika Ayarlarına Sıfırlama: wipeAllData ile her şeyi temizleme
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/vaultService.ts:582:9
   }
 
   async lock(): Promise<void> {
-    if (this.sensitiveMaterial) {
+    if (false) {
       window.crypto.getRandomValues(this.sensitiveMaterial);
       this.sensitiveMaterial = null;
killedBy: VaultService Security & Cryptography 22. Lock: Tüm hassas materyalleri ve bağlantıları temizlemeli
statusReason: expected Uint8Array[ 153, 234, 173, 191, …(-145) ] to be null

[Killed] ConditionalExpression
src/vaultService.ts:582:9
   }
 
   async lock(): Promise<void> {
-    if (this.sensitiveMaterial) {
+    if (true) {
       window.crypto.getRandomValues(this.sensitiveMaterial);
       this.sensitiveMaterial = null;
killedBy: VaultService: Attachments & Trash Cleanup 4. wipeAllData: Tüm veri depolarını temizler
statusReason: The data argument must be an integer-type TypedArray

[Killed] ConditionalExpression
src/vaultService.ts:589:9
     this.aesKey = null;
     this.searchIndexHmacKey = null;
 
-    if (this.sqliteDb) {
+    if (true) {
       this.sqliteDb.close();
       this.sqliteDb = null;
killedBy: Private Search Index Benchmark indexes and queries medium dataset in acceptable time
statusReason: Cannot read properties of null (reading 'close')

[NoCoverage] BlockStatement
src/vaultService.ts:589:24
     this.aesKey = null;
     this.searchIndexHmacKey = null;
 
-    if (this.sqliteDb) {
-      this.sqliteDb.close();
-      this.sqliteDb = null;
-    }
+    if (this.sqliteDb) {}
     if (this.opfsMockDb) {
       this.opfsMockDb.close();

[Survived] BooleanLiteral
src/vaultService.ts:598:22
       this.opfsMockDb = null;
     }
 
-    this.useSQLite = false;
+    this.useSQLite = true;
     this.decryptedEntriesCache = null;
     this.isConnected = false;

[Killed] BooleanLiteral
src/vaultService.ts:600:24
 
     this.useSQLite = false;
     this.decryptedEntriesCache = null;
-    this.isConnected = false;
+    this.isConnected = true;
     this.activeVaultDbNames = [];
     console.log('[SQLite-OPFS] Vault locked.');
killedBy: VaultService Security & Cryptography 16. Fabrika Ayarlarına Sıfırlama: wipeAllData ile her şeyi temizleme
statusReason: expected true to be false // Object.is equality
