[Killed] ArrowFunction
src/lib/webAuthn.ts:37:23
   };
 };
 
-const toArrayBuffer = (value: BufferSource): ArrayBuffer =>
-  value instanceof ArrayBuffer
-    ? value
-    : value.buffer.slice(value.byteOffset, value.byteOffset + value.byteLength);
+const toArrayBuffer = () => undefined;
 
 export const bufferToBase64url = (buffer: ArrayBuffer): string => {
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 170 // Object.is equality

[Killed] MethodExpression
src/lib/webAuthn.ts:40:7
 const toArrayBuffer = (value: BufferSource): ArrayBuffer =>
   value instanceof ArrayBuffer
     ? value
-    : value.buffer.slice(value.byteOffset, value.byteOffset + value.byteLength);
+    : value.buffer;
 
 export const bufferToBase64url = (buffer: ArrayBuffer): string => {
killedBy: WebAuthn Utils & PRF Flow 12. registerPasskeyWithPRF handles Uint8Array slices
statusReason: expected 4 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/lib/webAuthn.ts:40:44
 const toArrayBuffer = (value: BufferSource): ArrayBuffer =>
   value instanceof ArrayBuffer
     ? value
-    : value.buffer.slice(value.byteOffset, value.byteOffset + value.byteLength);
+    : value.buffer.slice(value.byteOffset, value.byteOffset - value.byteLength);
 
 export const bufferToBase64url = (buffer: ArrayBuffer): string => {
killedBy: WebAuthn Utils & PRF Flow 12. registerPasskeyWithPRF handles Uint8Array slices
statusReason: expected 1 to be 3 // Object.is equality

[Killed] BlockStatement
src/lib/webAuthn.ts:42:67
     ? value
     : value.buffer.slice(value.byteOffset, value.byteOffset + value.byteLength);
 
-export const bufferToBase64url = (buffer: ArrayBuffer): string => {
-  const bytes = new Uint8Array(buffer);
-  let str = '';
-  for (const charCode of bytes) {
-    str += String.fromCharCode(charCode);
-  }
-  return btoa(str).replace(/\+/g, '-').replace(/\//g, '_').replace(/=/g, '');
-};
+export const bufferToBase64url = (buffer: ArrayBuffer): string => {};
 
 export const base64urlToBuffer = (base64url: string): ArrayBuffer => {
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: expected undefined to be 'SGVsbG8' // Object.is equality

[Killed] BlockStatement
src/lib/webAuthn.ts:45:33
 export const bufferToBase64url = (buffer: ArrayBuffer): string => {
   const bytes = new Uint8Array(buffer);
   let str = '';
-  for (const charCode of bytes) {
-    str += String.fromCharCode(charCode);
-  }
+  for (const charCode of bytes) {}
   return btoa(str).replace(/\+/g, '-').replace(/\//g, '_').replace(/=/g, '');
 };
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: expected '' to be 'SGVsbG8' // Object.is equality

[Killed] AssignmentOperator
src/lib/webAuthn.ts:46:5
   const bytes = new Uint8Array(buffer);
   let str = '';
   for (const charCode of bytes) {
-    str += String.fromCharCode(charCode);
+    str -= String.fromCharCode(charCode);
   }
   return btoa(str).replace(/\+/g, '-').replace(/\//g, '_').replace(/=/g, '');
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: expected 'TmFO' to be 'SGVsbG8' // Object.is equality

[Killed] StringLiteral
src/lib/webAuthn.ts:48:55
   for (const charCode of bytes) {
     str += String.fromCharCode(charCode);
   }
-  return btoa(str).replace(/\+/g, '-').replace(/\//g, '_').replace(/=/g, '');
+  return btoa(str).replace(/\+/g, '-').replace(/\//g, "").replace(/=/g, '');
 };
 
killedBy: WebAuthn Utils & PRF Flow 6. Base64url edge cases: padding and special chars
statusReason: expected '-8' to be '-_8' // Object.is equality

[Killed] BlockStatement
src/lib/webAuthn.ts:51:70
   return btoa(str).replace(/\+/g, '-').replace(/\//g, '_').replace(/=/g, '');
 };
 
-export const base64urlToBuffer = (base64url: string): ArrayBuffer => {
-  const base64 = base64url.replace(/-/g, '+').replace(/_/g, '/');
-  const padLen = (4 - (base64.length % 4)) % 4;
-  const padded = base64 + '='.repeat(padLen);
-  const str = atob(padded);
-  const buffer = new ArrayBuffer(str.length);
-  const bytes = new Uint8Array(buffer);
-  for (let i = 0; i < str.length; i++) {
-    bytes[i] = str.charCodeAt(i);
-  }
-  return buffer;
-};
+export const base64urlToBuffer = (base64url: string): ArrayBuffer => {};
 
 // WebAuthn PRF Encrypt Payload (True Zero-Knowledge Passkey Vault)
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: expected Uint8Array[] to deeply equal Uint8Array[ 72, 101, 108, 108, 111 ]

[Killed] ArithmeticOperator
src/lib/webAuthn.ts:53:18
 
 export const base64urlToBuffer = (base64url: string): ArrayBuffer => {
   const base64 = base64url.replace(/-/g, '+').replace(/_/g, '/');
-  const padLen = (4 - (base64.length % 4)) % 4;
+  const padLen = (4 - base64.length % 4) * 4;
   const padded = base64 + '='.repeat(padLen);
   const str = atob(padded);
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: Invalid character

[Killed] ArithmeticOperator
src/lib/webAuthn.ts:53:19
 
 export const base64urlToBuffer = (base64url: string): ArrayBuffer => {
   const base64 = base64url.replace(/-/g, '+').replace(/_/g, '/');
-  const padLen = (4 - (base64.length % 4)) % 4;
+  const padLen = (4 + base64.length % 4) % 4;
   const padded = base64 + '='.repeat(padLen);
   const str = atob(padded);
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: Invalid character

[Killed] ArithmeticOperator
src/lib/webAuthn.ts:54:18
 export const base64urlToBuffer = (base64url: string): ArrayBuffer => {
   const base64 = base64url.replace(/-/g, '+').replace(/_/g, '/');
   const padLen = (4 - (base64.length % 4)) % 4;
-  const padded = base64 + '='.repeat(padLen);
+  const padded = base64 - '='.repeat(padLen);
   const str = atob(padded);
   const buffer = new ArrayBuffer(str.length);
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: expected Uint8Array[ 53, 163 ] to deeply equal Uint8Array[ 72, 101, 108, 108, 111 ]

[Killed] ConditionalExpression
src/lib/webAuthn.ts:58:19
   const str = atob(padded);
   const buffer = new ArrayBuffer(str.length);
   const bytes = new Uint8Array(buffer);
-  for (let i = 0; i < str.length; i++) {
+  for (let i = 0; false; i++) {
     bytes[i] = str.charCodeAt(i);
   }
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: expected Uint8Array[ 0, 0, 0, 0, 0 ] to deeply equal Uint8Array[ 72, 101, 108, 108, 111 ]

[Killed] EqualityOperator
src/lib/webAuthn.ts:58:19
   const str = atob(padded);
   const buffer = new ArrayBuffer(str.length);
   const bytes = new Uint8Array(buffer);
-  for (let i = 0; i < str.length; i++) {
+  for (let i = 0; i >= str.length; i++) {
     bytes[i] = str.charCodeAt(i);
   }
killedBy: WebAuthn Utils & PRF Flow 1. Roundtrip: buffer -> base64url -> buffer
statusReason: expected Uint8Array[ 0, 0, 0, 0, 0 ] to deeply equal Uint8Array[ 72, 101, 108, 108, 111 ]

[Killed] BlockStatement
src/lib/webAuthn.ts:68:23
 export const encryptWithPRF = async (
   prfKeyBuffer: ArrayBuffer,
   plaintext: string
-): Promise<string> => {
-  const key = await window.crypto.subtle.importKey(
-    'raw',
-    toBufferSource(new Uint8Array(prfKeyBuffer)),
-    { name: 'AES-GCM', length: 256 },
-    false,
-    ['encrypt']
-  );
-  const iv = window.crypto.getRandomValues(new Uint8Array(12));
-  const encodedPlaintext = new TextEncoder().encode(plaintext);
-
-  const ciphertext = await window.crypto.subtle.encrypt(
-    { name: 'AES-GCM', iv: toBufferSource(iv) },
-    key,
-    toBufferSource(encodedPlaintext)
-  );
-
-  // Concat IV + Ciphertext and save as Base64url
-  const combined = new Uint8Array(iv.length + ciphertext.byteLength);
-  combined.set(iv, 0);
-  combined.set(new Uint8Array(ciphertext), iv.length);
-
-  return bufferToBase64url(toBufferSource(combined) as ArrayBuffer);
-};
+): Promise<string> => {};
 
 export const decryptWithPRF = async (
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] StringLiteral
src/lib/webAuthn.ts:72:13
   const key = await window.crypto.subtle.importKey(
     'raw',
     toBufferSource(new Uint8Array(prfKeyBuffer)),
-    { name: 'AES-GCM', length: 256 },
+    { name: "", length: 256 },
     false,
     ['encrypt']
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: Unrecognized algorithm name

[Survived] BooleanLiteral
src/lib/webAuthn.ts:73:5
     'raw',
     toBufferSource(new Uint8Array(prfKeyBuffer)),
     { name: 'AES-GCM', length: 256 },
-    false,
+    true,
     ['encrypt']
   );

[Killed] ArrayDeclaration
src/lib/webAuthn.ts:74:5
     toBufferSource(new Uint8Array(prfKeyBuffer)),
     { name: 'AES-GCM', length: 256 },
     false,
-    ['encrypt']
+    []
   );
   const iv = window.crypto.getRandomValues(new Uint8Array(12));
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: Usages cannot be empty when importing a secret key.

[Killed] ObjectLiteral
src/lib/webAuthn.ts:80:5
   const encodedPlaintext = new TextEncoder().encode(plaintext);
 
   const ciphertext = await window.crypto.subtle.encrypt(
-    { name: 'AES-GCM', iv: toBufferSource(iv) },
+    {},
     key,
     toBufferSource(encodedPlaintext)
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: Failed to normalize algorithm: passed algorithm can not be converted to 'Algorithm' because 'name' is required in 'Algorithm'.

[Killed] ArithmeticOperator
src/lib/webAuthn.ts:86:35
   );
 
   // Concat IV + Ciphertext and save as Base64url
-  const combined = new Uint8Array(iv.length + ciphertext.byteLength);
+  const combined = new Uint8Array(iv.length - ciphertext.byteLength);
   combined.set(iv, 0);
   combined.set(new Uint8Array(ciphertext), iv.length);
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: Invalid typed array length: -18

[Killed] BlockStatement
src/lib/webAuthn.ts:96:23
 export const decryptWithPRF = async (
   prfKeyBuffer: ArrayBuffer,
   encryptedDataB64: string
-): Promise<string> => {
-  const key = await window.crypto.subtle.importKey(
-    'raw',
-    toBufferSource(new Uint8Array(prfKeyBuffer)),
-    { name: 'AES-GCM', length: 256 },
-    false,
-    ['decrypt']
-  );
-
-  const combined = new Uint8Array(base64urlToBuffer(encryptedDataB64));
-  const iv = combined.slice(0, 12);
-  const ciphertext = combined.slice(12);
-
-  const decrypted = await window.crypto.subtle.decrypt(
-    { name: 'AES-GCM', iv: toBufferSource(iv) },
-    key,
-    toBufferSource(ciphertext)
-  );
-
-  return new TextDecoder().decode(decrypted);
-};
+): Promise<string> => {};
 
 export const registerPasskeyWithPRF = async (): Promise<{
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: expected undefined to be 'Secret Message' // Object.is equality

[Killed] MethodExpression
src/lib/webAuthn.ts:106:14
   );
 
   const combined = new Uint8Array(base64urlToBuffer(encryptedDataB64));
-  const iv = combined.slice(0, 12);
+  const iv = combined;
   const ciphertext = combined.slice(12);
 
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: The operation failed for an operation-specific reason

[Killed] MethodExpression
src/lib/webAuthn.ts:107:22
 
   const combined = new Uint8Array(base64urlToBuffer(encryptedDataB64));
   const iv = combined.slice(0, 12);
-  const ciphertext = combined.slice(12);
+  const ciphertext = combined;
 
   const decrypted = await window.crypto.subtle.decrypt(
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: The operation failed for an operation-specific reason

[Killed] StringLiteral
src/lib/webAuthn.ts:110:13
   const ciphertext = combined.slice(12);
 
   const decrypted = await window.crypto.subtle.decrypt(
-    { name: 'AES-GCM', iv: toBufferSource(iv) },
+    { name: "", iv: toBufferSource(iv) },
     key,
     toBufferSource(ciphertext)
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: Unrecognized algorithm name

[Killed] ObjectLiteral
src/lib/webAuthn.ts:110:5
   const ciphertext = combined.slice(12);
 
   const decrypted = await window.crypto.subtle.decrypt(
-    { name: 'AES-GCM', iv: toBufferSource(iv) },
+    {},
     key,
     toBufferSource(ciphertext)
killedBy: WebAuthn Utils & PRF Flow 2. encryptWithPRF / decryptWithPRF roundtrip
statusReason: Failed to normalize algorithm: passed algorithm can not be converted to 'Algorithm' because 'name' is required in 'Algorithm'.

[Killed] BlockStatement
src/lib/webAuthn.ts:123:36
   salt: string;
   prfKey: ArrayBuffer;
 } | null> => {
-  if (!window.PublicKeyCredential) {
-    throw new Error('WebAuthn is not supported in this browser.');
-  }
+  if (!window.PublicKeyCredential) {}
 
   const challenge = window.crypto.getRandomValues(new Uint8Array(32));
killedBy: WebAuthn Utils & PRF Flow 10. throws if WebAuthn is unsupported during registration
statusReason: promise resolved "null" instead of rejecting

[Killed] ConditionalExpression
src/lib/webAuthn.ts:123:7
   salt: string;
   prfKey: ArrayBuffer;
 } | null> => {
-  if (!window.PublicKeyCredential) {
+  if (true) {
     throw new Error('WebAuthn is not supported in this browser.');
   }
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: WebAuthn is not supported in this browser.

[Killed] ObjectLiteral
src/lib/webAuthn.ts:134:11
   const publicKey: CreationOptionsWithPrf = {
     challenge,
     rp: { name: 'Aegis Vault Local' },
-    user: { id: userId, name: 'vault_user', displayName: 'Aegis Vault Owner' },
+    user: {},
     pubKeyCredParams: [
       { type: 'public-key', alg: -7 }, // ES256
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'vault_user' // Object.is equality

[Killed] StringLiteral
src/lib/webAuthn.ts:134:31
   const publicKey: CreationOptionsWithPrf = {
     challenge,
     rp: { name: 'Aegis Vault Local' },
-    user: { id: userId, name: 'vault_user', displayName: 'Aegis Vault Owner' },
+    user: { id: userId, name: "", displayName: 'Aegis Vault Owner' },
     pubKeyCredParams: [
       { type: 'public-key', alg: -7 }, // ES256
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected '' to be 'vault_user' // Object.is equality

[Killed] ObjectLiteral
src/lib/webAuthn.ts:137:7
     user: { id: userId, name: 'vault_user', displayName: 'Aegis Vault Owner' },
     pubKeyCredParams: [
       { type: 'public-key', alg: -7 }, // ES256
-      { type: 'public-key', alg: -257 }, // RS256
+      {}, // RS256
     ],
     authenticatorSelection: { userVerification: 'preferred' },
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected [ { type: 'public-key', alg: -7 }, {} ] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/lib/webAuthn.ts:142:17
     authenticatorSelection: { userVerification: 'preferred' },
     timeout: 60000,
     attestation: 'none',
-    extensions: {
-      prf: {
-        eval: {
-          first: prfSalt,
-        },
-      },
-    },
+    extensions: {},
   };
 
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: Cannot read properties of undefined (reading 'eval')

[Killed] ObjectLiteral
src/lib/webAuthn.ts:144:15
     attestation: 'none',
     extensions: {
       prf: {
-        eval: {
-          first: prfSalt,
-        },
+        eval: {},
       },
     },
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: Cannot read properties of undefined (reading 'byteLength')

[Killed] BlockStatement
src/lib/webAuthn.ts:151:7
     },
   };
 
-  try {
-    const credential = (await navigator.credentials.create({
-      publicKey,
-    })) as PublicKeyCredentialWithExtensions | null;
-    if (credential) {
-      const extensionResults = credential.getClientExtensionResults();
-      if (extensionResults.prf && extensionResults.prf.enabled) {
-        // Some authenticators return results on creation, some don't.
-        // If we don't have .results.first here, we need to assert immediately to get the PRF key.
-        if (extensionResults.prf.results && extensionResults.prf.results.first) {
-          return {
-            id: credential.id,
-            salt: bufferToBase64url(prfSalt.buffer),
-            prfKey: toArrayBuffer(extensionResults.prf.results.first),
-          };
-        } else {
-          // Re-authenticate immediately to fetch the PRF key
-          return null; // For simplicity in this demo, we expect it during creation (Chromium 116+) or we will fall back on the caller side.
-        }
-      }
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.error('Passkey PRF registration failed:', error);
   }
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'cred_123' // Object.is equality

[Killed] BlockStatement
src/lib/webAuthn.ts:155:21
     const credential = (await navigator.credentials.create({
       publicKey,
     })) as PublicKeyCredentialWithExtensions | null;
-    if (credential) {
-      const extensionResults = credential.getClientExtensionResults();
-      if (extensionResults.prf && extensionResults.prf.enabled) {
-        // Some authenticators return results on creation, some don't.
-        // If we don't have .results.first here, we need to assert immediately to get the PRF key.
-        if (extensionResults.prf.results && extensionResults.prf.results.first) {
-          return {
-            id: credential.id,
-            salt: bufferToBase64url(prfSalt.buffer),
-            prfKey: toArrayBuffer(extensionResults.prf.results.first),
-          };
-        } else {
-          // Re-authenticate immediately to fetch the PRF key
-          return null; // For simplicity in this demo, we expect it during creation (Chromium 116+) or we will fall back on the caller side.
-        }
-      }
-    }
+    if (credential) {}
   } catch (error) {
     console.error('Passkey PRF registration failed:', error);
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'cred_123' // Object.is equality

[Killed] ConditionalExpression
src/lib/webAuthn.ts:155:9
     const credential = (await navigator.credentials.create({
       publicKey,
     })) as PublicKeyCredentialWithExtensions | null;
-    if (credential) {
+    if (false) {
       const extensionResults = credential.getClientExtensionResults();
       if (extensionResults.prf && extensionResults.prf.enabled) {
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'cred_123' // Object.is equality

[Killed] BlockStatement
src/lib/webAuthn.ts:157:65
     })) as PublicKeyCredentialWithExtensions | null;
     if (credential) {
       const extensionResults = credential.getClientExtensionResults();
-      if (extensionResults.prf && extensionResults.prf.enabled) {
-        // Some authenticators return results on creation, some don't.
-        // If we don't have .results.first here, we need to assert immediately to get the PRF key.
-        if (extensionResults.prf.results && extensionResults.prf.results.first) {
-          return {
-            id: credential.id,
-            salt: bufferToBase64url(prfSalt.buffer),
-            prfKey: toArrayBuffer(extensionResults.prf.results.first),
-          };
-        } else {
-          // Re-authenticate immediately to fetch the PRF key
-          return null; // For simplicity in this demo, we expect it during creation (Chromium 116+) or we will fall back on the caller side.
-        }
-      }
+      if (extensionResults.prf && extensionResults.prf.enabled) {}
     }
   } catch (error) {
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'cred_123' // Object.is equality

[Killed] ConditionalExpression
src/lib/webAuthn.ts:157:11
     })) as PublicKeyCredentialWithExtensions | null;
     if (credential) {
       const extensionResults = credential.getClientExtensionResults();
-      if (extensionResults.prf && extensionResults.prf.enabled) {
+      if (false) {
         // Some authenticators return results on creation, some don't.
         // If we don't have .results.first here, we need to assert immediately to get the PRF key.
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'cred_123' // Object.is equality

[Killed] BlockStatement
src/lib/webAuthn.ts:160:81
       if (extensionResults.prf && extensionResults.prf.enabled) {
         // Some authenticators return results on creation, some don't.
         // If we don't have .results.first here, we need to assert immediately to get the PRF key.
-        if (extensionResults.prf.results && extensionResults.prf.results.first) {
-          return {
-            id: credential.id,
-            salt: bufferToBase64url(prfSalt.buffer),
-            prfKey: toArrayBuffer(extensionResults.prf.results.first),
-          };
-        } else {
+        if (extensionResults.prf.results && extensionResults.prf.results.first) {} else {
           // Re-authenticate immediately to fetch the PRF key
           return null; // For simplicity in this demo, we expect it during creation (Chromium 116+) or we will fall back on the caller side.
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'cred_123' // Object.is equality

[Killed] ConditionalExpression
src/lib/webAuthn.ts:160:13
       if (extensionResults.prf && extensionResults.prf.enabled) {
         // Some authenticators return results on creation, some don't.
         // If we don't have .results.first here, we need to assert immediately to get the PRF key.
-        if (extensionResults.prf.results && extensionResults.prf.results.first) {
+        if (false) {
           return {
             id: credential.id,
killedBy: WebAuthn Utils & PRF Flow 3. registerPasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 'cred_123' // Object.is equality

[Survived] BlockStatement
src/lib/webAuthn.ts:166:16
             salt: bufferToBase64url(prfSalt.buffer),
             prfKey: toArrayBuffer(extensionResults.prf.results.first),
           };
-        } else {
-          // Re-authenticate immediately to fetch the PRF key
-          return null; // For simplicity in this demo, we expect it during creation (Chromium 116+) or we will fall back on the caller side.
-        }
+        } else {}
       }
     }

[Survived] BlockStatement
src/lib/webAuthn.ts:172:19
         }
       }
     }
-  } catch (error) {
-    console.error('Passkey PRF registration failed:', error);
-  }
+  } catch (error) {}
   return null;
 };

[Killed] ConditionalExpression
src/lib/webAuthn.ts:182:7
   credentialId: string,
   saltB64: string
 ): Promise<ArrayBuffer | null> => {
-  if (!window.PublicKeyCredential) {
+  if (true) {
     throw new Error('WebAuthn is not supported.');
   }
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: WebAuthn is not supported.

[Killed] BooleanLiteral
src/lib/webAuthn.ts:182:7
   credentialId: string,
   saltB64: string
 ): Promise<ArrayBuffer | null> => {
-  if (!window.PublicKeyCredential) {
+  if (window.PublicKeyCredential) {
     throw new Error('WebAuthn is not supported.');
   }
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: WebAuthn is not supported.

[Killed] StringLiteral
src/lib/webAuthn.ts:191:13
 
   const allowCredentials: PublicKeyCredentialDescriptor[] = [
     {
-      type: 'public-key',
+      type: "",
       id: base64urlToBuffer(credentialId),
     },
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: expected '' to be 'public-key' // Object.is equality

[Killed] ObjectLiteral
src/lib/webAuthn.ts:202:12
     userVerification: 'required',
     timeout: 60000,
     extensions: {
-      prf: {
-        eval: {
-          first: prfSalt,
-        },
-      },
+      prf: {},
     },
   };
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: Cannot read properties of undefined (reading 'first')

[Killed] BlockStatement
src/lib/webAuthn.ts:210:7
     },
   };
 
-  try {
-    const assertion = (await navigator.credentials.get({
-      publicKey,
-    })) as PublicKeyCredentialWithExtensions | null;
-    if (assertion) {
-      const extensionResults = assertion.getClientExtensionResults();
-      if (
-        extensionResults.prf &&
-        extensionResults.prf.results &&
-        extensionResults.prf.results.first
-      ) {
-        return toArrayBuffer(extensionResults.prf.results.first);
-      }
-    }
-  } catch (error) {
+  try {} catch (error) {
     console.error('Passkey PRF authentication failed:', error);
   }
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 32 // Object.is equality

[Killed] BlockStatement
src/lib/webAuthn.ts:214:20
     const assertion = (await navigator.credentials.get({
       publicKey,
     })) as PublicKeyCredentialWithExtensions | null;
-    if (assertion) {
-      const extensionResults = assertion.getClientExtensionResults();
-      if (
-        extensionResults.prf &&
-        extensionResults.prf.results &&
-        extensionResults.prf.results.first
-      ) {
-        return toArrayBuffer(extensionResults.prf.results.first);
-      }
-    }
+    if (assertion) {}
   } catch (error) {
     console.error('Passkey PRF authentication failed:', error);
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 32 // Object.is equality

[Killed] ConditionalExpression
src/lib/webAuthn.ts:214:9
     const assertion = (await navigator.credentials.get({
       publicKey,
     })) as PublicKeyCredentialWithExtensions | null;
-    if (assertion) {
+    if (false) {
       const extensionResults = assertion.getClientExtensionResults();
       if (
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 32 // Object.is equality

[Killed] ConditionalExpression
src/lib/webAuthn.ts:217:9
     if (assertion) {
       const extensionResults = assertion.getClientExtensionResults();
       if (
-        extensionResults.prf &&
-        extensionResults.prf.results &&
-        extensionResults.prf.results.first
+        false
       ) {
         return toArrayBuffer(extensionResults.prf.results.first);
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 32 // Object.is equality

[Survived] LogicalOperator
src/lib/webAuthn.ts:217:9
     if (assertion) {
       const extensionResults = assertion.getClientExtensionResults();
       if (
-        extensionResults.prf &&
-        extensionResults.prf.results &&
-        extensionResults.prf.results.first
+        extensionResults.prf && extensionResults.prf.results || extensionResults.prf.results.first
       ) {
         return toArrayBuffer(extensionResults.prf.results.first);

[Killed] BlockStatement
src/lib/webAuthn.ts:220:9
         extensionResults.prf &&
         extensionResults.prf.results &&
         extensionResults.prf.results.first
-      ) {
-        return toArrayBuffer(extensionResults.prf.results.first);
-      }
+      ) {}
     }
   } catch (error) {
killedBy: WebAuthn Utils & PRF Flow 4. authenticatePasskeyWithPRF: Success path and argument verification
statusReason: expected undefined to be 32 // Object.is equality

[Survived] BlockStatement
src/lib/webAuthn.ts:224:19
         return toArrayBuffer(extensionResults.prf.results.first);
       }
     }
-  } catch (error) {
-    console.error('Passkey PRF authentication failed:', error);
-  }
+  } catch (error) {}
   return null;
 };

[Survived] StringLiteral
src/lib/webAuthn.ts:225:19
       }
     }
   } catch (error) {
-    console.error('Passkey PRF authentication failed:', error);
+    console.error("", error);
   }
   return null;
